{
  "id": "consumer-products",
  "name": "Consumer Products",
  "description": "This theme covers how successful consumer products find product–market fit, then compound growth through retention, habit formation, and scalable loops—while balancing brand, monetization, and trust/safety. Across episodes, guests address how to discover real user demand, build differentiated experiences in crowded markets, and operationalize fast learning via experimentation and strong product culture—because in consumer, small UX and distribution advantages can create outsized, durable outcomes.",
  "episode_count": 39,
  "episodes": [
    "albert-cheng",
    "alex-hardimen",
    "amjad-masad",
    "anuj-rathi",
    "ayo-omojola",
    "bob-moesta",
    "boz",
    "brian-chesky",
    "camille-hearst",
    "casey-winters",
    "crystal-w",
    "drew-houston",
    "emilie-gerber",
    "gaurav-misra",
    "gina-gotthilf",
    "gustav-söderström",
    "hari-srinivasan",
    "itamar-gilad",
    "jackson-shuttleworth",
    "kayvon-beykpour",
    "kevin-aluwi",
    "kevin-weil",
    "kristen-berman",
    "krithika-shankarraman",
    "maya-prohovnik",
    "nick-turley",
    "nickey-skarstad",
    "nikhyl-singhal",
    "nikita-bier",
    "noam-lovinsky",
    "peter-deng",
    "robby-stein",
    "sachin-monga",
    "sam-schillace",
    "sarah-tavel",
    "sriram-and-aarthi",
    "tom-conrad",
    "tomer-cohen",
    "yuriy-timen"
  ],
  "subtopics": [
    "Finding real demand: how to identify the user’s underlying “job,” context, and true competitive alternatives (beyond category labels)",
    "Retention and habit mechanics: streaks, notifications, onboarding, and “time-to-value” systems that turn first use into repeated use",
    "Growth loops vs. one-off tactics: moving from scrappy, non-scalable acquisition to compounding product-led loops and organic channels",
    "Monetization in consumer subscriptions and marketplaces: pricing/packaging, paywalls, creator monetization, and aligning revenue with user value",
    "Experimentation and operating cadence: how teams structure high-volume, high-quality tests and make decisions under uncertainty",
    "Platform shifts and trust: adapting to mobile/AI/platform changes while managing integrity, fraud/risk, and user responsibility"
  ],
  "key_episodes": [
    "albert-cheng",
    "bob-moesta",
    "jackson-shuttleworth",
    "casey-winters",
    "gina-gotthilf"
  ],
  "common_frameworks": [
    "Jobs-to-be-Done (demand-side progress, struggling moments, narrative interviews)",
    "Growth loops / compounding flywheels (vs. linear funnel-only thinking)",
    "North Star Metric + input metrics (retention, activation, engagement as leading indicators)",
    "High-tempo experimentation systems (test velocity, quality bars, guardrails, iteration on copy/timing/UX)",
    "Differentiation that is both “better” and meaningfully valued (defensible advantage tied to what users care about)",
    "Evidence-guided product development under uncertainty (lightweight tests, clear decision criteria over opinion-driven roadmaps)"
  ]
}