{
  "id": "design",
  "name": "Design",
  "description": "This theme covers how great products are intentionally designed—across UX, brand, and organizational habits—to create clear value, emotional resonance, and durable differentiation. Across episodes, guests explore how to develop product taste, operationalize craft at scale, and adapt design practices for AI-era products where interfaces are conversational, behavior is non-deterministic, and iteration loops must be tighter.",
  "episode_count": 42,
  "episodes": [
    "aishwarya-naresh-reganti-kiriti-badam",
    "ami-vora",
    "aparna-chennapragada",
    "ayo-omojola",
    "bob-baxley",
    "bret-taylor",
    "brian-chesky",
    "claire-butler",
    "david-placek",
    "dmitry-zlokazov",
    "dylan-field",
    "dylan-field-20",
    "elena-verna-30",
    "failure",
    "guillermo-rauch",
    "ivan-zhao",
    "jake-knapp-john-zeratsky",
    "jake-knapp-john-zeratsky-20",
    "jessica-hische",
    "josh-miller",
    "judd-antin",
    "julie-zhuo",
    "julie-zhuo-20",
    "karri-saarinen",
    "katie-dill",
    "kristen-berman",
    "megan-cook",
    "melanie-perkins",
    "mihika-kapoor",
    "nan-yu",
    "naomi-ionita",
    "nikita-bier",
    "ronny-kohavi",
    "ryan-singer",
    "scott-belsky",
    "shweta-shriva",
    "stewart-butterfield",
    "tom-conrad",
    "tomer-cohen-20",
    "yamashata",
    "yuhki-yamashata",
    "zoelle-egner"
  ],
  "subtopics": [
    "Product taste and craft: how teams develop judgment, avoid “Frankenstein” experiences, and make quality a competitive moat",
    "Designing for AI: NLX/conversational UX principles, agency vs. control trade-offs, and iteration under non-determinism",
    "Design-led cultures and operating models: what “design-led” really means, how leaders stay in the details, and how org structure affects quality",
    "Simplicity at scale: reducing complexity while expanding capabilities, and using constraints to maintain coherence",
    "Brand design as product design: naming, identity, typography, and how brand choices shape user perception and adoption",
    "Differentiation through experience: when “better” isn’t enough, and how to make improvements that are meaningfully defensible to users"
  ],
  "key_episodes": [
    "bob-baxley",
    "aparna-chennapragada",
    "dylan-field-20",
    "david-placek",
    "aishwarya-naresh-reganti-kiriti-badam"
  ],
  "common_frameworks": [
    "Design-led (not designer-led): design as a cross-functional discipline tied to outcomes and execution",
    "Taste-building loops: high exposure to real user behavior + rapid prototyping + critique to sharpen judgment",
    "AI product iteration loop: prototype → deploy → observe failures/edge cases → refine (with tighter PM/Design/Eng/DS collaboration)",
    "Agency vs. control trade-off: deciding how much autonomy to give AI vs. how much predictability/safety to enforce",
    "“Different vs. better vs. meaningfully better”: differentiation only matters if users feel the improvement in a way competitors can’t easily copy",
    "Foundation Sprint / structured alignment: define who/what/why-different and a testable hypothesis before accelerating execution"
  ]
}