{
  "id": "engineering-management",
  "name": "Engineering Management",
  "description": "Engineering Management across these episodes focuses on how leaders design teams, processes, and culture to ship high-quality software quickly—especially under uncertainty from AI, fast growth, and shifting platforms. It addresses how to structure ownership, align product and engineering, set operating rhythms, hire and develop talent, and build feedback loops that keep execution fast without losing reliability or morale.",
  "episode_count": 48,
  "episodes": [
    "aishwarya-naresh-reganti-kiriti-badam",
    "alexander-embiricos",
    "amjad-masad",
    "anton-osika",
    "asha-sharma",
    "austin-hay",
    "boz",
    "camille-fournier",
    "claire-vo",
    "dan-shipper",
    "daniel-lereya",
    "david-singleton",
    "dhanji-r-prasanna",
    "dharmesh-shah",
    "dmitry-zlokazov",
    "eeke-de-milliano",
    "elizabeth-stone",
    "farhan-thawar",
    "gaurav-misra",
    "geoff-charles",
    "gergely",
    "gustav-söderström",
    "heidi-helfand",
    "howie-liu",
    "inbal-s",
    "jeremy-henrickson",
    "julie-zhuo",
    "julie-zhuo-20",
    "matt-macinnis",
    "megan-cook",
    "melissa-perri",
    "michael-truell",
    "mike-krieger",
    "nicole-forsgren",
    "nicole-forsgren-20",
    "rachel-lockett",
    "ryan-j-salva",
    "ryan-singer",
    "sachin-monga",
    "sam-schillace",
    "sander-schulhoff-20",
    "scott-belsky",
    "scott-wu",
    "tamar-yehoshua",
    "tobi-lutke",
    "tomer-cohen-20",
    "vijay",
    "will-larson"
  ],
  "subtopics": [
    "Operating cadence and execution systems: planning, meeting discipline, transparency, and metrics that increase \"clock speed\" without chaos",
    "Org design and ownership: small empowered teams, PM-as-CEO models, platform teams vs. product teams, and evolving org charts into \"work charts\" for agentic work",
    "Cross-functional collaboration: reducing PM–engineering friction, involving engineers in ideation, and tightening loops between product, design, data, and engineering",
    "Managing uncertainty and non-determinism (AI): iteration strategies, evaluation/reliability practices, and balancing autonomy vs. control in agentic systems",
    "Talent density and performance culture: hiring bars, leveling expectations, feedback/candor norms, and sustaining intensity in remote or high-growth environments",
    "Speed vs. quality trade-offs: when to take on debt, how to avoid demo-driven development, and how reliability becomes a product feature at scale"
  ],
  "key_episodes": [
    "farhan-thawar",
    "elizabeth-stone",
    "camille-fournier",
    "asha-sharma",
    "daniel-lereya"
  ],
  "common_frameworks": [
    "Freedom & Responsibility / talent density as a management system (Netflix-style high-context, high-candor operating model)",
    "Small, empowered teams with end-to-end ownership (\"local CEO\" PMs; autonomous squads with clear outcomes)",
    "Radical transparency and impact-based execution (visible goals, progress, and decision rationale to drive velocity)",
    "Tight iteration loops and step-by-step delivery under uncertainty (especially for AI products with non-deterministic behavior)",
    "Platformization as a scaling strategy (building reusable primitives/internal platforms to multiply product throughput)",
    "Reliability and evaluation as first-class product work (quality gates, review loops, and measurement to make systems trustworthy at scale)"
  ]
}