{
  "id": "founder-journey",
  "name": "Founder Journey",
  "description": "The Founder Journey theme covers the messy, non-linear reality of building a company—from choosing what to build and finding early traction to surviving near-death moments, scaling culture, and making high-stakes strategic pivots under uncertainty. Across episodes, it addresses how founders develop conviction, resilience, and narrative clarity while navigating competition, fundraising pressure, product failures, and organizational change. It matters because most outcomes are determined less by a single “big idea” and more by compounding decisions, focus, and the ability to adapt without losing the team’s trust.",
  "episode_count": 59,
  "episodes": [
    "andrew-wilkinson",
    "andy-raskin",
    "andy-raskin_",
    "ben-horowitz",
    "ben-williams",
    "boz",
    "brandon-chu",
    "bret-taylor",
    "cam-adams",
    "chris-hutchins",
    "christopher-lochhead",
    "dalton-caldwell",
    "dharmesh-shah",
    "drew-houston",
    "dylan-field",
    "dylan-field-20",
    "edwin-chen",
    "eoghan-mccabe",
    "eric-ries",
    "eric-simons",
    "gergely",
    "gina-gotthilf",
    "grant-lee",
    "gustaf-alstromer",
    "howie-liu",
    "ivan-zhao",
    "jason-droege",
    "jason-fried",
    "jason-m-lemkin",
    "jen-abel",
    "jerry-colonna",
    "jessica-hische",
    "jessica-livingston",
    "jonathan-becker",
    "jonathan-lowenhar",
    "julia-schottenstein",
    "keith-yandell",
    "kevin-aluwi",
    "kunal-shah",
    "laura-modi",
    "lauren-ipsen",
    "marc-benioff",
    "matt-mullenweg",
    "melanie-perkins",
    "merci-grace",
    "mike-maples-jr",
    "nikita-bier",
    "pete-kazanjy",
    "rahul-vohra",
    "ravi-mehta",
    "ryan-hoover",
    "scott-belsky",
    "scott-wu",
    "stewart-butterfield",
    "teaser_2021",
    "tobi-lutke",
    "tom-conrad",
    "uri-levine",
    "varun-mohan"
  ],
  "subtopics": [
    "Idea selection and early advantage: how to pick markets with real demand, avoid crowded “sexy” spaces, and start with simpler businesses to build skill",
    "Resilience through near-death moments: how founders persist, manage fear/identity narratives, and decide when to pivot vs. quit",
    "CEO decision-making under uncertainty: making painful calls quickly, prioritizing focus, and handling morale impacts of hard tradeoffs",
    "Finding and evolving go-to-market: early traction, monetization mistakes, PLG → sales transitions, and building repeatable growth loops",
    "Strategic narrative and positioning: framing an “old game → new game” shift to align product, marketing, sales, fundraising, and recruiting",
    "Scaling culture and operating systems: maintaining craft/quality, rebuilding culture in wartime, and designing org structures that scale"
  ],
  "key_episodes": [
    "dalton-caldwell",
    "ben-horowitz",
    "drew-houston",
    "andrew-wilkinson",
    "andy-raskin"
  ],
  "common_frameworks": [
    "Old game → new game strategic narrative (movement story as CEO north star)",
    "Resilience/near-death management heuristics (default alive, avoid running out of money, persist vs. shut down decisioning)",
    "Focus and painful-decision doctrine (CEO job = make hard calls fast; compounding small decisions)",
    "Lean Startup principles (MVPs, experimentation, actionable metrics, pivots—plus critiques/misuses)",
    "Category design / positioning (create and own a category vs. competing on “better product” in an existing one)",
    "Product-led growth and growth loops (freemium boundaries, activation → retention → expansion loops; PLG-to-sales evolution)"
  ]
}