{
  "id": "go-to-market",
  "name": "Go To Market",
  "description": "Go-to-market (GTM) across these episodes is about turning product value into repeatable distribution: choosing the right motion (PLG/PLS/sales-led/community/category), crafting a narrative and positioning that makes buying easy, and building durable channels and growth loops. The theme repeatedly addresses why “more tactics” often fails (especially when PMF or market conditions shift), and why the best GTM systems align product, marketing, and sales around a clear story, clear ICP, and measurable paths to revenue.",
  "episode_count": 64,
  "episodes": [
    "adam-grenier",
    "andy-raskin",
    "andy-raskin_",
    "april-dunford",
    "april-dunford-20",
    "arielle-jackson",
    "barbra-gago",
    "ben-williams",
    "brian-balfour",
    "brian-chesky",
    "camille-hearst",
    "camille-ricketts",
    "carilu-dietrich",
    "christopher-lochhead",
    "claire-butler",
    "dalton-caldwell",
    "drew-houston",
    "edwin-chen",
    "elena-verna",
    "elena-verna-20",
    "elena-verna-30",
    "elena-verna-40",
    "emilie-gerber",
    "emily-kramer",
    "eoy-review",
    "ethan-smith",
    "garrett-lord",
    "geoffrey-moore",
    "gia-laudi",
    "grant-lee",
    "hila-qu",
    "jason-feifer",
    "jason-m-lemkin",
    "jeanne-grosser",
    "jen-abel",
    "jen-abel-20",
    "jonathan-lowenhar",
    "kevin-aluwi",
    "krithika-shankarraman",
    "laura-schaffer",
    "lulu-cheng-meservey",
    "madhavan-ramanujam-20",
    "marc-benioff",
    "matt-dixon",
    "melissa-tan",
    "meltem-kuran",
    "nabeel-s-qureshi",
    "nilan-peiris",
    "patrick-campbell",
    "pete-kazanjy",
    "raaz-herzberg",
    "ray-cao",
    "sahil-mansuri",
    "scott-wu",
    "shweta-shriva",
    "sri-batchu",
    "tanguy-crusson",
    "timothy-davis",
    "todd-jackson",
    "varun-mohan",
    "varun-parmar",
    "vikrama-dhiman",
    "yuriy-timen",
    "zoelle-egner"
  ],
  "subtopics": [
    "Diagnosing growth problems: channel saturation vs. shifting product-market fit vs. weak positioning",
    "Positioning and sales narrative: moving from feature demos to value, differentiation, and decision confidence (avoiding “no decision”)",
    "Strategic narrative and messaging as a CEO-level north star that aligns product, marketing, sales, recruiting, and fundraising",
    "Choosing and evolving the GTM motion: PLG vs. product-led sales vs. sales-led; bottom-up adoption to enterprise expansion",
    "Building durable distribution: growth loops, community/content engines, and new platform/channel windows",
    "Category strategy: when to create a category vs. compete in an existing one, and how competition/buyer language/budgets validate the choice"
  ],
  "key_episodes": [
    "claire-butler",
    "april-dunford",
    "andy-raskin",
    "elena-verna-20",
    "ben-williams"
  ],
  "common_frameworks": [
    "Old game → new game strategic narrative (movement-style story) to drive alignment and differentiation",
    "Positioning fundamentals: define ICP, identify real alternatives/foils, articulate unique value, and translate into a sales pitch that reduces “no decision”",
    "PLG vs. PLS vs. sales-led decisioning (including the principle that in PLS, product owns pipeline creation and sales converts/expands it)",
    "Bottom-up adoption → internal spread → enterprise expansion (land-and-expand enabled by product virality/collaboration)",
    "Growth loops and quarterly investment focus (identify loops, instrument them, and allocate resources to the highest-leverage constraints)",
    "Channel testing and “distribution shift” thinking: run small, fast tests; look for emerging platform windows before incumbents adapt",
    "Category design vs. category competition: validate via buyer language, budget availability, and competitive dynamics (competition as proof a category is real)",
    "Anti-pattern diagnostics: avoid premature growth hiring, rebrands/redesigns as a substitute for strategy, and experimentation without a clear growth model"
  ]
}