{
  "id": "hiring",
  "name": "Hiring",
  "description": "Across these episodes, “Hiring” is treated as a strategic operating system: defining what “great” looks like for a role, selecting for it with signal-rich processes, and then onboarding and managing in ways that compound performance. The theme addresses when to hire (vs. fix product/strategy first), how to avoid role/level mismatches, and how talent density, ownership, and clear mechanisms determine whether teams scale with speed or bureaucracy.",
  "episode_count": 58,
  "episodes": [
    "adam-fishman",
    "albert-cheng",
    "anton-osika",
    "ben-williams",
    "benjamin-mann",
    "bill-carr",
    "bob-moesta-20",
    "brendan-foody",
    "carilu-dietrich",
    "casey-winters_",
    "claire-hughes-johnson",
    "crystal-w",
    "david-singleton",
    "dmitry-zlokazov",
    "edwin-chen",
    "eeke-de-milliano",
    "elena-verna",
    "elena-verna-30",
    "elizabeth-stone",
    "emily-kramer",
    "farhan-thawar",
    "geoff-charles",
    "grant-lee",
    "gustaf-alstromer",
    "hari-srinivasan",
    "interview-q-compilation",
    "jackie-bavaro",
    "jason-m-lemkin",
    "jason-shah",
    "jess-lachs",
    "jessica-livingston",
    "jonathan-lowenhar",
    "josh-miller",
    "karri-saarinen",
    "katie-dill",
    "kayvon-beykpour",
    "keith-yandell",
    "kevin-yien",
    "lauren-ipsen",
    "logan-kilpatrick",
    "marty-cagan",
    "marty-cagan-20",
    "matt-mochary",
    "melissa",
    "melissa-perri-denise-tilles",
    "melissa-tan",
    "michael-truell",
    "nabeel-s-qureshi",
    "nan-yu",
    "patrick-campbell",
    "pete-kazanjy",
    "peter-deng",
    "phyl-terry",
    "scott-wu",
    "shishir-mehrotra",
    "uri-levine",
    "varun-mohan",
    "will-larson"
  ],
  "subtopics": [
    "When to hire vs. when hiring is a premature substitute for product/strategy clarity (especially in growth and marketing)",
    "Defining role scorecards and competency models (what “good” looks like) and evaluating candidates against them",
    "Hiring for traits (raw intellect, builder hunger, generalist leverage) vs. domain experience, and how that choice changes by company stage",
    "Building talent density and culture: candor, freedom-and-responsibility, and the cost of “brilliant jerks” or low performers",
    "Onboarding as a force multiplier: accelerating time-to-impact through clear ownership, principles, and operating cadence",
    "Org design and mechanisms that make hiring ‘stick’: single-threaded leadership, local-CEO PM ownership, and high-quality decision-making"
  ],
  "key_episodes": [
    "claire-hughes-johnson",
    "adam-fishman",
    "elizabeth-stone",
    "dmitry-zlokazov",
    "elena-verna"
  ],
  "common_frameworks": [
    "Role scorecards / competency models (define competencies, levels, and evidence before interviewing)",
    "Talent density + “freedom & responsibility” culture (optimize for high performers and candid feedback loops)",
    "Mechanism-driven management (operating cadence, clear ownership, principles/process to scale decisions)",
    "Single-threaded leadership / directly responsible individual (DRI-style ownership to reduce coordination drag)",
    "Trait-based hiring (raw intellect, learning velocity, builder mindset) vs. domain-experience-first hiring",
    "Stage-appropriate hiring (avoid premature growth/marketing hiring until fundamentals—PMF, positioning, distribution—are validated)"
  ]
}