{
  "id": "user-research",
  "name": "User Research",
  "description": "User Research across these episodes is about building an accurate, decision-driving understanding of customers: what triggers their behavior, what “progress” they’re trying to make, and how products fit into their real-world context. It addresses how to find and interpret high-signal qualitative and quantitative evidence (especially early), how to avoid solution-first/vanity research, and how to operationalize customer insight into product, design, growth, and go-to-market decisions—because most product failure modes trace back to weak or misused customer understanding.",
  "episode_count": 41,
  "episodes": [
    "bob-moesta",
    "bob-moesta-20",
    "brian-tolkin",
    "chip-huyen",
    "chris-hutchins",
    "christine-itwaru",
    "dalton-caldwell",
    "david-singleton",
    "gia-laudi",
    "grant-lee",
    "guillermo-rauch",
    "gustaf-alstromer",
    "itamar-gilad",
    "jake-knapp-john-zeratsky-20",
    "jeff-weinstein",
    "jen-abel",
    "jiaona-zhang",
    "judd-antin",
    "katie-dill",
    "kevin-yien",
    "kristen-berman",
    "krithika-shankarraman",
    "lauryn-isford",
    "maya-prohovnik",
    "melissa-perri",
    "nabeel-s-qureshi",
    "nan-yu",
    "naomi-ionita",
    "noah-weiss",
    "patrick-campbell",
    "paul-adams",
    "raaz-herzberg",
    "sanchan-saxena",
    "sean-ellis",
    "shweta-shriva",
    "tamar-yehoshua",
    "tanguy-crusson",
    "teresa-torres",
    "tomer-cohen-20",
    "upasna-gautam",
    "uri-levine"
  ],
  "subtopics": [
    "Finding true demand: uncovering struggling moments, triggers, and the real competitive set (what customers would do instead)",
    "Turning conversations into decisions: research that changes roadmaps, prioritization, and strategy vs. “customer-obsession theater”",
    "Early-stage learning loops: founder-led discovery/sales, tight experiment cycles, and co-creating with early customers",
    "Customer-journey mapping beyond funnels: pre-awareness/problem stage, activation, retention, and expansion from the customer’s perspective",
    "Operationalizing voice-of-customer: feedback loops, synthesis systems, and scaling insights via product ops and automation/AI",
    "Measuring what matters: combining qualitative narratives with customer-perspective metrics to validate PMF and guide iteration"
  ],
  "key_episodes": [
    "bob-moesta",
    "judd-antin",
    "jeff-weinstein",
    "gia-laudi",
    "gustaf-alstromer"
  ],
  "common_frameworks": [
    "Jobs-to-be-Done (JTBD): progress, context, hire/fire, struggling moments, demand-side lens",
    "Customer narrative interviewing / timeline reconstruction (story-based discovery over pain/gain checklists)",
    "Customer journey mapping end-to-end (including pre-awareness and post-acquisition growth)",
    "Evidence-guided product development (lightweight experiments, clear hypotheses, decision criteria)",
    "Customer co-creation with early adopters (design partners / small set of deep customer collaborations)",
    "Voice-of-Customer (VoC) systems and product-ops-led insight synthesis (feedback loops, centralized + field signals)"
  ]
}