{
  "episode_id": "camille-fournier",
  "quotes": [
    {
      "quote_id": "camille-fournier_t1_q1",
      "topic_id": "camille-fournier_t1",
      "topic_title": "PM behaviors that annoy engineers most",
      "text": "So making every effort to be credit sharing and inclusive of the engineering team and giving them the opportunity to speak about their contributions when it makes sense.",
      "speaker": "Camille Fournier",
      "timestamp": "00:03:26",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=206s",
      "context": "Actionable guidance for PMs to build trust by proactively sharing visibility and recognition with engineers.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t1_q2",
      "topic_id": "camille-fournier_t1",
      "topic_title": "PM behaviors that annoy engineers most",
      "text": "you don't necessarily have to understand all of those details, but when you act like they don't matter and you don't care about them and it's just like, I don't care, just like tell me when you can get this done or why is it going to take so long?",
      "speaker": "Camille Fournier",
      "timestamp": "00:04:05",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=245s",
      "context": "A concrete anti-pattern that explains how dismissing technical details undermines collaboration even if you’re not expected to master them.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t1_q3",
      "topic_id": "camille-fournier_t1",
      "topic_title": "PM behaviors that annoy engineers most",
      "text": "It just shows a real lack of empathy for the work that engineers are doing and I think it really can be very off-putting.",
      "speaker": "Camille Fournier",
      "timestamp": "00:04:05",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=245s",
      "context": "Highlights empathy as a core mechanism for effective PM–engineering relationships, not just a “soft skill.”",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t1_q4",
      "topic_id": "camille-fournier_t1",
      "topic_title": "PM behaviors that annoy engineers most",
      "text": "A lot of people assume that engineers just write code and don't underestimate the ability for your engineers to want to understand the business problem, want to understand the customer problem.",
      "speaker": "Camille Fournier",
      "timestamp": "00:00:40",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=40s",
      "context": "Counters the stereotype that engineers only care about implementation, encouraging PMs to engage them in customer and business context.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t1_q5",
      "topic_id": "camille-fournier_t1",
      "topic_title": "PM behaviors that annoy engineers most",
      "text": "I think the product managers that have done the best, they're not threatened by other people having ideas.",
      "speaker": "Camille Fournier",
      "timestamp": "00:00:40",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=40s",
      "context": "A memorable heuristic for strong PM behavior: treat idea generation as collaborative rather than competitive.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t2_q1",
      "topic_id": "camille-fournier_t2",
      "topic_title": "How PMs can involve engineers in ideation",
      "text": "I think the product managers that have done the best, they're not threatened by other people having ideas.",
      "speaker": "Camille Fournier",
      "timestamp": "00:10:17",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=617s",
      "context": "A practical mindset shift: strong PMs invite ideation from engineers instead of treating it as a threat to their role.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t2_q2",
      "topic_id": "camille-fournier_t2",
      "topic_title": "How PMs can involve engineers in ideation",
      "text": "And when product managers take the time to build those relationships, well, make sure that people do feel like they can both share their ideas, but also that they start to appreciate what the job of this product person actually is.",
      "speaker": "Camille Fournier",
      "timestamp": "00:10:17",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=617s",
      "context": "A concrete tactic: relationship-building enables engineers to contribute ideas while also understanding the full scope of product work.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t2_q3",
      "topic_id": "camille-fournier_t2",
      "topic_title": "How PMs can involve engineers in ideation",
      "text": "You've just got to be very careful about knowing when you're crossing that line and when you're crossing it too often.",
      "speaker": "Camille Fournier",
      "timestamp": "00:11:49",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=709s",
      "context": "A boundary-setting heuristic for when PMs should filter vs. directly connect engineers to stakeholders.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t2_q4",
      "topic_id": "camille-fournier_t2",
      "topic_title": "How PMs can involve engineers in ideation",
      "text": "Maybe you need to connect them to the engineers directly, but just being aware that that shouldn't be a default behavior.",
      "speaker": "Camille Fournier",
      "timestamp": "00:12:26",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=746s",
      "context": "Actionable guidance: direct connections can help, but overusing them can undermine focus and create coordination overhead.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t2_q5",
      "topic_id": "camille-fournier_t2",
      "topic_title": "How PMs can involve engineers in ideation",
      "text": "It's more than just saying thank you to all these people, but it's actually sometimes stepping back and letting other people speak, especially if it's something that's a really, really big technical lift.",
      "speaker": "Camille Fournier",
      "timestamp": "00:13:37",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=817s",
      "context": "A specific behavior change to prevent “credit hoarding” and build trust: give engineers the mic on technically heavy work.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t3_q1",
      "topic_id": "camille-fournier_t3",
      "topic_title": "Sponsor Break",
      "text": "measuring engineering organizations is hard and we can all agree that simple metrics like the number of PRs or commits doesn't tell the full story.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:04:50",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=290s",
      "context": "A reminder to avoid simplistic productivity metrics and push for more holistic measurement.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t3_q2",
      "topic_id": "camille-fournier_t3",
      "topic_title": "Sponsor Break",
      "text": "It combines quantitative data from developer tools with qualitative feedback from developers to give you a complete view of engineering productivity and the factors affecting it.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:04:50",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=290s",
      "context": "A practical measurement methodology: pair tool telemetry with developer sentiment to understand productivity drivers.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t3_q3",
      "topic_id": "camille-fournier_t3",
      "topic_title": "Sponsor Break",
      "text": "They just want to close them as soon as possible, but every product builder knows that users need help to learn the ins and outs of your product.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:05:28",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=328s",
      "context": "Captures the tension between user annoyance and the real need for effective onboarding/education.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t3_q4",
      "topic_id": "camille-fournier_t3",
      "topic_title": "Sponsor Break",
      "text": "The third is playing telephone.",
      "speaker": "Camille Fournier",
      "timestamp": "00:07:08",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=428s",
      "context": "A memorable label for a common failure mode where PMs become an error-prone relay between stakeholders and engineers.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t3_q5",
      "topic_id": "camille-fournier_t3",
      "topic_title": "Sponsor Break",
      "text": "So if you are being asked questions that you cannot answer because you just don't know or because that's something that involves a level of technical detail that only the engineers have that you just don't have, and you put yourself in this in-between position where people ask you questions, you turn around, you ask the engineers questions, you take whatever they say, especially when you don't really understand it, which happens sometimes, right? Go back to the original asker and sort of get in this middle-person scenario.",
      "speaker": "Camille Fournier",
      "timestamp": "00:07:08",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=428s",
      "context": "Actionable warning to avoid acting as a translator for technical details you don’t understand—bring engineers into the conversation instead.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t4_q1",
      "topic_id": "camille-fournier_t4",
      "topic_title": "Why major rewrites are usually a trap",
      "text": "projects where you acknowledge that you do need to do an uplift, but you make a very thoughtful staged plan as to how you're going to do that, and you really think through, okay, we don't need to touch all of this stuff, but we're going to take the recommendation system, it really needs to be uplifted and that's a well-contained, you know, API and so we can start to fix that without having to change the whole whatever web framework, right?",
      "speaker": "Camille Fournier",
      "timestamp": "00:15:41",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=941s",
      "context": "A concrete methodology for avoiding full rewrites: evolve in stages by uplifting well-contained components instead of rebuilding everything.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t4_q2",
      "topic_id": "camille-fournier_t4",
      "topic_title": "Why major rewrites are usually a trap",
      "text": "They underestimate the time to migrate stuff from the old system to the new system, is a huge, huge problem.",
      "speaker": "Camille Fournier",
      "timestamp": "00:15:41",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=941s",
      "context": "Highlights the most common hidden cost that derails rewrites: migration time is consistently underestimated.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t4_q3",
      "topic_id": "camille-fournier_t4",
      "topic_title": "Why major rewrites are usually a trap",
      "text": "By the way, you still have to support the old system while you're working on the new system.",
      "speaker": "Camille Fournier",
      "timestamp": "00:16:24",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=984s",
      "context": "A practical constraint PMs and engineers must plan for: rewrites create a long period of dual maintenance.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t4_q4",
      "topic_id": "camille-fournier_t4",
      "topic_title": "Why major rewrites are usually a trap",
      "text": "if you've got a system that doesn't really need feature enhancement or development because it's just sort of fine and the users are using it.\n\nAnd it's just annoying to the engineers, why in the world would you invest so much money in writing a new version of it?",
      "speaker": "Camille Fournier",
      "timestamp": "00:17:08",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1028s",
      "context": "A counterintuitive decision test: engineer pain alone isn’t sufficient justification for an expensive rewrite if the business isn’t harmed.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t4_q5",
      "topic_id": "camille-fournier_t4",
      "topic_title": "Why major rewrites are usually a trap",
      "text": "There's so much logic buried in legacy systems, it tends to be undocumented, it tends to be weird. You haven't thought through all the business rules, you haven't thought through the data formatting and I think again, it's much, much harder to replicate all the important things from the old system to the new system than people expect.",
      "speaker": "Camille Fournier",
      "timestamp": "00:18:28",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1108s",
      "context": "Explains why rewrites fail in practice: hidden legacy logic and undocumented rules make “rebuilding the same behavior” far harder than expected.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t5_q1",
      "topic_id": "camille-fournier_t5",
      "topic_title": "Engineering leaders staying technical while managing",
      "text": "Yeah, so one piece of advice I give everybody is don't stop being a hands-on technical until you feel like it's in your bones.",
      "speaker": "Camille Fournier",
      "timestamp": "00:21:18",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1278s",
      "context": "A clear rule-of-thumb for when leaders should transition away from hands-on work: only after deep, durable mastery.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t5_q2",
      "topic_id": "camille-fournier_t5",
      "topic_title": "Engineering leaders staying technical while managing",
      "text": "being technical is also just about knowing what's going on and paying attention and being able to ask ... what people care about with technical leaders in my experience is they want people who actually seem like they sort of understand what you're doing and can ask good questions and help guide you to better decisions without actually being the one who's like, \"Oh no, you need to use this library instead of that library.\"",
      "speaker": "Camille Fournier",
      "timestamp": "00:22:38",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1358s",
      "context": "Reframes “staying technical” as situational awareness plus high-quality questions, not prescribing implementation details.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t5_q3",
      "topic_id": "camille-fournier_t5",
      "topic_title": "Engineering leaders staying technical while managing",
      "text": "It's actually sort of annoying when somebody that's very senior and hands-off tries to tell you, don't use this library, use that library because I don't know about you, but I don't really believe people who have been hands-off for that long when they try to tell me what to do and the thing that I'm kind of the expert in right now,",
      "speaker": "Camille Fournier",
      "timestamp": "00:23:25",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1405s",
      "context": "A counterintuitive warning that “helpful” technical directives from hands-off leaders can reduce credibility and effectiveness.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t5_q4",
      "topic_id": "camille-fournier_t5",
      "topic_title": "Engineering leaders staying technical while managing",
      "text": "The last thing I would say is surround yourself with smart technical people, also as much as you can, and be willing to listen to them, talk about tech and ask them questions about things.",
      "speaker": "Camille Fournier",
      "timestamp": "00:24:00",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1440s",
      "context": "Actionable tactic for staying technically credible without coding: build proximity to strong practitioners and learn through conversation.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t5_q5",
      "topic_id": "camille-fournier_t5",
      "topic_title": "Engineering leaders staying technical while managing",
      "text": "I think it's always a good idea to be keeping up with what's happening and what's changing in whatever kind of side of tech you're in, but not obsessively chasing every fad.",
      "speaker": "Camille Fournier",
      "timestamp": "00:27:15",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1635s",
      "context": "A pragmatic stance on technical currency: stay aware of change without defaulting to constant rewrites or trend-chasing.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t6_q1",
      "topic_id": "camille-fournier_t6",
      "topic_title": "Framework fads and when tech choices don’t scale",
      "text": "And so, I guess I would say that's one where I would say if you're seriously thinking about it and you're not Facebook, you may really want to make sure you know what problem you're trying to solve because the impression that I have from sort of listening to people talk about it is that GraphQL is kind of trying to promise front-end engineers that they don't really have to collaborate with backend engineers.",
      "speaker": "Camille Fournier",
      "timestamp": "00:28:52",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1732s",
      "context": "A practical decision filter: before adopting a popular technology, explicitly name the problem it solves and whether your org context matches the success case.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t6_q2",
      "topic_id": "camille-fournier_t6",
      "topic_title": "Framework fads and when tech choices don’t scale",
      "text": "And they can just sort of build whatever and it'll all be fine, and it just doesn't ever seem to work out that well for anybody who actually does it in practice.",
      "speaker": "Camille Fournier",
      "timestamp": "00:29:49",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1789s",
      "context": "A caution against tools that implicitly reduce cross-team collaboration—promises of “no coordination needed” often fail in real-world teams.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t6_q3",
      "topic_id": "camille-fournier_t6",
      "topic_title": "Framework fads and when tech choices don’t scale",
      "text": "I don't know if this is exactly an example of this, but on that podcast levels, I forget his actual name, Peter I think, shared that whenever there's a framework that has a VC funded startup behind it, that's not a good sign because their job now is to convince engineers to use it and then pay for it and that's not necessarily going to be the best product.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:30:13",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1813s",
      "context": "A heuristic for evaluating framework hype: incentives of the creator (selling adoption) can diverge from what’s best for practitioners.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t6_q4",
      "topic_id": "camille-fournier_t6",
      "topic_title": "Framework fads and when tech choices don’t scale",
      "text": "That's true. Although I will say that some of the most time-wasting frameworks have also just come out of big companies, or the context of the big company that may have made that framework super useful within that context doesn't translate to startup or small company or even big company that doesn't have the rest of the context set, but I don't think ... He's not wrong. I also just think big companies share the blame on that one.",
      "speaker": "Camille Fournier",
      "timestamp": "00:30:34",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1834s",
      "context": "A counterintuitive reminder that “battle-tested at BigCo” doesn’t guarantee fit—tools can be tightly coupled to the originating company’s ecosystem and constraints.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t7_q1",
      "topic_id": "camille-fournier_t7",
      "topic_title": "When to move from IC to management",
      "text": "I also think it's particularly important to kind of develop that internal confidence in your abilities before you make this sort of scary leap, which is scary for everyone of have a ... if you have that mastery before you make the leap, I wish more people would do this because honestly, I do think there are a lot of people who never really gained the mastery.",
      "speaker": "Camille Fournier",
      "timestamp": "00:31:23",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1883s",
      "context": "Emphasizes building deep technical mastery and self-confidence before switching to management, especially when external skepticism is likely.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t7_q2",
      "topic_id": "camille-fournier_t7",
      "topic_title": "When to move from IC to management",
      "text": "Make sure you've really spent your good time writing code.",
      "speaker": "Camille Fournier",
      "timestamp": "00:32:09",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1929s",
      "context": "A simple, actionable check: don’t move into management until you’ve invested substantial time in hands-on coding.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t7_q3",
      "topic_id": "camille-fournier_t7",
      "topic_title": "When to move from IC to management",
      "text": "So I do think it's probably somewhere in the 10-year range of really having spent a lot of your time over those years writing code and really understanding how to be a technical expert.",
      "speaker": "Camille Fournier",
      "timestamp": "00:32:34",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=1954s",
      "context": "Provides a concrete heuristic for when an engineer may be ready to manage: roughly a decade of serious coding toward expertise.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t7_q4",
      "topic_id": "camille-fournier_t7",
      "topic_title": "When to move from IC to management",
      "text": "Often they're actually pushing you to become a project manager, which is actually also the worst sort of path to real leadership in my opinion.",
      "speaker": "Camille Fournier",
      "timestamp": "00:33:42",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2022s",
      "context": "A contrarian warning that “management” offers may really be PM-lite work that can derail development into true leadership.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t7_q5",
      "topic_id": "camille-fournier_t7",
      "topic_title": "When to move from IC to management",
      "text": "Also, if you just don't feel like you're done ... Also, if you just don't feel like you're done, if you're still having fun writing code, don't rush becoming a manager, writing code is awesome. Have fun, enjoy it.",
      "speaker": "Camille Fournier",
      "timestamp": "00:33:42",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2022s",
      "context": "Encourages engineers to treat enjoyment and unfinished learning as valid reasons to delay management, not just career ladder pressure.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t8_q1",
      "topic_id": "camille-fournier_t8",
      "topic_title": "Sponsor Break",
      "text": "Coda combines the best of documents, spreadsheets and apps to help me get more done and Coda can help your team to stay aligned and ship faster by managing your planning cycle in just one location.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:34:56",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2096s",
      "context": "Highlights a practical workflow principle: consolidate planning and execution artifacts into one system to improve alignment and speed.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t8_q2",
      "topic_id": "camille-fournier_t8",
      "topic_title": "Sponsor Break",
      "text": "Set and measure OKRs with full visibility across teams and stakeholders, map dependencies, create progress visualizations, and identify risk areas.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:34:56",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2096s",
      "context": "Provides an actionable checklist of planning-cycle capabilities teams can implement to manage execution risk and coordination.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t8_q3",
      "topic_id": "camille-fournier_t8",
      "topic_title": "Sponsor Break",
      "text": "I think a few things that tend to surprise them are the fact that you really don't own your time as a manager.",
      "speaker": "Camille Fournier",
      "timestamp": "00:36:24",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2184s",
      "context": "Counterintuitive reframing of management: the role fundamentally changes how you allocate time and autonomy.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t8_q4",
      "topic_id": "camille-fournier_t8",
      "topic_title": "Sponsor Break",
      "text": "Your team and your management and the company owns your time.",
      "speaker": "Camille Fournier",
      "timestamp": "00:36:24",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2184s",
      "context": "A memorable mental model for prioritization in management—time is an organizational resource, not a personal one.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t8_q5",
      "topic_id": "camille-fournier_t8",
      "topic_title": "Sponsor Break",
      "text": "I think individual contributors often think that if they become a manager, they will still have some of the freedom that they have as a senior individual contributor.",
      "speaker": "Camille Fournier",
      "timestamp": "00:36:24",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2184s",
      "context": "Warns about a common misconception that can derail new managers unless they proactively adjust expectations and habits.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t9_q1",
      "topic_id": "camille-fournier_t9",
      "topic_title": "What surprises new managers about the job",
      "text": "I think a few things that tend to surprise them are the fact that you really don't own your time as a manager. Your team and your management and the company owns your time. More and more the more senior you become as a manager.",
      "speaker": "Camille Fournier",
      "timestamp": "00:36:24",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2184s",
      "context": "A concrete mental model for the biggest day-to-day shift in management: your calendar becomes an organizational asset, not personal autonomy.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t9_q2",
      "topic_id": "camille-fournier_t9",
      "topic_title": "What surprises new managers about the job",
      "text": "And the reality is, management is much more ... I'm not a huge fan of servant leadership exactly, but management really is a service job. You are serving the team, you are serving the company.",
      "speaker": "Camille Fournier",
      "timestamp": "00:37:08",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2228s",
      "context": "Reframes management away from authority and toward service, which changes how you prioritize, communicate, and measure success.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t9_q3",
      "topic_id": "camille-fournier_t9",
      "topic_title": "What surprises new managers about the job",
      "text": "Your job as a manager is to help make things better and that usually doesn't mean that you're making all the decisions. It usually doesn't mean that you snap your fingers and people jump. Because if you try that, especially in tech, right? People are just going to revolt.",
      "speaker": "Camille Fournier",
      "timestamp": "00:37:08",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2228s",
      "context": "Actionable warning against command-and-control: influence beats directives in tech cultures, or you lose buy-in fast.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t9_q4",
      "topic_id": "camille-fournier_t9",
      "topic_title": "What surprises new managers about the job",
      "text": "In some ways, you're sort of nudging, you're encouraging, you're directing, you're setting guardrails for processes or behaviors or whatever, but it's not this glorious fearless leader.",
      "speaker": "Camille Fournier",
      "timestamp": "00:37:53",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2273s",
      "context": "Offers a practical model of effective management as “guardrails + nudges” rather than heroic decision-making.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t9_q5",
      "topic_id": "camille-fournier_t9",
      "topic_title": "What surprises new managers about the job",
      "text": "Yeah, because PMs are way easier to manage. PMs are awesome to manage.",
      "speaker": "Camille Fournier",
      "timestamp": "00:39:43",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2383s",
      "context": "A counterintuitive, experience-based observation that managing different functions can feel dramatically different in difficulty and satisfaction.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t10_q1",
      "topic_id": "camille-fournier_t10",
      "topic_title": "Why too many one-on-ones don’t scale",
      "text": "Yeah, so to be clear, you should have one-on-ones with your direct reports and your manager and you should hold those sacred ... I tend to do my weekly or maybe every other week. So this is not about that set of one-on-ones.",
      "speaker": "Camille Fournier",
      "timestamp": "00:40:46",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2446s",
      "context": "Draws a clear boundary between essential 1:1s (manager/directs and with your manager) and everything else, helping leaders prioritize what truly matters.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t10_q2",
      "topic_id": "camille-fournier_t10",
      "topic_title": "Why too many one-on-ones don’t scale",
      "text": "And I think that it's just not a scalable approach, right? Linearly scale with the number of relationships you have. And so, as your company grows, as the number of things your team supports grow, as the team grows, you just can't scale that way.",
      "speaker": "Camille Fournier",
      "timestamp": "00:41:35",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2495s",
      "context": "Offers a scalability mental model: 1:1s grow linearly with relationships, so they break as org complexity increases.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t10_q3",
      "topic_id": "camille-fournier_t10",
      "topic_title": "Why too many one-on-ones don’t scale",
      "text": "I also think that people think that one-on-ones will solve all of their problems.",
      "speaker": "Camille Fournier",
      "timestamp": "00:41:35",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2495s",
      "context": "Challenges the common assumption that more 1:1s are a universal fix, prompting practitioners to choose the right forum for the problem.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t10_q4",
      "topic_id": "camille-fournier_t10",
      "topic_title": "Why too many one-on-ones don’t scale",
      "text": "Having all these meetings as one-on-ones with those stakeholders can actually be kind of a weakness because when your stakeholders just tell you in a one-on-one that they're happy or unhappy with things, your unhappy stakeholders aren't hearing that.",
      "speaker": "Camille Fournier",
      "timestamp": "00:43:07",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2587s",
      "context": "Explains how stakeholder 1:1s can hide misalignment and reduce shared understanding compared to group forums.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t10_q5",
      "topic_id": "camille-fournier_t10",
      "topic_title": "Why too many one-on-ones don’t scale",
      "text": "Do you really have something to talk to a person about? Do you really need to ... when you have a one-on-one meeting with someone, you are asking for their time. You shouldn't just be doing that kind of haphazardly for fun.",
      "speaker": "Camille Fournier",
      "timestamp": "00:43:37",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2617s",
      "context": "Provides a practical decision filter for scheduling 1:1s: respect time and require a clear purpose before asking for it.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t11_q1",
      "topic_id": "camille-fournier_t11",
      "topic_title": "Work culture: focus over overwork",
      "text": "I think we all understand that if we could just figure out and focus on really the most important things, we would just ... everything would be better.",
      "speaker": "Camille Fournier",
      "timestamp": "00:45:51",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2751s",
      "context": "Frames focus on the highest-leverage work as the core lever for better outcomes without needing more hours.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t11_q2",
      "topic_id": "camille-fournier_t11",
      "topic_title": "Work culture: focus over overwork",
      "text": "And it's hard to figure out what the most important things are, but overwork kind of lets you just sidestep doing the hard work of figuring out what's important in the first place.",
      "speaker": "Camille Fournier",
      "timestamp": "00:45:51",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2751s",
      "context": "Counterintuitively reframes overwork as avoidance of prioritization rather than commitment.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "camille-fournier_t11_q3",
      "topic_id": "camille-fournier_t11",
      "topic_title": "Work culture: focus over overwork",
      "text": "If you don't regularly reset your expectations of what you should and shouldn't let slide, do you have any idea where the line of what is actually important to work on is?",
      "speaker": "Camille Fournier",
      "timestamp": "00:45:51",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2751s",
      "context": "Introduces a “regularly reset expectations” practice to continuously clarify what truly matters.",
      "insight_type": "framework"
    },
    {
      "quote_id": "camille-fournier_t11_q4",
      "topic_id": "camille-fournier_t11",
      "topic_title": "Work culture: focus over overwork",
      "text": "I think you actually have to kind of regularly test the circumstances and challenge with, am I really getting the most out of myself? Am I really producing the best value or am I just making ... swaging my internal guilt about I need to work 60-hour weeks, I need to sleep in the office, I need to whatever, to show that I'm a hard worker and I care.",
      "speaker": "Camille Fournier",
      "timestamp": "00:46:41",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2801s",
      "context": "Gives a practical self-audit to distinguish value creation from performative overwork driven by guilt.",
      "insight_type": "advice"
    },
    {
      "quote_id": "camille-fournier_t11_q5",
      "topic_id": "camille-fournier_t11",
      "topic_title": "Work culture: focus over overwork",
      "text": "And so, I guess I do really think that people should challenge themselves to be focused and get the important stuff done and always be asking themselves what is important to do?",
      "speaker": "Camille Fournier",
      "timestamp": "00:46:41",
      "youtube_link": "https://www.youtube.com/watch?v=hZSh0rs20uI&t=2801s",
      "context": "Actionable guidance to build a culture of continuous prioritization instead of defaulting to long hours.",
      "insight_type": "advice"
    }
  ]
}