{
  "episode_id": "emilie-gerber",
  "quotes": [
    {
      "quote_id": "emilie-gerber_t1_q1",
      "topic_id": "emilie-gerber_t1",
      "topic_title": "Introduction and Background",
      "text": "No one ever gets this tactical in PR. There's just so much theoretical conversation and examining the big blunders, but at the end of the day, if you're a startup that wants to get coverage for your company, you need to know actually the steps to take to do it.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=0s",
      "context": "Emilie sets the tone for a practical, step-by-step approach to PR rather than abstract theory.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t1_q2",
      "topic_id": "emilie-gerber_t1",
      "topic_title": "Introduction and Background",
      "text": "You can get so in the weeds with your own messaging that you want to set up this massive problem statement, you want to make it a huge trend story, but if you're very straightforward and you're pattern matching, it's generally actually going to work.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:00:21",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=21s",
      "context": "A simple mental model for crafting pitches: avoid overcomplicating the narrative and lean on clear, familiar patterns reporters recognize.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t1_q3",
      "topic_id": "emilie-gerber_t1",
      "topic_title": "Introduction and Background",
      "text": "We talk about which publications to target depending on your market and story, how to craft your pitch and your outreach to reporters, how to actually reach reporters, and also how to craft your product story for people to pay attention to what you're doing, why warm introductions to reporters aren't actually that important, how to find podcasts and newsletters to pitch that might be even more effective than traditional media, how much it would cost you to work with a PR agency instead of doing it yourself, and how much lead time you need if you do that.",
      "speaker": "Lenny",
      "timestamp": "00:01:23",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=83s",
      "context": "Lays out a tactical PR playbook and includes a counterintuitive claim about warm intros not being that important.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t2_q1",
      "topic_id": "emilie-gerber_t2",
      "topic_title": "Sponsor Break",
      "text": "It all starts with Sprig's precise targeting, which allows you to trigger in-app studies based on users' characteristics and actions taken in product.",
      "speaker": "Lenny",
      "timestamp": "00:02:25",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=145s",
      "context": "Highlights a practical methodology for collecting higher-signal feedback by targeting research to specific user segments and behaviors.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t2_q2",
      "topic_id": "emilie-gerber_t2",
      "topic_title": "Sponsor Break",
      "text": "Sprig's AI is a game changer for product teams, they're the only platform with product level AI, meaning it analyzes data across all of your studies to centralize the most important product opportunities, trends, and correlations in one real-time feed.",
      "speaker": "Lenny",
      "timestamp": "00:02:25",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=145s",
      "context": "Offers a mental model for scaling product insights by aggregating learnings across studies into a single prioritized feed of opportunities and patterns.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t2_q3",
      "topic_id": "emilie-gerber_t2",
      "topic_title": "Sponsor Break",
      "text": "Experimentation is increasingly essential for driving growth and for understanding the performance of new features, and Eppo helps you increase experimentation velocity while unlocking rigorous deep analysis in a way that no other commercial tool does.",
      "speaker": "Lenny",
      "timestamp": "00:03:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=207s",
      "context": "Frames experimentation as a core growth discipline and emphasizes the dual goal of speed plus rigor in analysis.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t2_q4",
      "topic_id": "emilie-gerber_t2",
      "topic_title": "Sponsor Break",
      "text": "Eppo does all that and more with advanced statistical methods that can help you shave weeks off experiment time and accessible UI for diving deeper into performance and out-of-the-box reporting that helps you avoid annoying prolonged analytics cycles.",
      "speaker": "Lenny",
      "timestamp": "00:03:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=207s",
      "context": "Gives concrete, actionable levers for improving experimentation throughput: better stats, self-serve analysis, and faster reporting cycles.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t3_q1",
      "topic_id": "emilie-gerber_t3",
      "topic_title": "Is press worth it for startups?",
      "text": "So in a way, you're a B2C business, but in another way, you're a B2B business.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:05:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=327s",
      "context": "A useful framing for startups with multiple audiences: press value differs depending on whether you’re optimizing for consumers vs. business stakeholders.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t3_q2",
      "topic_id": "emilie-gerber_t3",
      "topic_title": "Is press worth it for startups?",
      "text": "So internally, they're making those decisions. Not everyone might know Lenny's podcast, but they could send around a CNBC article and see that this is something very legit and something that people care about.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:05:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=327s",
      "context": "Shows how press functions as internal ammo for sponsors/partners by making it easy to circulate third-party validation.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t3_q3",
      "topic_id": "emilie-gerber_t3",
      "topic_title": "Is press worth it for startups?",
      "text": "It just signals that third-party validation that I think is really important, and that ties back to, when you look at a SaaS company or something and they're making decisions, having that validation, I think, and that credibility goes a really long way.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:05:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=327s",
      "context": "Captures the core second-order benefit of press for B2B: credibility that influences decisions even when it doesn’t directly drive signups.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t3_q4",
      "topic_id": "emilie-gerber_t3",
      "topic_title": "Is press worth it for startups?",
      "text": "Especially for a company that might be early stage, they've raised a little bit of money, I think sometimes the buyers are skeptical of engaging with new tools, because they're worried they might not raise more funding, or it might go away tomorrow, and so the more that you can validate the business through things that's not just you doing personally that other people are doing, I think the better.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:06:24",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=384s",
      "context": "Explains a concrete buyer objection (startup risk) and how press mitigates it via external validation.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t3_q5",
      "topic_id": "emilie-gerber_t3",
      "topic_title": "Is press worth it for startups?",
      "text": "So for instance, Perplexity, they have invested essentially zero in any paid marketing, they don't have a marketing person even, but they do do PR.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:07:03",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=423s",
      "context": "A specific example that challenges the assumption that growth requires paid marketing—PR can be the primary lever in some consumer cases.",
      "insight_type": "story"
    },
    {
      "quote_id": "emilie-gerber_t4_q1",
      "topic_id": "emilie-gerber_t4",
      "topic_title": "When PR drives growth in B2C",
      "text": "So for instance, Perplexity, they have invested essentially zero in any paid marketing, they don't have a marketing person even, but they do do PR. And so essentially, after their most recent announcement, they saw a massive spike in growth, a massive spike in signups, pro users, all of that.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:07:03",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=423s",
      "context": "Concrete example of PR directly driving measurable B2C growth even without paid marketing or a dedicated marketer.",
      "insight_type": "data"
    },
    {
      "quote_id": "emilie-gerber_t4_q2",
      "topic_id": "emilie-gerber_t4",
      "topic_title": "When PR drives growth in B2C",
      "text": "First of all, it's something that's very easy to grasp. Google alternative. I know how to use Google, I've used Google a million times, you can go to perplexity.com. The barrier to trying the product is very low, you can quickly type in a query, get the answer, and then see the power of the tool. It takes one time to see the power of the tool.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:07:47",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=467s",
      "context": "A practical framework for when PR converts in B2C: clear positioning + low-friction trial + fast time-to-value.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t4_q3",
      "topic_id": "emilie-gerber_t4",
      "topic_title": "When PR drives growth in B2C",
      "text": "And your point, which really stuck with me, is the real benefit isn't that first order growth impact, it's... And I've been doing this, it's when I'm emailing potential guests telling them, \"Hey, check out my work or my profile in these magazines.\" And just having those little logos is really powerful, and that's why you see those logos on people's websites.",
      "speaker": "Lenny",
      "timestamp": "00:09:30",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=570s",
      "context": "Counterintuitive B2B takeaway: press often pays off more as credibility collateral (logos) than as immediate growth.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t4_q4",
      "topic_id": "emilie-gerber_t4",
      "topic_title": "When PR drives growth in B2C",
      "text": "Maybe they're not going to read eight paragraphs that you wrote about your business, but if it's in the format of an article, I think they're more likely to take the time to do it.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:10:06",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=606s",
      "context": "Actionable guidance for B2B: use press as a storytelling vehicle that prospects are more likely to consume than founder-written copy.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t4_q5",
      "topic_id": "emilie-gerber_t4",
      "topic_title": "When PR drives growth in B2C",
      "text": "And so we work with companies where we get them great stories about their company culture and cool initiatives that they're doing, because reporters are interested in that topic. That's not going to help their sales, but it might help with something like recruiting.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:10:06",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=606s",
      "context": "Useful mental model for aligning PR outcomes to goals: some coverage is better optimized for recruiting than revenue.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t5_q1",
      "topic_id": "emilie-gerber_t5",
      "topic_title": "Affiliate marketing and product review coverage",
      "text": "we have some clients where they need to invest heavily in affiliate, because product reviews are what they need or they want to be on lists of the best vacuum cleaner, or whatever category, and it's less about getting them big features.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:11:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=687s",
      "context": "Clarifies when affiliate-driven coverage is the right PR lever: if your growth depends on product-review listicles rather than big earned-media features.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t5_q2",
      "topic_id": "emilie-gerber_t5",
      "topic_title": "Affiliate marketing and product review coverage",
      "text": "it's a little more case-to-case",
      "speaker": "Emilie Gerber",
      "timestamp": "00:11:27",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=687s",
      "context": "A reminder that affiliate vs. non-affiliate PR strategy should be tailored to the company and category, not treated as a one-size-fits-all playbook.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t5_q3",
      "topic_id": "emilie-gerber_t5",
      "topic_title": "Affiliate marketing and product review coverage",
      "text": "affiliate is essentially when you work with a publication to give them a percentage of any sales that come from the piece of the article.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:12:00",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=720s",
      "context": "Defines the mechanism practitioners need to understand: publications monetize product coverage via commission on tracked sales.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t5_q4",
      "topic_id": "emilie-gerber_t5",
      "topic_title": "Affiliate marketing and product review coverage",
      "text": "if you look at Business Insider's list of best personal finance tools, it'll say at the top that they're getting commission.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:12:00",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=720s",
      "context": "Concrete example of how affiliate disclosure shows up in real product-review coverage, useful for recognizing and evaluating affiliate placements.",
      "insight_type": "data"
    },
    {
      "quote_id": "emilie-gerber_t5_q5",
      "topic_id": "emilie-gerber_t5",
      "topic_title": "Affiliate marketing and product review coverage",
      "text": "I would say most consumer companies are doing this, but yes, there's entire agencies that are dedicated to that field.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:12:00",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=720s",
      "context": "Highlights how mainstream affiliate-driven press is in consumer marketing and that it’s specialized enough to support dedicated agencies.",
      "insight_type": "data"
    },
    {
      "quote_id": "emilie-gerber_t6_q1",
      "topic_id": "emilie-gerber_t6",
      "topic_title": "Fundraising announcements: when and how to pitch",
      "text": "I also think not all PR people are going to agree with this, but I do think funding rounds, you can always get a reporter to cover if you go about it the right way.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:13:32",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=812s",
      "context": "Contrarian claim that fundraising coverage is consistently achievable with the right approach, challenging the idea that only “big” rounds get press.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t6_q2",
      "topic_id": "emilie-gerber_t6",
      "topic_title": "Fundraising announcements: when and how to pitch",
      "text": "Someone tweeted, actually someone from another agency, I should... Propeller PR, they tweeted that they counted how many funding stories TechCrunch did in a week, and it was nine, so they had written nine funding stories in one week. And then they counted how many funding rounds actually happened that week by looking at Axis Parata and Fortune Term Sheet, and it was like 50.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:13:32",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=812s",
      "context": "Concrete data point illustrating the competition gap between total funding rounds and what TechCrunch actually covers.",
      "insight_type": "data"
    },
    {
      "quote_id": "emilie-gerber_t6_q3",
      "topic_id": "emilie-gerber_t6",
      "topic_title": "Fundraising announcements: when and how to pitch",
      "text": "When we pitch a funding story, we make it very clear, \"Hey, we're reaching out with a startup launch or funding. We're offering this to you as an exclusive, meaning we're not going to pitch anyone else if you take the story. Here's the amount that's raised, here's the space that... Here's the space they're in and here are the investors.\"",
      "speaker": "Emilie Gerber",
      "timestamp": "00:15:10",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=910s",
      "context": "A practical pitch template that emphasizes clarity, exclusivity, and the minimum info reporters need to decide quickly.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t6_q4",
      "topic_id": "emilie-gerber_t6",
      "topic_title": "Fundraising announcements: when and how to pitch",
      "text": "but if you're very straightforward and you're pattern matching, \"Hey, this TechCrunch reporter is the one that covers FinTech. I have a FinTech funding round, here's the reason my FinTech funding round matters.\"",
      "speaker": "Emilie Gerber",
      "timestamp": "00:15:10",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=910s",
      "context": "A simple mental model for increasing hit rate: match the story to the reporter’s beat and state why it matters in one line.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t6_q5",
      "topic_id": "emilie-gerber_t6",
      "topic_title": "Fundraising announcements: when and how to pitch",
      "text": "You're not shooting off one email, you are respectfully following up. When I follow up, I like to come in with some new information, whether it's something they had tweeted in the past couple of days, a new article that they wrote, very respectful. I try to wait three or four days. If it's not going anywhere, then try someone else. Do that three or four times with the most relevant reporters.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:15:50",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=950s",
      "context": "A concrete follow-up cadence and method that improves response rates without burning relationships.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t7_q1",
      "topic_id": "emilie-gerber_t7",
      "topic_title": "Which publications to target and why",
      "text": "The one thing I'll say about them is they're very deals-focused, so 100% would need to either have funding. If you're announcing a partnership that has a monetary component, that they would cover that. An acquisition they would consider covering, but they're not going to be... You should never pitch them on a product announcement.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:19:02",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1142s",
      "context": "Clear targeting rule for Axios that prevents wasted pitches and aligns story type to outlet incentives.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t7_q2",
      "topic_id": "emilie-gerber_t7",
      "topic_title": "Which publications to target and why",
      "text": "If you struggle to pitch your funding story but really want it out in the world, they are big on the pitch deck stories.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:19:58",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1198s",
      "context": "Tactical alternative path to coverage when standard funding-announcement pitching isn’t working.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t7_q3",
      "topic_id": "emilie-gerber_t7",
      "topic_title": "Which publications to target and why",
      "text": "And the way that I explain it to clients is you're just getting all your core messages out there in a very direct way. You're sharing exactly what you shared with investors, that's not necessarily a bad thing.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:20:44",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1244s",
      "context": "Reframes pitch-deck coverage as controlled messaging rather than a risky disclosure, helping founders decide strategically.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t7_q4",
      "topic_id": "emilie-gerber_t7",
      "topic_title": "Which publications to target and why",
      "text": "And I actually have heard really great feedback from clients on TechCrunch driving website traffic, the day of the announcement, especially... I haven't really been able to pinpoint when that does or doesn't happen.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:19:02",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1142s",
      "context": "Practical expectation-setting on TechCrunch’s potential traffic impact while acknowledging variability and uncertainty.",
      "insight_type": "data"
    },
    {
      "quote_id": "emilie-gerber_t7_q5",
      "topic_id": "emilie-gerber_t7",
      "topic_title": "Which publications to target and why",
      "text": "VentureBeat is huge for AI news. We pitch them all the time for any client that we work with that is building AI capabilities, has a new offering related to AI, perfect publication for that.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:22:16",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1336s",
      "context": "Direct outlet-to-beat mapping that helps practitioners quickly shortlist the right publication for AI-related announcements.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t8_q1",
      "topic_id": "emilie-gerber_t8",
      "topic_title": "NYT, WSJ, CNBC: realistic expectations",
      "text": "I would say it comes up on calls with founders, \"I want one out of every five.\" And really, when you look at... I make a joke sometimes like, \"If you want those, just have a crisis and they'll write about it.\" Fire your CEO or do really intense layoffs and have some regulatory issue.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:23:42",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1422s",
      "context": "A contrarian reality check that top-tier outlets often cover early-stage startups mainly when there’s controversy or crisis.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t8_q2",
      "topic_id": "emilie-gerber_t8",
      "topic_title": "NYT, WSJ, CNBC: realistic expectations",
      "text": "Now, let's say you're a tiny bit further along and you're series B, series C, maybe even series C, and you're looking for coverage in those publications, there's a couple criteria that they're always going to want if it's to write a feature on your company. One is your valuation, so that needs to be something that you're sharing on the record. Two is your hard business metrics, usually revenue, sometimes something else.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:24:13",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1453s",
      "context": "A practical checklist of what NYT/WSJ typically require for a feature: on-the-record valuation plus hard metrics.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t8_q3",
      "topic_id": "emilie-gerber_t8",
      "topic_title": "NYT, WSJ, CNBC: realistic expectations",
      "text": "And so oftentimes they'll tell founders that and immediately they're like, \"Oh, well we're not sharing that.\" So I'm like, \"Okay, well that's kind of the end of the conversation.\"",
      "speaker": "Emilie Gerber",
      "timestamp": "00:24:13",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1453s",
      "context": "Actionable guidance on a common PR failure mode: refusing to share valuation/metrics often ends the pitch.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t8_q4",
      "topic_id": "emilie-gerber_t8",
      "topic_title": "NYT, WSJ, CNBC: realistic expectations",
      "text": "If anything, you are going to be one or two sentences in a larger story of something that they're writing about. And yeah, that's just the nature of their coverage.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:24:51",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1491s",
      "context": "Sets realistic expectations: relationship-building may yield brief quotes in trend pieces rather than full company features.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t8_q5",
      "topic_id": "emilie-gerber_t8",
      "topic_title": "NYT, WSJ, CNBC: realistic expectations",
      "text": "And then when you look at something like CNBC, they're targeting people that want to learn about public markets.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:25:16",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1516s",
      "context": "A useful lens for outlet-fit: CNBC’s audience focus makes it a mismatch for most early-stage startups.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t9_q1",
      "topic_id": "emilie-gerber_t9",
      "topic_title": "Managing risk: controlling message vs editorial control",
      "text": "Reporters are not our employees. We're not paying them to write these pieces. They have to maintain their editorial integrity.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:26:25",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1585s",
      "context": "A clear mental model for why you can’t “manage” coverage like a vendor relationship—and must plan accordingly.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t9_q2",
      "topic_id": "emilie-gerber_t9",
      "topic_title": "Managing risk: controlling message vs editorial control",
      "text": "I consider it my job to educate the founders and spokespeople that we work with that we cannot change anything the story says.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:26:25",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1585s",
      "context": "Sets the practical boundary of PR influence: you can shape inputs, not control outputs.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t9_q3",
      "topic_id": "emilie-gerber_t9",
      "topic_title": "Managing risk: controlling message vs editorial control",
      "text": "What we can do is correct any factual inaccuracies, and we do that all the time. If something is factually wrong, we can get it replaced.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:26:25",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1585s",
      "context": "Actionable guidance on the one reliable lever post-interview: factual corrections.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t9_q4",
      "topic_id": "emilie-gerber_t9",
      "topic_title": "Managing risk: controlling message vs editorial control",
      "text": "Another thing that you can do though to prevent that from happening is just really ensuring that the spokesperson before talking to the reporter is going to nail the messages that they want.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:26:50",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1610s",
      "context": "Highlights spokesperson preparation as the best risk-control mechanism before coverage is written.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t9_q5",
      "topic_id": "emilie-gerber_t9",
      "topic_title": "Managing risk: controlling message vs editorial control",
      "text": "The more that you can reiterate over and over again how you want the article to be, I think the more likely that it'll land in the reporter's head and make sure that the reporter really understands what you're building and what your goals are.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:26:50",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1610s",
      "context": "A practical methodology: repetition increases message retention and improves odds the intended framing sticks.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t10_q1",
      "topic_id": "emilie-gerber_t10",
      "topic_title": "Finding podcasts, newsletters, and awards to pitch",
      "text": "We use Google. We just use search engines basically for finding everything. And the way that we go about it is first figuring out who their customers are and what vertical they're in, and then just doing searches for podcasts that are within that vertical.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:27:35",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1655s",
      "context": "A simple, repeatable starting method: anchor discovery in the customer vertical, then search specifically within it.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t10_q2",
      "topic_id": "emilie-gerber_t10",
      "topic_title": "Finding podcasts, newsletters, and awards to pitch",
      "text": "But it's not as easy as just reaching out to the ones that pop up first. The next step is a qualitative analysis. First of all, do they have vendor CEOs or vendor executives on their show?",
      "speaker": "Emilie Gerber",
      "timestamp": "00:27:48",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1668s",
      "context": "A practical filter that prevents wasted outreach by checking whether the show actually features the kind of guests you want to pitch.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t10_q3",
      "topic_id": "emilie-gerber_t10",
      "topic_title": "Finding podcasts, newsletters, and awards to pitch",
      "text": "The third is, podcasts really come and go, make sure... It sounds obvious, but make sure it's one that's actively producing. When you Google ones, half of them are not going to be active podcasts.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:28:48",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1728s",
      "context": "A high-leverage validation step—confirm the podcast is active—before investing time in outreach.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t10_q4",
      "topic_id": "emilie-gerber_t10",
      "topic_title": "Finding podcasts, newsletters, and awards to pitch",
      "text": "I'm a big fan of just reaching out on LinkedIn and saying, \"Hey, love the show. Are you open to guest ideas?\" I don't even mention the client or anything, just opening the door.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:29:33",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1773s",
      "context": "A lightweight outreach script that lowers friction and increases the odds of getting a response.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t10_q5",
      "topic_id": "emilie-gerber_t10",
      "topic_title": "Finding podcasts, newsletters, and awards to pitch",
      "text": "If you send the initial pitch and the reporter or podcast host isn't interested, chances are they won't reply. But if you just start with something friendly and they reply, they'll feel like, I guess a little more of a connection there, and so at least you'll get an answer. Whereas otherwise, you might not get an answer at all.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:30:28",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1828s",
      "context": "A counterintuitive tactic: lead with a friendly opener instead of a full pitch to maximize replies and feedback loops.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t11_q1",
      "topic_id": "emilie-gerber_t11",
      "topic_title": "Warm intros vs cold outreach to reporters",
      "text": "I'm of the belief that it does not matter as much as many people think it does.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:31:44",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1904s",
      "context": "Contrarian take that warm relationships with reporters are often overvalued compared to the quality of the pitch.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t11_q2",
      "topic_id": "emilie-gerber_t11",
      "topic_title": "Warm intros vs cold outreach to reporters",
      "text": "So it's not sustainable to build an entire career on having relationships with certain publications.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:32:17",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1937s",
      "context": "A mental model for why “relationship-based PR” breaks down as reporters and beats change quickly.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t11_q3",
      "topic_id": "emilie-gerber_t11",
      "topic_title": "Warm intros vs cold outreach to reporters",
      "text": "And so I think cold outreach done well is just as effective.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:32:17",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1937s",
      "context": "Actionable guidance that emphasizes improving cold pitches rather than relying on intros.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t11_q4",
      "topic_id": "emilie-gerber_t11",
      "topic_title": "Warm intros vs cold outreach to reporters",
      "text": "The only thing that a relationship will get you is an open and an answer.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:32:17",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1937s",
      "context": "Clear, memorable framing of what relationships actually buy you (response), versus what they don’t (coverage).",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t11_q5",
      "topic_id": "emilie-gerber_t11",
      "topic_title": "Warm intros vs cold outreach to reporters",
      "text": "I think the much harder and more important part is being good at writing really thoughtful notes to the right people.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:32:17",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=1937s",
      "context": "Practical focus on targeting and message quality as the primary levers for successful outreach.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t12_q1",
      "topic_id": "emilie-gerber_t12",
      "topic_title": "How to reach reporters and write effective pitches",
      "text": "Yeah, I'm pro all platform approach.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:33:59",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2039s",
      "context": "Advocates a multi-channel outreach strategy (not just email) to increase the odds of reaching reporters where they’re active.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t12_q2",
      "topic_id": "emilie-gerber_t12",
      "topic_title": "How to reach reporters and write effective pitches",
      "text": "And honestly, it's sometimes more effective than when I spend 30 minutes writing a really thoughtful email.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:34:16",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2056s",
      "context": "Counterintuitive reminder that ultra-short social pitches can outperform long, polished emails.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t12_q3",
      "topic_id": "emilie-gerber_t12",
      "topic_title": "How to reach reporters and write effective pitches",
      "text": "I would say my most successful pitches are three sentences and anytime... Sometimes it needs to be longer than that, and generally I feel like my pitch is weaker for that reason.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:35:06",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2106s",
      "context": "A concrete constraint (3 sentences) that functions as a quality bar for clarity and brevity in pitches.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t12_q4",
      "topic_id": "emilie-gerber_t12",
      "topic_title": "How to reach reporters and write effective pitches",
      "text": "Another thing that actually can work really well is pointing out gaps in their coverage too, and talking about things that they should be talking about.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:35:49",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2149s",
      "context": "A practical angle for pitching: demonstrate you understand their beat by identifying an overlooked perspective.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t12_q5",
      "topic_id": "emilie-gerber_t12",
      "topic_title": "How to reach reporters and write effective pitches",
      "text": "If nine of them have one stance on something happening in the field and one has the other stance, chances are that one is going to be the one that a reporter wants to talk to because they are getting so many pitches on this topic, but they want to write a balanced article, they need that opposing view.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:36:33",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2193s",
      "context": "Explains why contrarian viewpoints can be disproportionately valuable to reporters seeking balance amid crowded narratives.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t13_q1",
      "topic_id": "emilie-gerber_t13",
      "topic_title": "Positioning: take on incumbents, avoid category creation",
      "text": "Well, one topic, maybe this would be covered elsewhere, but one topic I think is talking about incumbents that this company is taking on.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:41:24",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2484s",
      "context": "A practical positioning tactic: anchor your pitch to a known incumbent to make the story instantly legible to reporters.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t13_q2",
      "topic_id": "emilie-gerber_t13",
      "topic_title": "Positioning: take on incumbents, avoid category creation",
      "text": "So a lot of companies want to position themselves as category creators, and I actually hate that. It doesn't work. It doesn't land with press, and most of the time it's not totally true.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:41:24",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2484s",
      "context": "A contrarian warning that “category creation” framing usually fails in PR because it lacks credibility and press resonance.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t13_q3",
      "topic_id": "emilie-gerber_t13",
      "topic_title": "Positioning: take on incumbents, avoid category creation",
      "text": "And so instead, it's actually really great when you can talk about how you are doing what X household name does, but better for X reasons, and that works so well.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:41:46",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2506s",
      "context": "A simple, repeatable messaging formula: “we do what [household name] does, but better because [reasons].”",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t13_q4",
      "topic_id": "emilie-gerber_t13",
      "topic_title": "Positioning: take on incumbents, avoid category creation",
      "text": "I'll put that in subject lines. I'll put company taking on whatever Salesforce with X approach. It's so successful because instantly it gives the reporter a frame of reference.",
      "speaker": "Emilie Gerber",
      "timestamp": "00:41:46",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2506s",
      "context": "Tactical execution guidance for PR outreach: use incumbent comparisons directly in email subject lines to create instant context.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t13_q5",
      "topic_id": "emilie-gerber_t13",
      "topic_title": "Positioning: take on incumbents, avoid category creation",
      "text": "I mean, sure, you can point to examples of the two companies that have done category creation well, but it's two out of what, thousands?",
      "speaker": "Emilie Gerber",
      "timestamp": "00:42:52",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2572s",
      "context": "A memorable critique that category creation is the exception, not the rule—useful for calibrating expectations and strategy.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t14_q1",
      "topic_id": "emilie-gerber_t14",
      "topic_title": "Sponsor Break",
      "text": "When it comes to ensuring your company has top-notch security practices, things get complicated fast.",
      "speaker": "Lenny",
      "timestamp": "00:43:18",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2598s",
      "context": "Highlights a common practitioner pain point—security/compliance complexity—which sets up the need for automation and simplification.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "emilie-gerber_t14_q2",
      "topic_id": "emilie-gerber_t14",
      "topic_title": "Sponsor Break",
      "text": "Now, you can assess risk, secure the trust of your customers, and automate compliance for SOC 2, ISO 27001, HIPAA and more with a single platform, Vanta.",
      "speaker": "Lenny",
      "timestamp": "00:43:18",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2598s",
      "context": "A clear value proposition framework: risk assessment + customer trust + compliance automation, anchored to concrete standards.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t14_q3",
      "topic_id": "emilie-gerber_t14",
      "topic_title": "Sponsor Break",
      "text": "Plus you can save hours by completing security questionnaires with Vanta AI.",
      "speaker": "Lenny",
      "timestamp": "00:43:18",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2598s",
      "context": "Actionable, outcome-focused benefit statement that quantifies value (“save hours”) and ties it to a specific workflow.",
      "insight_type": "advice"
    },
    {
      "quote_id": "emilie-gerber_t14_q4",
      "topic_id": "emilie-gerber_t14",
      "topic_title": "Sponsor Break",
      "text": "So I asked you to bring some examples of pitches that are great, and also examples of pitches that could be better,",
      "speaker": "Lenny",
      "timestamp": "00:44:12",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2652s",
      "context": "A practical methodology for improving pitching: study strong examples alongside weaker ones to identify what works and what doesn’t.",
      "insight_type": "framework"
    },
    {
      "quote_id": "emilie-gerber_t14_q5",
      "topic_id": "emilie-gerber_t14",
      "topic_title": "Sponsor Break",
      "text": "Let's pull them up and then I'd love to just show people what you find has been really effective and works great about these examples and then what somebody could have done better, whatever you want to share about that example.",
      "speaker": "Lenny",
      "timestamp": "00:44:12",
      "youtube_link": "https://www.youtube.com/watch?v=jW9GzaaRPxk&t=2652s",
      "context": "A structured critique approach practitioners can copy: isolate effective elements, then identify specific improvements.",
      "insight_type": "advice"
    }
  ]
}