{
  "episode_id": "jeanne-grosser",
  "quotes": [
    {
      "quote_id": "jeanne-grosser_t1_q1",
      "topic_id": "jeanne-grosser_t1",
      "topic_title": "Introduction and Background",
      "text": "With AI, it's just intensified because you have 10 players pursuing the same market opportunity and so your ability to actually bring the product to market to differentiate yourself from the competition has become more strategically important than it was previously.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:00:03",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=3s",
      "context": "Highlights how AI-driven market crowding makes GTM execution a primary lever for differentiation, not an afterthought.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t1_q2",
      "topic_id": "jeanne-grosser_t1",
      "topic_title": "Introduction and Background",
      "text": "80% of customers buy to avoid pain or reduce risk as opposed to increased upside, which is a good thing for startup founders to understand.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:00:27",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=27s",
      "context": "A concrete heuristic for positioning: lead with risk reduction and downside avoidance rather than aspirational future value.",
      "insight_type": "data"
    },
    {
      "quote_id": "jeanne-grosser_t1_q3",
      "topic_id": "jeanne-grosser_t1",
      "topic_title": "Introduction and Background",
      "text": "We buy a lot of things because of how we feel about them. The experience that you have of being sold to will increasingly actually differentiate a company and drive buying decisions if products are only different at the merchant. And so then you really want to create a customer buying journey that feels like very unique experiences.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:00:55",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=55s",
      "context": "Frames GTM as a designed customer experience—treating the buying journey itself as a differentiator when product gaps narrow.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t1_q4",
      "topic_id": "jeanne-grosser_t1",
      "topic_title": "Introduction and Background",
      "text": "The litmus test I have always given my sales team is if you are an account executive in my org and I put you in front of 10 engineers at our company, it should take them 10 minutes to figure out you aren't a product manager.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:01:23",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=83s",
      "context": "A memorable hiring/enablement bar for technical selling: sales should communicate with engineers at near-PM fluency.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t2_q1",
      "topic_id": "jeanne-grosser_t2",
      "topic_title": "Sponsor Break",
      "text": "Product managers at the world's best companies use Datadog, the same platform their engineers rely on every day to connect product insights to product issues like bugs, UX, friction and business impact.",
      "speaker": "Sponsor (Datadog/Eppo)",
      "timestamp": "00:03:14",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=194s",
      "context": "Highlights an actionable operating model: unify PM analytics with engineering observability to tie insights directly to root causes and business impact.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t2_q2",
      "topic_id": "jeanne-grosser_t2",
      "topic_title": "Sponsor Break",
      "text": "Where other tools stop, Datadog goes even further. It helps you actually diagnose the impact of funnel drop-offs and bugs and UX friction.",
      "speaker": "Sponsor (Datadog/Eppo)",
      "timestamp": "00:03:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=212s",
      "context": "Emphasizes moving beyond measurement to diagnosis—pinpointing what’s driving conversion loss and user pain so teams can prioritize fixes and experiments.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t2_q3",
      "topic_id": "jeanne-grosser_t2",
      "topic_title": "Sponsor Break",
      "text": "I saw this first hand when I was at Airbnb where our experimentation platform was critical for analyzing what worked and where things went wrong and the same team that built experimentation at Airbnb built Epo.",
      "speaker": "Sponsor (Datadog/Eppo)",
      "timestamp": "00:03:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=212s",
      "context": "Provides a concrete example of experimentation as a core product capability and adds credibility via the Airbnb team lineage behind Eppo.",
      "insight_type": "story"
    },
    {
      "quote_id": "jeanne-grosser_t2_q4",
      "topic_id": "jeanne-grosser_t2",
      "topic_title": "Sponsor Break",
      "text": "And all of this is powered by feature flags, that are tied to real-time data so that you can roll out safely, target precisely and learn continuously.",
      "speaker": "Sponsor (Datadog/Eppo)",
      "timestamp": "00:03:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=212s",
      "context": "Offers a practical methodology: use feature flags connected to real-time data to de-risk releases, segment rollouts, and accelerate learning loops.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t2_q5",
      "topic_id": "jeanne-grosser_t2",
      "topic_title": "Sponsor Break",
      "text": "What used to take weeks, months or years, you can now do over a weekend.",
      "speaker": "Sponsor (Lovable)",
      "timestamp": "00:04:25",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=265s",
      "context": "A memorable claim about cycle-time compression that encourages practitioners to prototype and ship faster using AI-assisted app building.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t3_q1",
      "topic_id": "jeanne-grosser_t3",
      "topic_title": "Defining go-to-market and its scope",
      "text": "For me, I think of it as any function that is going to touch a customer or make a dollar, and actually my remit at Vercel is that, so that includes marketing, sales, all of your technical sales roles like sales engineers or post-sales platform architects is what we call them at Vercel. It's customer success, it's support, it's partnerships.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:05:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=357s",
      "context": "Expands GTM beyond just sales/marketing into an end-to-end revenue-and-customer-touching scope practitioners can organize around.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t3_q2",
      "topic_id": "jeanne-grosser_t3",
      "topic_title": "Defining go-to-market and its scope",
      "text": "those functions often have this Venn diagram strategy where marketing's pursuing one thing, it overlaps with what sales is pursuing, but not perfectly, which also overlaps with what support is pursuing but not perfectly.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:05:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=357s",
      "context": "A memorable diagnosis of siloed GTM execution that explains why teams misalign even when they share goals.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t3_q3",
      "topic_id": "jeanne-grosser_t3",
      "topic_title": "Defining go-to-market and its scope",
      "text": "Examples of this would be slightly differing segmentation frameworks, et cetera.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:05:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=357s",
      "context": "Gives a concrete example of how misalignment shows up in practice (inconsistent segmentation).",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t3_q4",
      "topic_id": "jeanne-grosser_t3",
      "topic_title": "Defining go-to-market and its scope",
      "text": "we've gone through a period of hyper-specialization in go-to-market depending on how you count them. There are, I think somebody quoted 17 different roles within go-to-market these days and I hypothesize that a lot of those are going to start to collapse.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:06:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=417s",
      "context": "A forward-looking, contrarian prediction that GTM role sprawl will consolidate—useful for org design and hiring strategy.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t3_q5",
      "topic_id": "jeanne-grosser_t3",
      "topic_title": "Defining go-to-market and its scope",
      "text": "if you think of go-to-market more holistically, I think you can kind of go back to what are the jobs to be done from making a customer prospect aware of your product all the way through to high LTV, five years on the platform, fully wall-to-wall, and you're going to want to map that out and orchestrate it the way you would think about that within your own product.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:06:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=417s",
      "context": "Provides an actionable methodology: map the full customer lifecycle as jobs-to-be-done and orchestrate GTM like product work.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t4_q1",
      "topic_id": "jeanne-grosser_t4",
      "topic_title": "What changed in GTM: consultative and embedded",
      "text": "So when consumption-based business models started, I think you saw go-to-market shift into being meaningfully more consultative because often that first land was the very beginning of the journey and represented a very small percent of what you were ultimately going to do with that customer.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:08:55",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=535s",
      "context": "Reframes GTM for consumption models: the initial deal is just the start, so teams must optimize for expansion via consultation, not closing.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t4_q2",
      "topic_id": "jeanne-grosser_t4",
      "topic_title": "What changed in GTM: consultative and embedded",
      "text": "And so you had to go from being transactional to a lot more. You had to more deeply understand what that customer was trying to do so you could align that ultimately to your product.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:08:55",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=535s",
      "context": "Actionable guidance on the core skill shift: deepen customer understanding to drive product alignment and long-term growth.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t4_q3",
      "topic_id": "jeanne-grosser_t4",
      "topic_title": "What changed in GTM: consultative and embedded",
      "text": "I think you're seeing a lot more of go-to-market orgs leaning into the art of the possible best practices, helping you actually think things through as if they were a consultant.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:08:55",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=535s",
      "context": "Defines a consultative GTM posture as a repeatable methodology: bring best practices and help customers reason through ambiguity.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t4_q4",
      "topic_id": "jeanne-grosser_t4",
      "topic_title": "What changed in GTM: consultative and embedded",
      "text": "And a big part of that is, hey, how do I actually get into your environment, ride alongside you better understand what you're trying to do and then help you actually bring the technology to life and learn a lot along the way.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:09:52",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=592s",
      "context": "A concrete operating model for forward-deployed engineering: embed in the customer environment to accelerate adoption and learning.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t4_q5",
      "topic_id": "jeanne-grosser_t4",
      "topic_title": "What changed in GTM: consultative and embedded",
      "text": "Often you're not only making that customer successful, but you're then taking all of that back to your product and engineering organization to figure out, okay, what was generalizable that we ought to build into our offering versus what is something that ultimately is going to be more of a professional service in the fullness of time.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:10:18",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=618s",
      "context": "Introduces a productization filter: systematically separate what should become core product from what should remain services.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t5_q1",
      "topic_id": "jeanne-grosser_t5",
      "topic_title": "Rise of the go-to-market engineer role",
      "text": "And so we thought to ourselves, okay, what can we do? We'll be super data-driven.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:11:33",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=693s",
      "context": "Sets up a practical GTM approach: compensate for limited headcount by leaning into data and systems instead of brute-force SDR volume.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t5_q2",
      "topic_id": "jeanne-grosser_t5",
      "topic_title": "Rise of the go-to-market engineer role",
      "text": "So you can think of this as a massive database. Every row was a different company on the planet and every column was an attribute about that company that would help you sell to them in a more targeted fashion.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:11:33",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=693s",
      "context": "A clear framework for personalization at scale: build a “company universe” with structured attributes that drive targeting and messaging.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t5_q3",
      "topic_id": "jeanne-grosser_t5",
      "topic_title": "Rise of the go-to-market engineer role",
      "text": "And so the goal was basically, hey, can we create a mad Libs where I will come up with sort of a predefined email template, but 80% of it will be fill in the blank based on the different attributes of that customer.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:12:39",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=759s",
      "context": "A memorable methodology for outbound: template the structure, then dynamically generate most of the content from company attributes.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t5_q4",
      "topic_id": "jeanne-grosser_t5",
      "topic_title": "Rise of the go-to-market engineer role",
      "text": "And so what's different is we now, I have a data scientist just like I did back in 2017, but I have a go-to-market engineer whereas before I just had someone in systems that was helping me configure outreach or sales off and my go-to-market engineer is helping me build an agent where we're coming up with, okay, well what's the human workflow that you would've done? And then how do you encode that using Vercel workflows as an example in actual code that's both deterministic and less so where an agent's going out and trying to replicate what a human might've done to produce that, fill in the blank, matlit.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:13:41",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=821s",
      "context": "Defines the GTM engineer’s core value: translate human GTM workflows into coded, agentic systems (not just tool configuration).",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t5_q5",
      "topic_id": "jeanne-grosser_t5",
      "topic_title": "Rise of the go-to-market engineer role",
      "text": "Basically the full remit of GTM Eng will be to go through each of the different functions within go to market and break down all the different workflows that they do and then turn those into agents where AI is better placed than the human to do that task.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:15:54",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=954s",
      "context": "A scalable operating model for adopting AI in GTM: decompose workflows by function and systematically agent-ify the parts AI can do better.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t6_q1",
      "topic_id": "jeanne-grosser_t6",
      "topic_title": "Agents to increase seller time with customers",
      "text": "But I think it'll take a while before we're able to really do that in a very large enterprise. There we might use an agent for research but maybe not all the way to actually send a message and that's just within the prospecting function.",
      "speaker": "Jeanne Grosser",
      "timestamp": "00:16:56",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1016s",
      "context": "Sets a pragmatic adoption model: start with agents for research in large enterprises before letting them fully automate outbound messaging.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t6_q2",
      "topic_id": "jeanne-grosser_t6",
      "topic_title": "Agents to increase seller time with customers",
      "text": "So other places that we're looking at this would be for install-based sales. So again there it's a little bit more deterministic because you've got awesome internal data on what a customer is and isn't using, what's the next best action? What's the thing they should get most value from?",
      "speaker": "Jeanne Grosser",
      "timestamp": "00:16:56",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1016s",
      "context": "Highlights install-base as a high-signal starting point for agents because internal product-usage data enables “next best action” workflows.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t6_q3",
      "topic_id": "jeanne-grosser_t6",
      "topic_title": "Agents to increase seller time with customers",
      "text": "And for the 20 years I've been in sales, it's always been somewhere around 30% to 40%.",
      "speaker": "Jeanne Grosser",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1064s",
      "context": "Provides a benchmark data point practitioners can use to quantify the current gap in seller time spent with customers.",
      "insight_type": "data"
    },
    {
      "quote_id": "jeanne-grosser_t6_q4",
      "topic_id": "jeanne-grosser_t6",
      "topic_title": "Agents to increase seller time with customers",
      "text": "So the minority of time is actually talking to other humans and I think we're getting to a point where with layering in agents, ideally we finally get salespeople to a point where they're actually spending 70% of their time interacting with humans and we can get the research, the follow-up, the things that are a little bit more rote and don't use the entirety of your human capacity done by an agent and then sort of unleash you to go deeper with your customers.",
      "speaker": "Jeanne Grosser",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1064s",
      "context": "Defines a clear operating target (70% customer-facing time) and a method (offload rote work to agents) to redesign sales capacity.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t7_q1",
      "topic_id": "jeanne-grosser_t7",
      "topic_title": "Human-in-the-loop outbound quality and safety",
      "text": "Our processes all always have human in the loop.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:18:51",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1131s",
      "context": "Sets the core operating principle for using AI in outbound without sacrificing quality, safety, or brand control.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t7_q2",
      "topic_id": "jeanne-grosser_t7",
      "topic_title": "Human-in-the-loop outbound quality and safety",
      "text": "So basically where we'll start is we take a go to market engineer and we have them shadow the highest performing individual in that function.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:18:51",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1131s",
      "context": "A practical methodology for capturing real top-performer workflows before automating them with agents.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t7_q3",
      "topic_id": "jeanne-grosser_t7",
      "topic_title": "Human-in-the-loop outbound quality and safety",
      "text": "It ultimately then does some deep research, pulls in a bunch of information from our databases and crafts a response, but we have a human review all of those and actually hit send.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:19:44",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1184s",
      "context": "Describes a concrete human-in-the-loop control point (human approval before sending) that reduces AI spam risk while still gaining speed and scale.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t7_q4",
      "topic_id": "jeanne-grosser_t7",
      "topic_title": "Human-in-the-loop outbound quality and safety",
      "text": "Now for us, we had 10 SDRs doing this inbound workflow and now we just have one that is effectively QA-ing the agent.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:19:44",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1184s",
      "context": "A specific leverage example showing how teams can redeploy headcount by shifting humans from execution to QA.",
      "insight_type": "data"
    },
    {
      "quote_id": "jeanne-grosser_t7_q5",
      "topic_id": "jeanne-grosser_t7",
      "topic_title": "Human-in-the-loop outbound quality and safety",
      "text": "We were looking at our lead to opportunity conversion rate, we're looking at the number of touches it takes the time to convert, and basically what we were able to do is hold that lead to opportunity conversion rate flat.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:20:39",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1239s",
      "context": "Highlights the KPI framework used to validate agent performance and the key result that quality held steady while operations changed.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t8_q1",
      "topic_id": "jeanne-grosser_t8",
      "topic_title": "Impact: 10 SDRs to 1 via agents",
      "text": "I think on prospecting it can replace a fair amount because the average SDR wasn't doing overly sophisticated research in the first place.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:22:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1352s",
      "context": "A blunt assessment that helps teams decide where AI can realistically automate SDR work first (low-sophistication prospecting).",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t8_q2",
      "topic_id": "jeanne-grosser_t8",
      "topic_title": "Impact: 10 SDRs to 1 via agents",
      "text": "So where I, think the last part to go as I mentioned will be in deep enterprise prospecting where you can be at multiple layers in an org chart, you've got to pick between business lines, you've got to triangulate those.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:22:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1352s",
      "context": "Defines a practical boundary for automation: complex enterprise prospecting requires multi-threading and judgment across org structure and business lines.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t8_q3",
      "topic_id": "jeanne-grosser_t8",
      "topic_title": "Impact: 10 SDRs to 1 via agents",
      "text": "But I do think for the things that are more repetitive that often don't take that much time to learn and get ramped, AI will be good at that.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:22:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1352s",
      "context": "A clear heuristic for prioritizing AI use-cases: target repetitive tasks with short ramp time first.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t8_q4",
      "topic_id": "jeanne-grosser_t8",
      "topic_title": "Impact: 10 SDRs to 1 via agents",
      "text": "And in my view, no one graduated from college and was like, \"Yes, I just went to college for four years to become an SDR.\" It was more, \"Okay, that's where you are forced to start.\"",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:22:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1352s",
      "context": "Challenges the default career ladder assumption and reframes SDR work as an artificial starting point rather than a destination role.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t8_q5",
      "topic_id": "jeanne-grosser_t8",
      "topic_title": "Impact: 10 SDRs to 1 via agents",
      "text": "And so basically what we're just doing is shifting folks into something that uses more of their full capacity right out of the gates rather than sort of the forcing function of working your way up the totem pole.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:22:32",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1352s",
      "context": "A talent deployment model: use AI to remove low-leverage gatekeeping work and move people earlier into higher-capacity roles (e.g., outbound/closing).",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t9_q1",
      "topic_id": "jeanne-grosser_t9",
      "topic_title": "SDR and AE roles explained for newcomers",
      "text": "So SDR is typically in charge of generating pipeline. They're meant to talk to prospective customers and get them to a point where it is worth investing time to run them through a sales process.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:24:01",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1441s",
      "context": "Defines the core SDR job as qualifying opportunities to justify higher-cost sales time—an actionable lens for role design and hiring.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t9_q2",
      "topic_id": "jeanne-grosser_t9",
      "topic_title": "SDR and AE roles explained for newcomers",
      "text": "So this is where people come to your website, they fill out contact sales, they'll be the first call to make sure that it's actually worth a more expensive account executive to go and run a sales process or you then have outbound.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:24:01",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1441s",
      "context": "Explains inbound SDRs as a cost-filter for AE time and contrasts it with outbound, clarifying how to structure pipeline coverage.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t9_q3",
      "topic_id": "jeanne-grosser_t9",
      "topic_title": "SDR and AE roles explained for newcomers",
      "text": "So this is where when you want to grow faster than your inbound demand, they will go out and at this point you probably have a point of view on where you think you have product market fit. And so they will target that part of the market and try to drum up interest from folks who weren't otherwise raising their hand saying, I'd like to talk to you.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:24:01",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1441s",
      "context": "Gives a practical trigger for outbound (outgrowing inbound) and a targeting method (use your PMF hypothesis) to focus prospecting.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t9_q4",
      "topic_id": "jeanne-grosser_t9",
      "topic_title": "SDR and AE roles explained for newcomers",
      "text": "So that's sales development basically. Pipeline generation account executives are closers.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:24:54",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1494s",
      "context": "A memorable, simplifying mental model that cleanly separates SDR and AE responsibilities for newcomers and org design.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t9_q5",
      "topic_id": "jeanne-grosser_t9",
      "topic_title": "SDR and AE roles explained for newcomers",
      "text": "Those tend to be a little bit more of a transactional sale. You often have a single decision maker to then going into a mid-market or a commercial role where now maybe you have an economic buyer like somebody in finance and a technical buyer like somebody in engineering to getting into enterprise where you have procurement and you have committees and 10 people have to weigh in and you've got to help them figure out how to de-risk the fact that they're probably migrating from something so much more complicated coordination effort to sell.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:24:54",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1494s",
      "context": "Maps how sales complexity increases by segment (SMB → mid-market → enterprise) and highlights the need to manage multi-stakeholder risk and coordination.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t10_q1",
      "topic_id": "jeanne-grosser_t10",
      "topic_title": "When to hire GTM engineering and first sales",
      "text": "But actually sales is more than that. It's a skill just like writing code as a skill or building a financial model as a skill, it's about discovery.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:26:25",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1585s",
      "context": "Reframes sales as a learnable craft with specific competencies (discovery) rather than just “talking to people,” guiding how founders should train and hire.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t10_q2",
      "topic_id": "jeanne-grosser_t10",
      "topic_title": "When to hire GTM engineering and first sales",
      "text": "So often startups will get, particularly ones with strong product market fit to pretty significant scale without really having a replicable process. And you can't really apply go to market engineering unless you actually have a point of view on what best practice should look like.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:27:24",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1644s",
      "context": "Counterintuitive warning that even scaled, PMF companies may lack repeatability—and GTM engineering only works once “best practice” is defined.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t10_q3",
      "topic_id": "jeanne-grosser_t10",
      "topic_title": "When to hire GTM engineering and first sales",
      "text": "And so I think basically this is going to force folks to have more of a playbook out of the gates, what's working, what's not? Can I document it? Do I have content for the different parts of the sales process?",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:27:24",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1644s",
      "context": "Actionable checklist for operationalizing sales early: document what works, and build content mapped to each stage of the sales process.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t10_q4",
      "topic_id": "jeanne-grosser_t10",
      "topic_title": "When to hire GTM engineering and first sales",
      "text": "I forever have given founders the advice that you often want to bring in revenue operations, which is basically the analytical arm of sales earlier than you think because having data, having process is actually what gives you insights as a founder into what is and isn't working.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:28:26",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1706s",
      "context": "Practical hiring guidance: bring RevOps in earlier than expected to create the data/process foundation that reveals what’s working.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t10_q5",
      "topic_id": "jeanne-grosser_t10",
      "topic_title": "When to hire GTM engineering and first sales",
      "text": "But if you're getting to a million in ARR and the set of customers you have look nothing like one another, you still have very much like an evangelist sale, very much founder led sale versus if you can say, \"Hey, I now have an ICP here, or ideal customer profile, e.g something you can write down.\"",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:29:18",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1758s",
      "context": "Gives a concrete readiness test for hiring first sales: $1M ARR isn’t enough unless customers converge into a write-downable ICP.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t11_q1",
      "topic_id": "jeanne-grosser_t11",
      "topic_title": "Ideal GTM engineer profile and Vercel advantage",
      "text": "What we have found works really well is somebody who does have go-to-market experience.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:30:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1857s",
      "context": "Sets a clear hiring criterion for GTM engineers: prioritize real GTM experience, not just technical ability.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t11_q2",
      "topic_id": "jeanne-grosser_t11",
      "topic_title": "Ideal GTM engineer profile and Vercel advantage",
      "text": "So at Vercel, our first three go-to-market engineers we're actually sales engineers.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:30:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1857s",
      "context": "A concrete example that challenges the default assumption that GTM engineers should come from engineering first.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t11_q3",
      "topic_id": "jeanne-grosser_t11",
      "topic_title": "Ideal GTM engineer profile and Vercel advantage",
      "text": "And the thing that works well there is you do understand aspects of what is good GTM, what does a process look like?",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:30:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1857s",
      "context": "Highlights that GTM engineering effectiveness depends on understanding GTM process design, not only building tools.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t11_q4",
      "topic_id": "jeanne-grosser_t11",
      "topic_title": "Ideal GTM engineer profile and Vercel advantage",
      "text": "So it actually is important to understand the art and the science of sales and how you bring best practice to bear.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:30:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1857s",
      "context": "A practical mental model for building sales-facing agents: combine sales craft (“art”) with repeatable process (“science”).",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t11_q5",
      "topic_id": "jeanne-grosser_t11",
      "topic_title": "Ideal GTM engineer profile and Vercel advantage",
      "text": "At Vercel in particular, we basically get to be customer zero.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:32:38",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=1958s",
      "context": "A methodology for productizing internal GTM agents: dogfood as the first, most discerning customer before shipping externally.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t12_q1",
      "topic_id": "jeanne-grosser_t12",
      "topic_title": "GTM tools: Gong plus agent-driven deal coaching",
      "text": "So the biggest loss that quarter according to the account executive was lost on price. And when you ran the agent over every Slack interaction, every email, every GONG call, it said actually you lost because you never really got in touch with an economic buyer.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:35:39",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2139s",
      "context": "Shows how agent analysis can overturn a rep’s stated loss reason and pinpoint a concrete fix (economic buyer access) instead of defaulting to “price.”",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t12_q2",
      "topic_id": "jeanne-grosser_t12",
      "topic_title": "GTM tools: Gong plus agent-driven deal coaching",
      "text": "And so we went from lost bot to deal-bott and now the deal-bott is running in real time and we basically feed insights into Slack.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:36:38",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2198s",
      "context": "A practical methodology shift: move from post-mortem analysis to in-flight deal coaching delivered where reps already work (Slack).",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t12_q3",
      "topic_id": "jeanne-grosser_t12",
      "topic_title": "GTM tools: Gong plus agent-driven deal coaching",
      "text": "And so now we're feeding insights into that Slack channel which is, \"Hey, you're this far into the sales process and you haven't talked to an economic buyer, you should think about that.\" Or, \"Hey, you just got off that call with an economic buyer, didn't sound like it went that well. Here's some things to consider and how you might follow-up.\"",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:36:38",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2198s",
      "context": "Concrete examples of real-time, behavior-specific coaching prompts teams can implement to improve deal execution.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t12_q4",
      "topic_id": "jeanne-grosser_t12",
      "topic_title": "GTM tools: Gong plus agent-driven deal coaching",
      "text": "And then almost like an engineering team, we'll now run sprints, which is like those are just bugs. They're bugs in your go-to-market process, so you should not have them.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:38:34",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2314s",
      "context": "Introduces a memorable mental model: treat GTM breakdowns as “bugs” and fix them with an engineering-style sprint cadence.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t12_q5",
      "topic_id": "jeanne-grosser_t12",
      "topic_title": "GTM tools: Gong plus agent-driven deal coaching",
      "text": "What I love about this is this AI tool, this agent you built sees things that humans were not seeing.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:39:00",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2340s",
      "context": "Captures the core value proposition: agents can surface non-obvious insights that change decisions and coaching priorities.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t13_q1",
      "topic_id": "jeanne-grosser_t13",
      "topic_title": "Build vs buy: cheap, fast internal agents",
      "text": "So I think one of our learnings is that it's not that hard to build these agents and they aren't that expensive either.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:41:00",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2460s",
      "context": "Counters the default assumption that internal agents require heavy engineering investment, encouraging teams to prototype in-house.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t13_q2",
      "topic_id": "jeanne-grosser_t13",
      "topic_title": "Build vs buy: cheap, fast internal agents",
      "text": "So I mentioned the lead agent that was a six-week process with one human, a third of his time, that deal-bott, the lost bot version was two days basically we riffed on it, he had it 40 hours later.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:41:00",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2460s",
      "context": "Provides concrete build-time benchmarks practitioners can use to set expectations for internal agent development speed.",
      "insight_type": "data"
    },
    {
      "quote_id": "jeanne-grosser_t13_q3",
      "topic_id": "jeanne-grosser_t13",
      "topic_title": "Build vs buy: cheap, fast internal agents",
      "text": "And what's also interesting about them is they for better or for worse for Vercel, but that lead agent which runs full stack on Vercel, will cost us about a thousand dollars to run for the entire year.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:41:00",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2460s",
      "context": "A specific operating-cost data point that helps teams compare agent runtime costs vs. software or headcount.",
      "insight_type": "data"
    },
    {
      "quote_id": "jeanne-grosser_t13_q4",
      "topic_id": "jeanne-grosser_t13",
      "topic_title": "Build vs buy: cheap, fast internal agents",
      "text": "But I certainly think there's value in trying it yourself because you may find that it's meaningfully easier than you think and you get returns pretty quickly.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:41:57",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2517s",
      "context": "Actionable advice to run internal experiments early to validate feasibility and ROI before committing to vendors.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t13_q5",
      "topic_id": "jeanne-grosser_t13",
      "topic_title": "Build vs buy: cheap, fast internal agents",
      "text": "I'm hearing this a lot actually when I'm talking to customers right now where their biggest issue in deploying AI is actually just getting through procurement and it's because got an AI mandate, you kind of have a blank check.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:43:18",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2598s",
      "context": "Highlights procurement as a hidden bottleneck in AI adoption, implying build-vs-buy decisions should factor in organizational friction.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "jeanne-grosser_t14_q1",
      "topic_id": "jeanne-grosser_t14",
      "topic_title": "How Vercel builds agents and GTM as product",
      "text": "I do think this company is better than any I've seen at eating its own dog food and just everyone is constantly, we say Versel builds Versel with Versel. So you're just always looking for ways to, Hey, how can we use our product to go do what we need to do? And as a result, either understand then what a customer would want or what's missing from our product that we could go make better.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:46:13",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2773s",
      "context": "A practical dogfooding loop: use your own product to do real work so you quickly learn customer needs and uncover product gaps.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t14_q2",
      "topic_id": "jeanne-grosser_t14",
      "topic_title": "How Vercel builds agents and GTM as product",
      "text": "And so I started to develop this thesis that actually the experience that you have of being sold to will increasingly actually differentiate a company and drive buying decisions if products are only different at the margin.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:48:01",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2881s",
      "context": "A GTM-as-product mental model: when technical differentiation shrinks, the sales/buying experience becomes a key differentiator.",
      "insight_type": "framework"
    },
    {
      "quote_id": "jeanne-grosser_t14_q3",
      "topic_id": "jeanne-grosser_t14",
      "topic_title": "How Vercel builds agents and GTM as product",
      "text": "And so if you believe that, then you really want to create a customer buying journey that feels like very unique experiences.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:48:01",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2881s",
      "context": "Actionable guidance to intentionally design the buying journey as a differentiated experience, not just a funnel.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t14_q4",
      "topic_id": "jeanne-grosser_t14",
      "topic_title": "How Vercel builds agents and GTM as product",
      "text": "And so what we started to do at Stripe was that first session was a whiteboarding session, and we would actually get together and have you draw your architecture for payments and all the other things that were under the hood to enable you to take money and drive customer outcomes.",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:49:03",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2943s",
      "context": "A concrete GTM tactic: replace standard discovery with a collaborative artifact-creating session that improves learning on both sides.",
      "insight_type": "advice"
    },
    {
      "quote_id": "jeanne-grosser_t14_q5",
      "topic_id": "jeanne-grosser_t14",
      "topic_title": "How Vercel builds agents and GTM as product",
      "text": "But the customer also learned a lot themselves because in many cases they'd never drawn their architecture diagram. And so they left that meeting with an asset and a sense of like, \"Wow, this is a really collaborative person who's deeply interested in helping me develop a mental model for how to think about this.\"",
      "speaker": "Jeanne DeWitt Grosser",
      "timestamp": "00:49:03",
      "youtube_link": "https://www.youtube.com/watch?v=RmnWHz8HD74&t=2943s",
      "context": "A counter to “discovery = interrogation”: make sales interactions teach the customer and leave them with a tangible asset and stronger trust.",
      "insight_type": "contrarian"
    }
  ]
}