{
  "episode_id": "judd-antin",
  "quotes": [
    {
      "quote_id": "judd-antin_t1_q1",
      "topic_id": "judd-antin_t1",
      "topic_title": "User-centered performance and falsifying assumptions",
      "text": "User-centered performance refers to customer obsession or user-centered practice that is symbolic rather than focused on learning.",
      "speaker": "Judd Antin",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=0s",
      "context": "Defines a useful framework for spotting when “user-centered” work is more about signaling than generating learning that changes decisions.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t1_q2",
      "topic_id": "judd-antin_t1",
      "topic_title": "User-centered performance and falsifying assumptions",
      "text": "It's work we do to signal to each other how customer obsessed we are, not because we want to make a different decision.",
      "speaker": "Judd Antin",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=0s",
      "context": "Challenges the assumption that all customer-obsessed activity is genuine, highlighting performative incentives inside teams.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t1_q3",
      "topic_id": "judd-antin_t1",
      "topic_title": "User-centered performance and falsifying assumptions",
      "text": "Every time a PM comes to a researcher at the end of a product process and says, \"Can you just run a quick user study just to validate our assumptions,\" that's user-centered performance.",
      "speaker": "Judd Antin",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=0s",
      "context": "Gives a concrete, recognizable example practitioners can use to diagnose late-stage “checkbox” research requests.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t1_q4",
      "topic_id": "judd-antin_t1",
      "topic_title": "User-centered performance and falsifying assumptions",
      "text": "One of my big mantras was, \"We don't validate, we falsify. We are looking to be wrong.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=0s",
      "context": "Offers a memorable methodological shift for research: prioritize falsifying assumptions to drive better decisions.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t2_q1",
      "topic_id": "judd-antin_t2",
      "topic_title": "Introduction and Background",
      "text": "In our conversation, we unpack a conclusion that Jud has come to recently about how the user research field is going through a reckoning and what needs to change both within the user research field and how companies leverage user research going forward.",
      "speaker": "Lenny",
      "timestamp": "00:00:54",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=54s",
      "context": "Frames the episode’s central “reckoning” thesis and focuses attention on both researcher practice and organizational leverage.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t2_q2",
      "topic_id": "judd-antin_t2",
      "topic_title": "Introduction and Background",
      "text": "Judd shares what the user research field has gotten wrong over the last decade, how PMs and designers rely on user research too often, and to answer the wrong questions, where user research will continue to provide significant value, and how to best leverage your researchers, why it's important for researchers to think about the business goals more versus just what the users need, what to look for when you're hiring a user researcher, how PMs can be better partners to researchers, and also a phenomenon that I love that Judd describes and often witnesses, that he calls user-centered performance, where everyone acts like they care about the user, but they're just doing it for show and already know what they want to do.",
      "speaker": "Lenny",
      "timestamp": "00:01:37",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=97s",
      "context": "A dense list of actionable themes, including a contrarian critique of over-reliance on research and the “user-centered performance” concept.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t2_q3",
      "topic_id": "judd-antin_t2",
      "topic_title": "Introduction and Background",
      "text": "This episode has a lot of spicy takes and will probably upset some people, but Judd is sharing some real talk, here, that I think we all need to hear.",
      "speaker": "Lenny",
      "timestamp": "00:01:37",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=97s",
      "context": "Signals that the discussion will challenge prevailing norms and offers a cue to pay attention to uncomfortable but useful insights.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t3_q1",
      "topic_id": "judd-antin_t3",
      "topic_title": "Sponsor Break",
      "text": "This time of year is prime for career reflection and setting goals for professional growth.",
      "speaker": "Speaker",
      "timestamp": "00:02:27",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=147s",
      "context": "A simple, repeatable seasonal trigger for practitioners to run an intentional career review and goal-setting cycle.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t3_q2",
      "topic_id": "judd-antin_t3",
      "topic_title": "Sponsor Break",
      "text": "I always like to spend this time reflecting on what I accomplished the previous year, what I hope to accomplish the next year, and whether this is the year I look for a new opportunity.",
      "speaker": "Speaker",
      "timestamp": "00:02:27",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=147s",
      "context": "A practical three-part reflection checklist that can guide annual career planning and decision-making.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t3_q3",
      "topic_id": "judd-antin_t3",
      "topic_title": "Sponsor Break",
      "text": "Over 5,000 fast-growing companies use Vanta to automate up to 90% of the work involved with SOC 2 and these other frameworks.",
      "speaker": "Speaker",
      "timestamp": "00:03:55",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=235s",
      "context": "A concrete adoption and automation data point that quantifies potential operational leverage in compliance work.",
      "insight_type": "data"
    },
    {
      "quote_id": "judd-antin_t3_q4",
      "topic_id": "judd-antin_t3",
      "topic_title": "Sponsor Break",
      "text": "Thousands of fast-growing companies like Gusto, KOM, Quora, and Modern Treasury trust Vanta to help build scale, manage, and demonstrate their security and compliance programs, and get ready for audits in weeks, not months.",
      "speaker": "Speaker",
      "timestamp": "00:03:18",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=198s",
      "context": "Specific examples plus a time-to-audit claim that frames compliance as a growth accelerator rather than a slow-down.",
      "insight_type": "data"
    },
    {
      "quote_id": "judd-antin_t4_q1",
      "topic_id": "judd-antin_t4",
      "topic_title": "Airbnb research team alumni and impact",
      "text": "So I'm just going to read a list of people that worked for you and what they do now. We had Matt Gallivan, who now leads research at Slack. We have Janna Bray, who leads research at Notion, Celeste Ridlen, who leads research at Robinhood. Rebecca Grey, who leads research at Fair, Hannah Pileggi, who I think was leading research at Duolingo, Louise Beryl, who leads research at Figma, and then Noam, who was leading research at Wealthfront.",
      "speaker": "Lenny",
      "timestamp": "00:04:24",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=264s",
      "context": "A concrete set of examples showing how a strong research team can become a talent incubator whose alumni go on to lead research at major companies.",
      "insight_type": "data"
    },
    {
      "quote_id": "judd-antin_t4_q2",
      "topic_id": "judd-antin_t4",
      "topic_title": "Airbnb research team alumni and impact",
      "text": "What a fricking crazy alumni community and group from this one team that you hired and incubated.",
      "speaker": "Lenny",
      "timestamp": "00:04:24",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=264s",
      "context": "Highlights the idea that building a high-performing team can have outsized long-term impact through alumni outcomes, not just immediate project results.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t4_q3",
      "topic_id": "judd-antin_t4",
      "topic_title": "Airbnb research team alumni and impact",
      "text": "I can't take credit for it. They're just outstanding people.",
      "speaker": "Judd Antin",
      "timestamp": "00:05:11",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=311s",
      "context": "A reminder that hiring and empowering exceptional people can matter more than managerial attribution or personal credit.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t4_q4",
      "topic_id": "judd-antin_t4",
      "topic_title": "Airbnb research team alumni and impact",
      "text": "The user research discipline over the last 15 years is dying. The reckoning is here. The discipline can still survive and thrive, but we'd better adapt, and quick.",
      "speaker": "Lenny",
      "timestamp": "00:05:23",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=323s",
      "context": "A provocative, contrarian framing that sets up the need for rapid adaptation in how user research is practiced and positioned.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t5_q1",
      "topic_id": "judd-antin_t5",
      "topic_title": "Reaction to the \"UX Research reckoning\" post",
      "text": "I learned that using the word reckoning may have been a mistake because it inspires a lot of drama in a conversation that I wanted to be really productive and positive.",
      "speaker": "Judd Antin",
      "timestamp": "00:06:06",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=366s",
      "context": "Actionable communication lesson: framing and word choice can unintentionally derail the kind of discussion you’re trying to create.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t5_q2",
      "topic_id": "judd-antin_t5",
      "topic_title": "Reaction to the \"UX Research reckoning\" post",
      "text": "I would say some of it was like people thought I was throwing research or researchers under the bus, like, \"It's researchers' fault. We're doing it wrong.\" Which I don't believe at all.",
      "speaker": "Judd Antin",
      "timestamp": "00:06:43",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=403s",
      "context": "Highlights a common failure mode in change narratives—people may interpret critique of a discipline as blame on individuals—so leaders must clarify intent.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t5_q3",
      "topic_id": "judd-antin_t5",
      "topic_title": "Reaction to the \"UX Research reckoning\" post",
      "text": "the most interesting one I would say was the anti-capitalist crew, because one of my points that we'll talk about is that I think researchers need to be more profit focused.",
      "speaker": "Judd Antin",
      "timestamp": "00:06:43",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=403s",
      "context": "Contrarian stance that challenges the conventional boundary of UX research by explicitly tying it to business outcomes and profit.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t5_q4",
      "topic_id": "judd-antin_t5",
      "topic_title": "Reaction to the \"UX Research reckoning\" post",
      "text": "Well, what are we doing then, if we're not helping businesses succeed?",
      "speaker": "Judd Antin",
      "timestamp": "00:06:43",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=403s",
      "context": "A memorable reframing of research purpose as business impact, useful for prioritization and stakeholder alignment.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t5_q5",
      "topic_id": "judd-antin_t5",
      "topic_title": "Reaction to the \"UX Research reckoning\" post",
      "text": "Maybe it's the wrong industry for them.",
      "speaker": "Judd Antin",
      "timestamp": "00:07:30",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=450s",
      "context": "Provocative take that suggests value misalignment (e.g., anti-growth views) can be a root cause of friction in product orgs.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t6_q1",
      "topic_id": "judd-antin_t6",
      "topic_title": "Why layoffs signal a research value problem",
      "text": "the thesis of my article is really, it's a sign that maybe the system is a little more broken than we think and that research is not driving the value or impact that it should or could.",
      "speaker": "Judd Antin",
      "timestamp": "00:07:53",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=473s",
      "context": "Reframes UXR layoffs as evidence of a systemic impact/positioning problem rather than just a cyclical headcount issue.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t6_q2",
      "topic_id": "judd-antin_t6",
      "topic_title": "Why layoffs signal a research value problem",
      "text": "I have this framework, and it's in the article, macro, middle range, and micro research, at least three ways to talk about it.",
      "speaker": "Judd Antin",
      "timestamp": "00:08:46",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=526s",
      "context": "Introduces a practical taxonomy for diagnosing what kind of research a team is doing and where it may be misallocated.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t6_q3",
      "topic_id": "judd-antin_t6",
      "topic_title": "Why layoffs signal a research value problem",
      "text": "And it's just this devastating mix of really interesting to many, including researchers, and not impactful enough for the business.",
      "speaker": "Judd Antin",
      "timestamp": "00:09:20",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=560s",
      "context": "Captures the core failure mode of “middle-range” research: high curiosity value, low decision/impact value.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t6_q4",
      "topic_id": "judd-antin_t6",
      "topic_title": "Why layoffs signal a research value problem",
      "text": "They fulfill this need for us to feel and be customer obsessed, user-centered, without changing anything.",
      "speaker": "Judd Antin",
      "timestamp": "00:10:31",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=631s",
      "context": "Warns that some research can become performative—creating the appearance of customer-centricity without driving action.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t6_q5",
      "topic_id": "judd-antin_t6",
      "topic_title": "Why layoffs signal a research value problem",
      "text": "We set them up as a service function. We didn't know what research was for. We didn't know how to really drive impact with it.",
      "speaker": "Judd Antin",
      "timestamp": "00:11:24",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=684s",
      "context": "Actionable diagnosis for leaders: positioning research as a service (vs. impact-driving partner) undermines its resilience and value.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t7_q1",
      "topic_id": "judd-antin_t7",
      "topic_title": "Macro vs middle-range research explained",
      "text": "So if macro is like, \"Let's understand the overall competitive landscape. Let's do a concept car type project where we really look ahead. Let's get involved with strategic planning,\" which is a wonderful thing for researchers to do, do TAM studies, other things like that, that stuff lives in the macro space.",
      "speaker": "Judd Antin",
      "timestamp": "00:12:16",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=736s",
      "context": "Defines “macro research” with concrete examples (competitive landscape, concept-car visioning, strategic planning, TAM) practitioners can map to their own work.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t7_q2",
      "topic_id": "judd-antin_t7",
      "topic_title": "Macro vs middle-range research explained",
      "text": "The middle range space is like, what's a good example? \"We want to know how Airbnb hosts feel about their payment options.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:12:42",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=762s",
      "context": "Gives a specific example of a middle-range question that sounds useful but may not yet be tied to a decision or business problem.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t7_q3",
      "topic_id": "judd-antin_t7",
      "topic_title": "Macro vs middle-range research explained",
      "text": "And that's a good example where it's like, \"It's not that that's not an interesting set of questions, it's just not quite pointed enough.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:12:42",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=762s",
      "context": "Highlights the common failure mode of middle-range research: interesting insights that aren’t sharp enough to drive action.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t7_q4",
      "topic_id": "judd-antin_t7",
      "topic_title": "Macro vs middle-range research explained",
      "text": "And it's not framed in the language of the funnel, or the business strategy, or the OKRs. It's not quite enough aligned enough to that. It's too blobular in that middle level and it ends up not driving impact.",
      "speaker": "Judd Antin",
      "timestamp": "00:12:42",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=762s",
      "context": "Provides an actionable diagnostic for impact: if research isn’t framed in funnel/strategy/OKRs, it risks becoming “blobular” and non-decisive.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t8_q1",
      "topic_id": "judd-antin_t8",
      "topic_title": "Stop treating research as a service function",
      "text": "Well, the solution is simple but not easy to me. It's that we need to restructure the way we make products in a way which integrates research much more fully. It looks like consistent relationships in which researchers, and the work, and the insights they provide are a part of the process from beginning to end.",
      "speaker": "Judd Antin",
      "timestamp": "00:14:14",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=854s",
      "context": "A clear prescription: fix “middle-range” research dependency by changing the product operating model to embed research end-to-end.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t8_q2",
      "topic_id": "judd-antin_t8",
      "topic_title": "Stop treating research as a service function",
      "text": "As long as research is a service discipline, I think we're going to be stuck in this spot.",
      "speaker": "Judd Antin",
      "timestamp": "00:14:51",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=891s",
      "context": "A memorable diagnosis that reframes the core problem as organizational design (service function) rather than researcher quality.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t8_q3",
      "topic_id": "judd-antin_t8",
      "topic_title": "Stop treating research as a service function",
      "text": "There's a vicious cycle that's been happening, is from where I sit, and this is what I hear from many, many researchers and research leaders, which is a lot of companies hired a lot of researchers with great intentions, didn't quite know how to integrate them.",
      "speaker": "Judd Antin",
      "timestamp": "00:15:59",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=959s",
      "context": "Introduces a “vicious cycle” mental model explaining why research impact declines when integration is missing.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t8_q4",
      "topic_id": "judd-antin_t8",
      "topic_title": "Stop treating research as a service function",
      "text": "Because a good researcher is like the repository of insights you need for growth, but they're not there. They don't participate in the decision.",
      "speaker": "Judd Antin",
      "timestamp": "00:16:30",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=990s",
      "context": "Highlights the practical cost of late-stage, reactive research: insights exist but can’t shape decisions without presence and participation.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t8_q5",
      "topic_id": "judd-antin_t8",
      "topic_title": "Stop treating research as a service function",
      "text": "So I think the short circuit is the constant engagement. If you take a great researcher and you insert them consistently in a product process, I feel confident that researcher will drive a product improvement, metrics impact, growth, all the things that you want to see as a PM and a product leader. It's just that's the exception, not the norm these days.",
      "speaker": "Judd Antin",
      "timestamp": "00:17:07",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1027s",
      "context": "Actionable guidance: “constant engagement” is the lever to turn research into measurable product and business impact.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t9_q1",
      "topic_id": "judd-antin_t9",
      "topic_title": "What makes a great researcher: five tools",
      "text": "The best researchers I think are first of all, multi method.",
      "speaker": "Judd Antin",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1064s",
      "context": "Sets a clear hiring/evaluation signal: great researchers aren’t single-method specialists, they can flex across methods.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t9_q2",
      "topic_id": "judd-antin_t9",
      "topic_title": "What makes a great researcher: five tools",
      "text": "But a strong opinion that I have is that is largely one of those models that needs to evolve.",
      "speaker": "Judd Antin",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1064s",
      "context": "Challenges the conventional view of UX research as primarily qualitative, arguing the discipline must broaden.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t9_q3",
      "topic_id": "judd-antin_t9",
      "topic_title": "What makes a great researcher: five tools",
      "text": "It's that the best researchers have five tools. I think they have five tools.",
      "speaker": "Judd Antin",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1064s",
      "context": "Introduces a memorable “Swiss army knife” mental model for what “great” looks like in researcher capability.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t9_q4",
      "topic_id": "judd-antin_t9",
      "topic_title": "What makes a great researcher: five tools",
      "text": "You can get a lot out of really well crafted surveys. But to do that, you have to have the fourth tool, which is applied statistics, the best research, know a little bit of stats. You can't interact in a world of AB testing without knowing basic statistics.",
      "speaker": "Judd Antin",
      "timestamp": "00:18:27",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1107s",
      "context": "Gives actionable guidance: rigorous surveys require applied stats, and stats literacy is table-stakes in A/B-testing environments.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t9_q5",
      "topic_id": "judd-antin_t9",
      "topic_title": "What makes a great researcher: five tools",
      "text": "These days, so much of that is dashboarded, that the fifth tool may now be prompt engineering, which is a thing we could talk about, but I think maybe that's the fifth tool is somewhere, is it technical skills that fall in between querying your own data, understanding it very well in companies that are awash with data and then interacting with generative AI.",
      "speaker": "Judd Antin",
      "timestamp": "00:18:56",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1136s",
      "context": "Updates the classic “researchers should know SQL” expectation into a broader technical fluency that includes dashboards and AI prompting.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t10_q1",
      "topic_id": "judd-antin_t10",
      "topic_title": "How to interview for multi-method strength",
      "text": "I've interviewed hundreds or thousands of researchers, and the way I usually approach that is you want a researcher who's got a Swiss army knife, because if all you have is a hammer, then everything looks like a nail.",
      "speaker": "Judd Antin",
      "timestamp": "00:20:05",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1205s",
      "context": "A memorable mental model for hiring researchers with versatile, multi-method capability rather than a single-method bias.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t10_q2",
      "topic_id": "judd-antin_t10",
      "topic_title": "How to interview for multi-method strength",
      "text": "And so if you give in the context of an interview, let's say, a researcher, a pretty juicy, open-ended research question, and you want to see how they handle it, and a good answer is usually multi-method.",
      "speaker": "Judd Antin",
      "timestamp": "00:20:05",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1205s",
      "context": "Actionable interview tactic: use open-ended prompts and evaluate whether candidates naturally propose multiple methods.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t10_q3",
      "topic_id": "judd-antin_t10",
      "topic_title": "How to interview for multi-method strength",
      "text": "We're not going to handle it in any one way. We're going to say, \"Well, here's a couple of ways we could deal with this. Here's how we could do this in a day, or a week, or a month.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:20:05",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1205s",
      "context": "A practical framework for assessing planning maturity: candidates should scale research approaches by time horizon.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t10_q4",
      "topic_id": "judd-antin_t10",
      "topic_title": "How to interview for multi-method strength",
      "text": "Most researchers are deeper in one than the other, and sometimes you can make up for those five tools with the team.",
      "speaker": "Judd Antin",
      "timestamp": "00:20:44",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1244s",
      "context": "Team-design insight: you can hire for complementary depth areas and cover gaps through collective capability.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t10_q5",
      "topic_id": "judd-antin_t10",
      "topic_title": "How to interview for multi-method strength",
      "text": "But when I built a team at Meta and at Airbnb, that was my goal, is individually as researchers build up those tools and then as a team build deep expertise that would fill all the gaps.",
      "speaker": "Judd Antin",
      "timestamp": "00:20:44",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1244s",
      "context": "Concrete example of an org-level methodology: develop individual breadth while ensuring team-level depth coverage.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t11_q1",
      "topic_id": "judd-antin_t11",
      "topic_title": "Researchers must speak business and profit language",
      "text": "I think what I'm saying is there's an overlapping event, where you have the user and profit or the business. And what researchers need to do is be way more explicit about finding that overlap.",
      "speaker": "Judd Antin",
      "timestamp": "00:21:25",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1285s",
      "context": "Introduces a clear Venn-diagram-style framework for UXR impact: explicitly target the overlap of user needs and business outcomes.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t11_q2",
      "topic_id": "judd-antin_t11",
      "topic_title": "Researchers must speak business and profit language",
      "text": "Did you read the last quarterly report, If it's a public company? Did you listen to the shareholder call?",
      "speaker": "Judd Antin",
      "timestamp": "00:21:25",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1285s",
      "context": "Gives concrete, immediately actionable steps for researchers to learn and speak the business’s language.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t11_q3",
      "topic_id": "judd-antin_t11",
      "topic_title": "Researchers must speak business and profit language",
      "text": "Yep.\" So there you go. That's the language you need to learn.",
      "speaker": "Judd Antin",
      "timestamp": "00:22:12",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1332s",
      "context": "Reframes business jargon as a required fluency for researchers who want to influence decisions.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t11_q4",
      "topic_id": "judd-antin_t11",
      "topic_title": "Researchers must speak business and profit language",
      "text": "Understand the metrics and the conversion funnel, know it back and forward, because then what you're doing is you're proposing, if you're in the active conversation, you're saying, 'Cool, I hear you asking that research question. I've identified this is exactly the spot in the funnel where I think we need to do work. There's an opportunity here. Or that competitor is eating our lunch with this group of users. I know that because I read the competitive report and I understand it deeply.'",
      "speaker": "Judd Antin",
      "timestamp": "00:22:12",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1332s",
      "context": "Shows how funnel/metrics/competitive knowledge lets UXR proactively pinpoint where research will move business outcomes.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t11_q5",
      "topic_id": "judd-antin_t11",
      "topic_title": "Researchers must speak business and profit language",
      "text": "But Lenny, the opposite is true, too, because you got to take the average PM who lives in that land, all day, every day, and what they do is not in the Venn.",
      "speaker": "Judd Antin",
      "timestamp": "00:23:17",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1397s",
      "context": "Counterbalances the “researchers need business” narrative by arguing PMs also often miss the user-business overlap.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t12_q1",
      "topic_id": "judd-antin_t12",
      "topic_title": "User-centered performance: validation theater and ego",
      "text": "User-centered performance is a term I made up, because it's fun to make up terms. And it refers to customer obsession or a user-centered practice that is symbolic rather than focused on learning.",
      "speaker": "Judd Antin",
      "timestamp": "00:24:11",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1451s",
      "context": "Defines a memorable framework for spotting when “user-centered” work is more about signaling than actually changing decisions.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t12_q2",
      "topic_id": "judd-antin_t12",
      "topic_title": "User-centered performance: validation theater and ego",
      "text": "So explicitly, I would say every time a PM comes to a researcher at the end of a product process and says, \"Can you just run a quick user study just to validate our assumptions?\" That's user-centered performance. It's too late to matter. That PM is not interested in being wrong at all.",
      "speaker": "Judd Antin",
      "timestamp": "00:24:52",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1492s",
      "context": "Gives a concrete, actionable red-flag example of validation theater that practitioners can recognize and avoid.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t12_q3",
      "topic_id": "judd-antin_t12",
      "topic_title": "User-centered performance: validation theater and ego",
      "text": "I would argue every researcher has probably had to do executive listening sessions because a lot of PMs, founders, product people, but designers, too, they want to get close to the customer. And so, like, \"Can I do some focus groups? I want to be there. I want to ask them questions.\" This is 97% performance.",
      "speaker": "Judd Antin",
      "timestamp": "00:25:22",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1522s",
      "context": "Challenges a common practice by labeling exec “customer closeness” rituals as mostly performative rather than learning-driven.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t12_q4",
      "topic_id": "judd-antin_t12",
      "topic_title": "User-centered performance: validation theater and ego",
      "text": "One of my big mantras was, \"We don't validate, we falsify. We are looking to be wrong.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:25:49",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1549s",
      "context": "Offers a simple, repeatable research mindset that counters confirmation bias and reframes what “good” research is for.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t12_q5",
      "topic_id": "judd-antin_t12",
      "topic_title": "User-centered performance: validation theater and ego",
      "text": "But you got to understand, intuition is where all of those biases lie. It's where all your blind spots are.",
      "speaker": "Judd Antin",
      "timestamp": "00:27:07",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1627s",
      "context": "Provides a sharp caution that helps teams balance intuition with evidence by treating gut feel as a bias hotspot.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t13_q1",
      "topic_id": "judd-antin_t13",
      "topic_title": "Balancing gut intuition with System 2 rigor",
      "text": "The secret is not that sexy. It's System 2. So you engage that slow, methodical process in which you do analytic thinking as a means of checking your gut.",
      "speaker": "Judd Antin",
      "timestamp": "00:30:32",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1832s",
      "context": "A practical mental model: use deliberate, analytical thinking as an explicit check on intuition rather than choosing one or the other.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t13_q2",
      "topic_id": "judd-antin_t13",
      "topic_title": "Balancing gut intuition with System 2 rigor",
      "text": "The wisdom of the crowd works when the people involved with the decision are bringing diverse sources of information and judgment to the table.",
      "speaker": "Judd Antin",
      "timestamp": "00:30:54",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1854s",
      "context": "Defines the key condition under which “wisdom of the crowd” actually improves decisions—diversity of inputs, not just more people.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t13_q3",
      "topic_id": "judd-antin_t13",
      "topic_title": "Balancing gut intuition with System 2 rigor",
      "text": "So if you want to check your gut, get a bunch of different guts together, get a bunch of different people in the room who can bring evidence and intuition to bear, and have an open, direct end kind conversation in which we might disagree.",
      "speaker": "Judd Antin",
      "timestamp": "00:30:54",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1854s",
      "context": "Actionable decision-making method: intentionally assemble diverse perspectives and create space for constructive disagreement.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t13_q4",
      "topic_id": "judd-antin_t13",
      "topic_title": "Balancing gut intuition with System 2 rigor",
      "text": "My metric for success is when they won't have that meeting without you.",
      "speaker": "Judd Antin",
      "timestamp": "00:31:41",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1901s",
      "context": "A concrete, memorable success metric for embedded research influence: being indispensable in key decision meetings.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t13_q5",
      "topic_id": "judd-antin_t13",
      "topic_title": "Balancing gut intuition with System 2 rigor",
      "text": "I said two things, \"Number one, what's the teams? Shouldn't the PMs, the engineers, the designers and the research, everybody should have the same set of metrics for success because either we're doing it together or we're not.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:31:41",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1901s",
      "context": "A structural operating model: align cross-functional teams on shared success metrics instead of siloed OKRs.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t14_q1",
      "topic_id": "judd-antin_t14",
      "topic_title": "Shared metrics and making researchers indispensable",
      "text": "There's a lot of teams that are like, \"We don't want and PMs, we don't need product managers. They just get in the way.\" And I find that that's only the case when the product manager's not great, and not really good at their job, because most great PMs just make everyone's life easier.",
      "speaker": "Lenny",
      "timestamp": "00:32:29",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1949s",
      "context": "A contrarian reframing that resistance to PMs is often a signal of PM effectiveness, not the role’s inherent value.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t14_q2",
      "topic_id": "judd-antin_t14",
      "topic_title": "Shared metrics and making researchers indispensable",
      "text": "I'm wary of overgeneralizing, but I can tell you that from my experience and from what I hear, the product research or product insights relationship is one of the most challenged.",
      "speaker": "Judd Antin",
      "timestamp": "00:33:04",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1984s",
      "context": "Highlights a common organizational friction point practitioners can proactively address: the PM–research partnership.",
      "insight_type": "data"
    },
    {
      "quote_id": "judd-antin_t14_q3",
      "topic_id": "judd-antin_t14",
      "topic_title": "Shared metrics and making researchers indispensable",
      "text": "And I think it comes from the fact that fundamentally, many researchers are just not included in the process that PMs are running.",
      "speaker": "Judd Antin",
      "timestamp": "00:33:04",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1984s",
      "context": "Points to a concrete root cause (process exclusion) that teams can fix by changing operating rhythms and involvement.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t14_q4",
      "topic_id": "judd-antin_t14",
      "topic_title": "Shared metrics and making researchers indispensable",
      "text": "There are some tropes that researchers have about PMs that are worth PMs knowing, just like four or five of them, the things that researchers know PMs say, which drive us nuts because they're not true.",
      "speaker": "Judd Antin",
      "timestamp": "00:33:04",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=1984s",
      "context": "Suggests a practical method—surfacing recurring “tropes”/misconceptions—to improve cross-functional collaboration.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t15_q1",
      "topic_id": "judd-antin_t15",
      "topic_title": "PM–research relationship and common PM misconceptions",
      "text": "The other way to look at that is that is it slower to get it wrong and fix it than to take a hot second to do the work to get it right the first time? So that's BS. Good research doesn't slow us down, it speeds us up.",
      "speaker": "Judd Antin",
      "timestamp": "00:33:51",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2031s",
      "context": "Reframes the “research is too slow” trope into a cost-of-rework mental model PMs can use to justify fast, targeted research.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t15_q2",
      "topic_id": "judd-antin_t15",
      "topic_title": "PM–research relationship and common PM misconceptions",
      "text": "We changed the text on the button with help from our amazing content design, our UX writing team. We basically changed seven characters and made Airbnb millions of dollars, because what we found out was really simple. It was just like, \"Hey, this button feels scary. The CTA on the button feels scary.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:35:58",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2158s",
      "context": "Concrete example showing how rapid “micro research” can uncover high-leverage UX issues with outsized business impact.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t15_q3",
      "topic_id": "judd-antin_t15",
      "topic_title": "PM–research relationship and common PM misconceptions",
      "text": "The micro research should be much more common. A lot of researchers think that that's scut work, that usability is something junior researchers do. I completely disagree. I think we need to get back there as an industry and be like, \"When you make a product easier to use, when you discover problems with functionality, business metrics we care about will go up.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:37:55",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2275s",
      "context": "Actionable prioritization guidance: elevate usability/micro research as a core lever for improving key metrics, not “junior” work.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t15_q4",
      "topic_id": "judd-antin_t15",
      "topic_title": "PM–research relationship and common PM misconceptions",
      "text": "But no offense, garbage in, garbage out. The thing is, anyone can talk to a user. That does not constitute research or insights work because one user can be powerful, but one user can be idiosyncratic.",
      "speaker": "Judd Antin",
      "timestamp": "00:39:01",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2341s",
      "context": "A crisp quality bar for “democratized research”: talking to users isn’t enough without methods to reduce bias and overgeneralization.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t15_q5",
      "topic_id": "judd-antin_t15",
      "topic_title": "PM–research relationship and common PM misconceptions",
      "text": "And then they just start speculating about why that is, because the AB test rarely tells you why it changed in the way it did.",
      "speaker": "Judd Antin",
      "timestamp": "00:40:08",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2408s",
      "context": "Counterbalances “A/B test everything” by highlighting the key limitation—experiments often lack explanatory power without complementary research.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t16_q1",
      "topic_id": "judd-antin_t16",
      "topic_title": "Sponsor Break",
      "text": "Ahrefs Webmaster Tools will show you keywords that you rank for and backlinks that you can get.",
      "speaker": "Lenny",
      "timestamp": "00:36:39",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2199s",
      "context": "Highlights two concrete, actionable outputs (ranked keywords and backlink opportunities) practitioners can use to drive SEO improvements.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t16_q2",
      "topic_id": "judd-antin_t16",
      "topic_title": "Sponsor Break",
      "text": "It also performs automated site audits to find what issues prevent your website from ranking higher on Google.",
      "speaker": "Lenny",
      "timestamp": "00:36:39",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2199s",
      "context": "Points to an operational methodology—automated audits—to systematically identify and remove ranking blockers.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t16_q3",
      "topic_id": "judd-antin_t16",
      "topic_title": "Sponsor Break",
      "text": "Every detected issue comes with a detailed explanation and advice on how to fix it.",
      "speaker": "Lenny",
      "timestamp": "00:36:39",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2199s",
      "context": "Emphasizes execution support (diagnosis plus remediation guidance), making it easier to translate findings into action.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t16_q4",
      "topic_id": "judd-antin_t16",
      "topic_title": "Sponsor Break",
      "text": "Spend your time doing the micro stuff like usability research and then the bigger stuff that's part of overall planning.",
      "speaker": "Lenny",
      "timestamp": "00:37:29",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2249s",
      "context": "Offers a prioritization heuristic: focus on tactical usability work and strategic planning rather than getting stuck in a slow “middle research zone.”",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t16_q5",
      "topic_id": "judd-antin_t16",
      "topic_title": "Sponsor Break",
      "text": "It's not like every project you're working on, you need to have a whole research project on.",
      "speaker": "Lenny",
      "timestamp": "00:37:29",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2249s",
      "context": "Challenges the default assumption that each project requires a full research effort, advocating for right-sized research investment.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t17_q1",
      "topic_id": "judd-antin_t17",
      "topic_title": "Micro research value and the \"multimillion dollar button\"",
      "text": "But the micro level, there's so much business value to be derived there, so much business value, and it can go so fast, Lenny, it can go so fast. You can have results in 48 hours on these things.",
      "speaker": "Judd Antin",
      "timestamp": "00:35:16",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2116s",
      "context": "Highlights the speed/ROI case for prioritizing micro/usability research as a rapid lever for business impact.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t17_q2",
      "topic_id": "judd-antin_t17",
      "topic_title": "Micro research value and the \"multimillion dollar button\"",
      "text": "We changed the text on the button with help from our amazing content design, our UX writing team. We basically changed seven characters and made Airbnb millions of dollars, because what we found out was really simple.",
      "speaker": "Judd Antin",
      "timestamp": "00:35:58",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2158s",
      "context": "A concrete example showing how tiny UX copy changes can produce outsized revenue impact.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t17_q3",
      "topic_id": "judd-antin_t17",
      "topic_title": "Micro research value and the \"multimillion dollar button\"",
      "text": "We did the conversion, we added like 1%, which is really, really hard to do.",
      "speaker": "Judd Antin",
      "timestamp": "00:35:58",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2158s",
      "context": "Provides a specific performance data point to quantify the value of micro research-driven iteration.",
      "insight_type": "data"
    },
    {
      "quote_id": "judd-antin_t17_q4",
      "topic_id": "judd-antin_t17",
      "topic_title": "Micro research value and the \"multimillion dollar button\"",
      "text": "A lot of researchers think that that's scut work, that usability is something junior researchers do. I completely disagree.",
      "speaker": "Judd Antin",
      "timestamp": "00:37:55",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2275s",
      "context": "Challenges the common industry belief that usability/micro research is low-status work, reframing it as high-leverage.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t17_q5",
      "topic_id": "judd-antin_t17",
      "topic_title": "Micro research value and the \"multimillion dollar button\"",
      "text": "And the thing about that middle range, I think you're right. That's the stuff that makes the stereotype that research is slow, and a lot of times it's also because it's just not pointed enough.",
      "speaker": "Judd Antin",
      "timestamp": "00:38:24",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2304s",
      "context": "Offers a diagnostic for why research feels slow—mid-range questions that aren’t sufficiently scoped/pointed—and implies a remedy.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t18_q1",
      "topic_id": "judd-antin_t18",
      "topic_title": "More misconceptions: Henry Ford quote and hindsight bias",
      "text": "A researcher who's going to ask customers what they want is a bad researcher. You need a different researcher.",
      "speaker": "Judd Antin",
      "timestamp": "00:42:49",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2569s",
      "context": "A contrarian reminder that UX research isn’t about asking users to specify solutions, but using better methods to uncover needs and constraints.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t18_q2",
      "topic_id": "judd-antin_t18",
      "topic_title": "More misconceptions: Henry Ford quote and hindsight bias",
      "text": "I've never done that in my career. No one on my team has ever run a study that's like that.",
      "speaker": "Judd Antin",
      "timestamp": "00:42:49",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2569s",
      "context": "A concrete example that reinforces the practical norm among strong research teams: they don’t run “what should we build?” studies.",
      "insight_type": "story"
    },
    {
      "quote_id": "judd-antin_t18_q3",
      "topic_id": "judd-antin_t18",
      "topic_title": "More misconceptions: Henry Ford quote and hindsight bias",
      "text": "The author is a sociologist at UPenn named Duncan Watts, and the title is Everything is Obvious If You Already Know the Answer.",
      "speaker": "Judd Antin",
      "timestamp": "00:43:16",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2596s",
      "context": "A specific resource recommendation practitioners can use to understand and counter hindsight bias in product and research decision-making.",
      "insight_type": "advice"
    },
    {
      "quote_id": "judd-antin_t18_q4",
      "topic_id": "judd-antin_t18",
      "topic_title": "More misconceptions: Henry Ford quote and hindsight bias",
      "text": "He makes the argument that we rely too much on intuition, heuristics, and pattern matching in a way that is inappropriate to our experience.",
      "speaker": "Judd Antin",
      "timestamp": "00:43:16",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2596s",
      "context": "A mental model for why teams misjudge “obvious” outcomes: over-trusting intuitive pattern matching beyond what experience can justify.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t18_q5",
      "topic_id": "judd-antin_t18",
      "topic_title": "More misconceptions: Henry Ford quote and hindsight bias",
      "text": "And it happens because we end up selectively remembering things and then constructing narratives around them in a way which makes us feel like we already knew that, when we in fact did not.",
      "speaker": "Judd Antin",
      "timestamp": "00:43:16",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2596s",
      "context": "A practical diagnostic for post-hoc rationalization: selective memory plus narrative-building creates false confidence in past predictions.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t19_q1",
      "topic_id": "judd-antin_t19",
      "topic_title": "Research as mental-model building, not dictating solutions",
      "text": "In my opinion, the best product will stem from a very strong mental model of the domain and user. User research can help you get such a model and validate it along the way.",
      "speaker": "Lenny",
      "timestamp": "00:44:56",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2696s",
      "context": "Frames UXR’s core value as building and validating a team’s mental model rather than producing feature directives.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t19_q2",
      "topic_id": "judd-antin_t19",
      "topic_title": "Research as mental-model building, not dictating solutions",
      "text": "But it's important to view the syllogism of UXR as model of user research, to improving your mental model of the user, to what product you should build versus user research tells you what product to build.",
      "speaker": "Lenny",
      "timestamp": "00:44:56",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2696s",
      "context": "Offers a memorable mental model that separates research-informed reasoning from research-as-orders.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t19_q3",
      "topic_id": "judd-antin_t19",
      "topic_title": "Research as mental-model building, not dictating solutions",
      "text": "So the best research doesn't leave it at that. It tells you, and it's like the what, the so what, and then the then what.",
      "speaker": "Judd Antin",
      "timestamp": "00:45:34",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2734s",
      "context": "Gives a practical structure for communicating research so it translates into action without overstepping.",
      "insight_type": "framework"
    },
    {
      "quote_id": "judd-antin_t19_q4",
      "topic_id": "judd-antin_t19",
      "topic_title": "Research as mental-model building, not dictating solutions",
      "text": "But the problem with that is some researchers go too far in the other direction, where they're like, \"We ran this study, it yielded these insights, and therefore this is what we should build.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:45:34",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2734s",
      "context": "Warns against a common failure mode where researchers become overly prescriptive and lose team alignment.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "judd-antin_t19_q5",
      "topic_id": "judd-antin_t19",
      "topic_title": "Research as mental-model building, not dictating solutions",
      "text": "It is, \"Let us develop a framework which is based on actual evidence, and then together as a team figure out how we want to experiment our way to a successful product.\"",
      "speaker": "Judd Antin",
      "timestamp": "00:46:19",
      "youtube_link": "https://www.youtube.com/watch?v=L6RKi9ZvkT4&t=2779s",
      "context": "Repositions research deliverables as evidence-based frameworks that enable team experimentation rather than single “right answers.”",
      "insight_type": "advice"
    }
  ]
}