{
  "episode_id": "kevin-weil",
  "quotes": [
    {
      "quote_id": "kevin-weil_t1_q1",
      "topic_id": "kevin-weil_t1",
      "topic_title": "Introduction and Background",
      "text": "The AI models that you're using today is the worst AI model you will ever use for the rest of your life, and when you actually get that in your head, it's kind of wild.",
      "speaker": "Kevin Weil",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=0s",
      "context": "A memorable mental model for planning products around continuous, rapid model improvement rather than static capabilities.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t1_q2",
      "topic_id": "kevin-weil_t1",
      "topic_title": "Introduction and Background",
      "text": "Every two months, computers can do something they've never been able to do before and you need to completely think differently about what you're doing.",
      "speaker": "Kevin Weil",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=0s",
      "context": "A concrete cadence that pushes practitioners to revisit assumptions and roadmaps frequently as capabilities shift.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t1_q3",
      "topic_id": "kevin-weil_t1",
      "topic_title": "Introduction and Background",
      "text": "Our general mindset is in two months, there's going to be a better model and it's going to blow away whatever the current set of limitations are.",
      "speaker": "Kevin Weil",
      "timestamp": "00:00:29",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=29s",
      "context": "A practical operating principle for teams building on AI: expect today’s constraints to be temporary.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t1_q4",
      "topic_id": "kevin-weil_t1",
      "topic_title": "Introduction and Background",
      "text": "If you're building and the product that you're building is kind of right on the edge of the capabilities of the models, keep going because you're doing something right.",
      "speaker": "Kevin Weil",
      "timestamp": "00:00:29",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=29s",
      "context": "Counterintuitive advice that being at the edge of model capability is a positive signal, not a reason to stop.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t1_q5",
      "topic_id": "kevin-weil_t1",
      "topic_title": "Introduction and Background",
      "text": "Give it another couple months and the models are going to be great, and suddenly the product that you have that just barely worked is really going to sing.",
      "speaker": "Kevin Weil",
      "timestamp": "00:00:29",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=29s",
      "context": "A tactical product strategy: ship early even if quality is borderline, because model improvements can rapidly lift the experience.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t2_q1",
      "topic_id": "kevin-weil_t2",
      "topic_title": "Sponsor Break",
      "text": "Experimentation is increasingly essential for driving growth and for understanding the performance of new features and Eppo helps you increase experimentation velocity while unlocking rigorous deep analysis in a way that no other commercial tool does.",
      "speaker": "Lenny",
      "timestamp": "00:02:24",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=144s",
      "context": "Highlights experimentation as a core growth capability and emphasizes speed + rigor as the key levers.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t2_q2",
      "topic_id": "kevin-weil_t2",
      "topic_title": "Sponsor Break",
      "text": "When I was at Airbnb, one of the things that I loved most was our experimentation platform where I could set up experiments easily, troubleshoot issues, and analyze performance all on my own.",
      "speaker": "Lenny",
      "timestamp": "00:03:18",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=198s",
      "context": "A concrete example of empowering product teams with self-serve experimentation to reduce dependency bottlenecks.",
      "insight_type": "story"
    },
    {
      "quote_id": "kevin-weil_t2_q3",
      "topic_id": "kevin-weil_t2",
      "topic_title": "Sponsor Break",
      "text": "Eppo does all that and more with advanced statistical methods that can help you shave weeks off experiment time and accessible UI for diving deeper into performance and out-of-the-box reporting that helps you avoid annoying prolonged analytic cycles.",
      "speaker": "Lenny",
      "timestamp": "00:03:18",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=198s",
      "context": "Actionable focus on tooling that reduces experiment duration and eliminates slow analysis loops.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t2_q4",
      "topic_id": "kevin-weil_t2",
      "topic_title": "Sponsor Break",
      "text": "What sets Persona apart is its configurability. Every company has different needs depending on its industry, use cases, risk tolerance and user demographics.",
      "speaker": "Lenny",
      "timestamp": "00:04:06",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=246s",
      "context": "A mental model for identity/fraud systems: optimize for configurable building blocks because requirements vary widely by context.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t2_q5",
      "topic_id": "kevin-weil_t2",
      "topic_title": "Sponsor Break",
      "text": "That's why Persona offers flexible building blocks that allow you to build tailored collection and verification flows that maximize conversion while minimizing risks.",
      "speaker": "Lenny",
      "timestamp": "00:04:06",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=246s",
      "context": "Captures the practical tradeoff framework of balancing conversion and risk via tailored verification flows.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t3_q1",
      "topic_id": "kevin-weil_t3",
      "topic_title": "Image model launch and viral Ghibli trend",
      "text": "There have been a handful of times in my career when you're working on a product internally and the internal usage just explodes.",
      "speaker": "Kevin Weil",
      "timestamp": "00:06:04",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=364s",
      "context": "A practical product-market-fit signal: internal adoption intensity can predict external success, especially pre-launch.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t3_q2",
      "topic_id": "kevin-weil_t3",
      "topic_title": "Image model launch and viral Ghibli trend",
      "text": "More than anything else in my career, we could feel it was going to work because we were all using it internally and we'd go away for a weekend.",
      "speaker": "Kevin Weil",
      "timestamp": "00:06:04",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=364s",
      "context": "A repeatable heuristic: if the team naturally uses the product in real life (even off-hours), confidence in launch outcomes rises.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t3_q3",
      "topic_id": "kevin-weil_t3",
      "topic_title": "Image model launch and viral Ghibli trend",
      "text": "Especially social things because you have a very tight network as a company socially, so you know each other and you're experts in your product hopefully. And so there's some sense in which if you're doing something social and it's not taking off internally, you might question what you're doing.",
      "speaker": "Kevin Weil",
      "timestamp": "00:07:05",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=425s",
      "context": "A counterintuitive internal test: social products should “take off” inside the company first, or it’s a warning sign.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t3_q4",
      "topic_id": "kevin-weil_t3",
      "topic_title": "Image model launch and viral Ghibli trend",
      "text": "It's very good at instruction following.",
      "speaker": "Kevin Weil",
      "timestamp": "00:07:29",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=449s",
      "context": "Reframes the model’s core value beyond style transfer—precision in following complex instructions is the differentiator.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t3_q5",
      "topic_id": "kevin-weil_t3",
      "topic_title": "Image model launch and viral Ghibli trend",
      "text": "And the model actually will understand all of that and do it.",
      "speaker": "Kevin Weil",
      "timestamp": "00:07:29",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=449s",
      "context": "Concrete capability claim: compositional, multi-step spatial instructions can be executed, enabling practical workflows (e.g., layout planning).",
      "insight_type": "data"
    },
    {
      "quote_id": "kevin-weil_t4_q1",
      "topic_id": "kevin-weil_t4",
      "topic_title": "Defining AI, shifting baselines, and normalization",
      "text": "There's this quote I love, which is \"AI is whatever hasn't been done yet\" because once it's been done, when it kind of works, then you call it machine learning, and once it's kind of ubiquitous and it's everywhere, then it's just an algorithm.",
      "speaker": "Kevin Weil",
      "timestamp": "00:09:05",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=545s",
      "context": "A sticky mental model for how “AI” is a moving label that shifts as capabilities become reliable and commonplace.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t4_q2",
      "topic_id": "kevin-weil_t4",
      "topic_title": "Defining AI, shifting baselines, and normalization",
      "text": "So I've always loved that we call things AI when they still don't quite work and then by the time it's like an AI algorithm that's recommending you follow, oh, that's just an algorithm, but this new thing, like self-driving cars, that's it.",
      "speaker": "Kevin Weil",
      "timestamp": "00:09:05",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=545s",
      "context": "A counterintuitive observation that “AI” often denotes immaturity/novelty rather than a stable category—useful for product positioning and expectation-setting.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t4_q3",
      "topic_id": "kevin-weil_t4",
      "topic_title": "Defining AI, shifting baselines, and normalization",
      "text": "And then another 10 minutes, you're bored, you're doing email on your phone, answering Slack messages, and suddenly this miracle of human invention is just an expected part of your life from then on.",
      "speaker": "Kevin Weil",
      "timestamp": "00:10:24",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=624s",
      "context": "A vivid example of normalization: users rapidly reset their baseline, which impacts how quickly product “wow” turns into table stakes.",
      "insight_type": "story"
    },
    {
      "quote_id": "kevin-weil_t4_q4",
      "topic_id": "kevin-weil_t4",
      "topic_title": "Defining AI, shifting baselines, and normalization",
      "text": "These miraculous things happen and computers can do something they've never been able to do before and it blows our mind collectively for a week and then we're like, oh, yeah. Oh, now it's just machine learning on its way to being an algorithm.",
      "speaker": "Kevin Weil",
      "timestamp": "00:10:24",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=624s",
      "context": "A practical reminder that competitive advantage from breakthroughs decays fast as markets normalize new capabilities.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t5_q1",
      "topic_id": "kevin-weil_t5",
      "topic_title": "Kevin’s recruiting story joining OpenAI",
      "text": "Look, we're basically going to move as fast as we want to move. And if you talk to everyone, everyone likes you, you're ready to go.",
      "speaker": "Kevin Weil",
      "timestamp": "00:12:49",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=769s",
      "context": "Captures OpenAI’s high-velocity hiring philosophy and an implicit bar: broad alignment across key stakeholders enables rapid decisions.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t5_q2",
      "topic_id": "kevin-weil_t5",
      "topic_title": "Kevin’s recruiting story joining OpenAI",
      "text": "I was expecting to hear that weekend basically because they sort of set expectations as soon as if this goes well, we're ready to go. And I didn't hear anything.",
      "speaker": "Kevin Weil",
      "timestamp": "00:13:52",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=832s",
      "context": "A concrete example of how even “fast” processes can include silence—useful for calibrating expectations and avoiding premature conclusions.",
      "insight_type": "story"
    },
    {
      "quote_id": "kevin-weil_t5_q3",
      "topic_id": "kevin-weil_t5",
      "topic_title": "Kevin’s recruiting story joining OpenAI",
      "text": "And finally it was like nine days later, they finally got back to me and it turned out there was a bunch of stuff happening internally and this, that and the other thing, and there's just a million things happening.",
      "speaker": "Kevin Weil",
      "timestamp": "00:14:45",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=885s",
      "context": "A specific data point (nine days) illustrating that delays can be driven by internal chaos rather than candidate performance.",
      "insight_type": "data"
    },
    {
      "quote_id": "kevin-weil_t5_q4",
      "topic_id": "kevin-weil_t5",
      "topic_title": "Kevin’s recruiting story joining OpenAI",
      "text": "Yeah. Have a little bit of chill.",
      "speaker": "Kevin Weil",
      "timestamp": "00:15:55",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=955s",
      "context": "Memorable, actionable advice for candidates (and practitioners) to avoid anxiety-driven narratives during ambiguous, high-intensity processes.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t6_q1",
      "topic_id": "kevin-weil_t6",
      "topic_title": "What’s different at OpenAI: pace and uncertainty",
      "text": "I think it's probably the pace. Maybe it's two things. One is it's the pace. The second is everywhere I've ever worked before this, you kind of know what technology you're building on.",
      "speaker": "Kevin Weil",
      "timestamp": "00:16:19",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=979s",
      "context": "Highlights a core operating difference in AI product work: speed plus an unstable underlying tech foundation.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t6_q2",
      "topic_id": "kevin-weil_t6",
      "topic_title": "What’s different at OpenAI: pace and uncertainty",
      "text": "But the stuff that you're building on is kind of fixed. You're talking about databases and things and I bet the database you used this year is probably 5% better than the database you used two years ago, but that's not true at all with AI. It's like every two months computers can do something they've never been able to do before and you need to completely think differently about what you're doing.",
      "speaker": "Kevin Weil",
      "timestamp": "00:16:19",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=979s",
      "context": "Provides a concrete comparative data point (\"5% better\") and a mental model for why AI forces frequent product rethinks.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t6_q3",
      "topic_id": "kevin-weil_t6",
      "topic_title": "What’s different at OpenAI: pace and uncertainty",
      "text": "LLMs are completely different than that. They're good at fuzzy subtle inputs. Then all the nuances of human language and communication, they're pretty good at. And also they don't really give you the same answer. You probably get spiritually the same answer for the same question, but it's certainly not the same set of words every time.",
      "speaker": "Kevin Weil",
      "timestamp": "00:17:10",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1030s",
      "context": "A memorable framing (“fuzzy inputs and fuzzier outputs”) that changes how practitioners should think about UX, determinism, and testing.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t6_q4",
      "topic_id": "kevin-weil_t6",
      "topic_title": "What’s different at OpenAI: pace and uncertainty",
      "text": "If the model gets it right 60% of the time, you build a very different product than if the model gets it right 95% of the time versus if the model gets it right 99.5% of the time.",
      "speaker": "Kevin Weil",
      "timestamp": "00:18:16",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1096s",
      "context": "Actionable reliability-threshold heuristic for deciding what product patterns are viable at different model accuracy levels.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t6_q5",
      "topic_id": "kevin-weil_t6",
      "topic_title": "What’s different at OpenAI: pace and uncertainty",
      "text": "If your database works once, it works every time. And that's not true in this world.",
      "speaker": "Kevin Weil",
      "timestamp": "00:18:16",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1096s",
      "context": "A crisp contrast that challenges traditional software assumptions and motivates evals, guardrails, and probabilistic design.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t7_q1",
      "topic_id": "kevin-weil_t7",
      "topic_title": "Evals as a core skill for AI builders",
      "text": "I think the easiest way to think about it is almost like a quiz for a model, a test to gauge how well it knows a certain set of subject material or how good it is at responding to a certain set of questions.",
      "speaker": "Kevin Weil",
      "timestamp": "00:19:23",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1163s",
      "context": "A simple mental model that helps teams operationalize evals as concrete tests rather than abstract “model quality.”",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t7_q2",
      "topic_id": "kevin-weil_t7",
      "topic_title": "Evals as a core skill for AI builders",
      "text": "There are certain things that models will get right. 99.95% of the time and you can just be confident. There are things that they're going to be 95% right on and things they're going to be 60% right on. If the model's 60% right on something, you're going to need to build your product totally differently.",
      "speaker": "Kevin Weil",
      "timestamp": "00:20:20",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1220s",
      "context": "A product-design rule: reliability tiers should dictate UX, safeguards, and whether you can automate vs. assist.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t7_q3",
      "topic_id": "kevin-weil_t7",
      "topic_title": "Evals as a core skill for AI builders",
      "text": "So as we were building that product, we were designing evals at the same time as we were thinking about how this product was going to work and we were trying to go through hero use cases.",
      "speaker": "Kevin Weil",
      "timestamp": "00:21:10",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1270s",
      "context": "A methodology: co-design evals with the product from day one, anchored on “hero” user workflows.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t7_q4",
      "topic_id": "kevin-weil_t7",
      "topic_title": "Evals as a core skill for AI builders",
      "text": "Here's a question you want to be able to ask. Here's an amazing answer for that question. And then turning those into evals and then hill climbing on those evals.",
      "speaker": "Kevin Weil",
      "timestamp": "00:21:57",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1317s",
      "context": "A practical loop for iteration: define target Q/A pairs, convert to evals, and optimize against them continuously.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t7_q5",
      "topic_id": "kevin-weil_t7",
      "topic_title": "Evals as a core skill for AI builders",
      "text": "So I think there's a sense in which you can think of these models as incredibly smart, very factually aware intelligences, but still most of the world's data, knowledge, process is not public. It's behind the walls of companies or governments or other things.",
      "speaker": "Kevin Weil",
      "timestamp": "00:23:00",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1380s",
      "context": "A contrarian constraint: the limiting factor isn’t model “intelligence” but access to private, domain-specific data and processes.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t8_q1",
      "topic_id": "kevin-weil_t8",
      "topic_title": "Startup moats: where OpenAI won’t build everything",
      "text": "No matter how big your company gets, no matter how incredible the people are, there are way more smart people outside your walls than there are inside your walls.",
      "speaker": "Kevin Weil",
      "timestamp": "00:25:10",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1510s",
      "context": "A scalable mental model for why platforms and ecosystems out-innovate any single company, pointing founders toward building on top of APIs rather than fearing incumbents.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t8_q2",
      "topic_id": "kevin-weil_t8",
      "topic_title": "Startup moats: where OpenAI won’t build everything",
      "text": "We have 3 million developers using our API.",
      "speaker": "Kevin Weil",
      "timestamp": "00:25:10",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1510s",
      "context": "A concrete data point underscoring the size of the OpenAI ecosystem and the distribution advantage available to startups building on it.",
      "insight_type": "data"
    },
    {
      "quote_id": "kevin-weil_t8_q3",
      "topic_id": "kevin-weil_t8",
      "topic_title": "Startup moats: where OpenAI won’t build everything",
      "text": "No matter how ambitious we are, how big we grow, by the way, we don't want to grow super big, there are so many use cases, places in the world where AI can fundamentally make our lives better.",
      "speaker": "Kevin Weil",
      "timestamp": "00:25:10",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1510s",
      "context": "A counterintuitive clarification that OpenAI isn’t trying to build everything, implying room for startups across countless applications.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t8_q4",
      "topic_id": "kevin-weil_t8",
      "topic_title": "Startup moats: where OpenAI won’t build everything",
      "text": "And I think, like I was saying, the data is industry-specific, use case-specific, behind certain company walls, things like that.",
      "speaker": "Kevin Weil",
      "timestamp": "00:25:55",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1555s",
      "context": "Actionable guidance on where defensible moats live for startups: proprietary vertical data and embedded workflows inside organizations.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t8_q5",
      "topic_id": "kevin-weil_t8",
      "topic_title": "Startup moats: where OpenAI won’t build everything",
      "text": "And there are immense opportunities in every industry and every vertical in the world to go build AI-based products that improve upon the state of the art.",
      "speaker": "Kevin Weil",
      "timestamp": "00:25:55",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1555s",
      "context": "A broad but practical directive to focus on vertical-specific AI products rather than competing head-on with foundation model providers.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t9_q1",
      "topic_id": "kevin-weil_t9",
      "topic_title": "Shipping fast: lightweight planning and iterative deployment",
      "text": "I don't for a second believe that what we write down in these documents is what we're going to actually ship three months from now, let alone six or nine. But that's okay. I think it's like an Eisenhower quote, \"Plans are useless. Planning is helpful,\" which I totally subscribe to, especially in this world.",
      "speaker": "Kevin Weil",
      "timestamp": "00:26:53",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1613s",
      "context": "A pragmatic planning philosophy for fast-changing AI environments: plan to align and learn, not to predict exact outputs.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t9_q2",
      "topic_id": "kevin-weil_t9",
      "topic_title": "Shipping fast: lightweight planning and iterative deployment",
      "text": "We try and keep that really lightweight because it's not going to be right. We're going to throw it out halfway because we will have learned new things.",
      "speaker": "Kevin Weil",
      "timestamp": "00:27:44",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1664s",
      "context": "Actionable guidance to keep planning processes minimal and disposable so teams can adapt as new information arrives.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t9_q3",
      "topic_id": "kevin-weil_t9",
      "topic_title": "Shipping fast: lightweight planning and iterative deployment",
      "text": "We are happy making mistakes. We make mistakes all the time.",
      "speaker": "Kevin Weil",
      "timestamp": "00:28:49",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1729s",
      "context": "A speed-oriented operating stance that normalizes errors as the cost of rapid iteration and learning.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t9_q4",
      "topic_id": "kevin-weil_t9",
      "topic_title": "Shipping fast: lightweight planning and iterative deployment",
      "text": "So we have this philosophy, we call iterative deployment, and the idea is we're all learning about these models together. So there's a real sense in which it's way better to ship something even when you don't know the full set of capabilities and iterate together in public.",
      "speaker": "Kevin Weil",
      "timestamp": "00:30:42",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1842s",
      "context": "A concrete methodology for AI products: ship early to discover model behavior and improve with real-world feedback.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t9_q5",
      "topic_id": "kevin-weil_t9",
      "topic_title": "Shipping fast: lightweight planning and iterative deployment",
      "text": "I think the other thing that ends up being a part of our product philosophy is the sense of model maximalism.",
      "speaker": "Kevin Weil",
      "timestamp": "00:31:12",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1872s",
      "context": "A memorable product-building lens that prioritizes leveraging rapidly improving models over heavy, long-lived scaffolding.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t10_q1",
      "topic_id": "kevin-weil_t10",
      "topic_title": "Competition and coding models (Anthropic, OpenAI, others)",
      "text": "I think intelligence is really multi-dimensional and so I think the model providers... It used to be that OpenAI had this massive model lead, 12 months or something ahead of everybody else. That's not true anymore.",
      "speaker": "Kevin Weil",
      "timestamp": "00:33:01",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1981s",
      "context": "A useful mental model for practitioners: expect different models to excel at different tasks, and don’t assume a single dominant leader across capabilities.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t10_q2",
      "topic_id": "kevin-weil_t10",
      "topic_title": "Competition and coding models (Anthropic, OpenAI, others)",
      "text": "And that means that there are going to be different places where the Google models are really good or where Anthropic models are really good, or where we're really good and our competitors are like, \"We got to get better at that.\"",
      "speaker": "Kevin Weil",
      "timestamp": "00:33:01",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1981s",
      "context": "Actionable implication: benchmark across providers by task and be ready to swap models as strengths shift.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t10_q3",
      "topic_id": "kevin-weil_t10",
      "topic_title": "Competition and coding models (Anthropic, OpenAI, others)",
      "text": "And it actually is easier to get better at a certain thing once someone's proved it possible than it is to forge a path through the jungle and doing something brand new.",
      "speaker": "Kevin Weil",
      "timestamp": "00:33:01",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=1981s",
      "context": "A counterintuitive competitive dynamic: breakthroughs trigger fast follower catch-up, so moats based on “first to capability” may be short-lived.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t10_q4",
      "topic_id": "kevin-weil_t10",
      "topic_title": "Competition and coding models (Anthropic, OpenAI, others)",
      "text": "So I just think as an example, it was like nobody could break 4 minutes in the mile, and then finally somebody did and the next year 12 more people did it.",
      "speaker": "Kevin Weil",
      "timestamp": "00:34:03",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2043s",
      "context": "A memorable analogy for rapid diffusion of capability once a frontier is crossed—useful for forecasting model progress and planning product roadmaps.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t10_q5",
      "topic_id": "kevin-weil_t10",
      "topic_title": "Competition and coding models (Anthropic, OpenAI, others)",
      "text": "I think there's that all over the place and it just means that competition is really intense, and consumers are going to win and developers are going to win and businesses are going to win in a big way from that.",
      "speaker": "Kevin Weil",
      "timestamp": "00:34:03",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2043s",
      "context": "Practical takeaway: intense competition accelerates improvements and lowers costs, benefiting builders who can iterate quickly and adopt new models.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t11_q1",
      "topic_id": "kevin-weil_t11",
      "topic_title": "Why ChatGPT won mindshare and usage",
      "text": "I think being first helps, which is one of the reasons why we're so focused on moving quickly.",
      "speaker": "Kevin Weil",
      "timestamp": "00:35:02",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2102s",
      "context": "Highlights a practical product strategy: prioritize speed and shipping early to capture mindshare.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t11_q2",
      "topic_id": "kevin-weil_t11",
      "topic_title": "Why ChatGPT won mindshare and usage",
      "text": "So ChatGPT can be this one- stop-shop where all the things that you want to do are possible.",
      "speaker": "Kevin Weil",
      "timestamp": "00:35:02",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2102s",
      "context": "A clear positioning framework: win by bundling many capabilities into a single destination product.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t11_q3",
      "topic_id": "kevin-weil_t11",
      "topic_title": "Why ChatGPT won mindshare and usage",
      "text": "as we go forward in it, we have more agentic tools like Operator where it's browsing for you and doing things for you on the web, more and more you're going to be able to come to this one place to ChatGPT, give it instructions and have it accomplish real things for you in the world.",
      "speaker": "Kevin Weil",
      "timestamp": "00:35:02",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2102s",
      "context": "Points to an actionable product direction: shift from chat to agents that complete end-to-end tasks.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t11_q4",
      "topic_id": "kevin-weil_t11",
      "topic_title": "Why ChatGPT won mindshare and usage",
      "text": "There's something fundamentally valuable in that.",
      "speaker": "Kevin Weil",
      "timestamp": "00:35:02",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2102s",
      "context": "Emphasizes the core value proposition behind consolidation + task completion, useful for product messaging.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t12_q1",
      "topic_id": "kevin-weil_t12",
      "topic_title": "Designing AI UX: reasoning latency and chain-of-thought",
      "text": "one of the things that's been funny for me is the extent to which you're trying to figure out how some product should work with AI, or even why some AI thing happens to be true, you can often reason about it the way you would reason about another human and it works.",
      "speaker": "Kevin Weil",
      "timestamp": "00:36:14",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2174s",
      "context": "A practical mental model for AI product design: treat the model like a human collaborator to predict behavior and shape UX.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t12_q2",
      "topic_id": "kevin-weil_t12",
      "topic_title": "Designing AI UX: reasoning latency and chain-of-thought",
      "text": "So you can think, if you asked me something that I needed to think for 20 seconds to answer, what would I do? I wouldn't just go mute and not say anything and shut down for 20 seconds and then come back. So we shouldn't do that. We shouldn't just have a slider sitting there. That's annoying.",
      "speaker": "Kevin Weil",
      "timestamp": "00:38:09",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2289s",
      "context": "Actionable UX guidance for reasoning latency: avoid “silent thinking” and generic progress indicators for short waits.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t12_q3",
      "topic_id": "kevin-weil_t12",
      "topic_title": "Designing AI UX: reasoning latency and chain-of-thought",
      "text": "But I also wouldn't just start babbling every single thought that I had. So we probably shouldn't just expose the whole chain of thought as the model's thinking, but I might go like, \"That's a good question. All right.\" I might approach it like that and then think. You're maybe giving little updates and that's actually what we ended up shipping.",
      "speaker": "Kevin Weil",
      "timestamp": "00:38:09",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2289s",
      "context": "A concrete pattern for chain-of-thought UX: acknowledge, then provide lightweight status updates rather than full internal reasoning.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t12_q4",
      "topic_id": "kevin-weil_t12",
      "topic_title": "Designing AI UX: reasoning latency and chain-of-thought",
      "text": "So what we ended up doing was summarizing it in interesting ways. So instead of just getting the subheadings, you're getting one or two sentences about how it's thinking about it and you can learn from that.",
      "speaker": "Kevin Weil",
      "timestamp": "00:40:34",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2434s",
      "context": "A scalable compromise for transparency: summarize reasoning into short, learnable updates instead of dumping raw chain-of-thought.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t12_q5",
      "topic_id": "kevin-weil_t12",
      "topic_title": "Designing AI UX: reasoning latency and chain-of-thought",
      "text": "I think at the scale of 400 million people, you don't want to see the model babble a bunch of things.",
      "speaker": "Kevin Weil",
      "timestamp": "00:40:02",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2402s",
      "context": "A scale-based constraint that challenges “show everything” transparency: what delights power users may fail for mass-market UX.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t13_q1",
      "topic_id": "kevin-weil_t13",
      "topic_title": "Chat as an interface: universal, flexible baseline",
      "text": "I actually think chat is an amazing interface because it's so versatile.",
      "speaker": "Kevin Weil",
      "timestamp": "00:41:30",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2490s",
      "context": "A contrarian stance that reframes chat as a durable, general-purpose UI rather than a temporary stopgap.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t13_q2",
      "topic_id": "kevin-weil_t13",
      "topic_title": "Chat as an interface: universal, flexible baseline",
      "text": "I think it's incredibly universal because it is the way we talk.",
      "speaker": "Kevin Weil",
      "timestamp": "00:41:30",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2490s",
      "context": "A simple mental model for why chat scales across users and contexts: it matches the default human communication protocol.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t13_q3",
      "topic_id": "kevin-weil_t13",
      "topic_title": "Chat as an interface: universal, flexible baseline",
      "text": "If I had some more rigid interface that I was allowed to use when we spoke, I would be able to speak to you about far fewer things and it would actually get in the way of us having maximum communication bandwidth.",
      "speaker": "Kevin Weil",
      "timestamp": "00:42:12",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2532s",
      "context": "A practical product principle: overly constrained UIs reduce expressiveness and limit what users can accomplish with AI.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t13_q4",
      "topic_id": "kevin-weil_t13",
      "topic_title": "Chat as an interface: universal, flexible baseline",
      "text": "But you still want chat as this baseline for anything that falls out of whatever vertical you happen to be building for. It's like a catch-all for every possible thing you'd ever want to express to a model.",
      "speaker": "Kevin Weil",
      "timestamp": "00:43:13",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2593s",
      "context": "A UI strategy framework: build specialized flows for high-volume tasks, but keep chat as the universal fallback layer.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t14_q1",
      "topic_id": "kevin-weil_t14",
      "topic_title": "Sponsor Break",
      "text": "So we just launched OneSchema FileFeeds, which allows you to build an integration with any system in 15 minutes as long as you can export a CSV to an SFTP folder.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:44:15",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2655s",
      "context": "A concrete, time-bound integration approach that product teams can use to quickly support CSV/SFTP-based systems (e.g., ERPs).",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t14_q2",
      "topic_id": "kevin-weil_t14",
      "topic_title": "Sponsor Break",
      "text": "We allow our customers to offer thousands of integrations without involving their engineering team at all.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:44:15",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2655s",
      "context": "Highlights a scalable operating model: decouple integration breadth from engineering bandwidth.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t14_q3",
      "topic_id": "kevin-weil_t14",
      "topic_title": "Sponsor Break",
      "text": "We've heard so many horror stories of multi-day outages from even just a handful of ad records.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:44:49",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2689s",
      "context": "A vivid example of how small data issues can cascade into major reliability incidents, motivating preventative controls.",
      "insight_type": "story"
    },
    {
      "quote_id": "kevin-weil_t14_q4",
      "topic_id": "kevin-weil_t14",
      "topic_title": "Sponsor Break",
      "text": "We have a built-in validation layer that stops any bad data from entering your system, and OneSchema will notify your team immediately of any data that looks incorrect.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:44:49",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2689s",
      "context": "Actionable reliability methodology: validate at the boundary and alert fast to prevent bad imports and reduce customer-impacting errors.",
      "insight_type": "advice"
    },
    {
      "quote_id": "kevin-weil_t15_q1",
      "topic_id": "kevin-weil_t15",
      "topic_title": "Research and product collaboration at OpenAI (partial)",
      "text": "Chat GPT, if you remember, was a low-key research preview.",
      "speaker": "Kevin Weil",
      "timestamp": "00:46:00",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2760s",
      "context": "Highlights a concrete example of shipping early as a “preview” to learn and iterate rather than launching as a fully-formed product.",
      "insight_type": "story"
    },
    {
      "quote_id": "kevin-weil_t15_q2",
      "topic_id": "kevin-weil_t15",
      "topic_title": "Research and product collaboration at OpenAI (partial)",
      "text": "It wasn't a thing that the team launched thinking it was going to be this massive product.",
      "speaker": "Kevin Weil",
      "timestamp": "00:46:15",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2775s",
      "context": "Counterintuitive reminder that breakout products can start as experiments, so teams should design for iteration and discovery.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "kevin-weil_t15_q3",
      "topic_id": "kevin-weil_t15",
      "topic_title": "Research and product collaboration at OpenAI (partial)",
      "text": "We need to be both a world-class research company and a world-class product company, and the two need to really work together, and that's the thing that I think we've been getting much better at over the last six months.",
      "speaker": "Kevin Weil",
      "timestamp": "00:46:21",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2781s",
      "context": "A clear operating model: excellence in both research and product, with tight collaboration as a core capability to build.",
      "insight_type": "framework"
    },
    {
      "quote_id": "kevin-weil_t15_q4",
      "topic_id": "kevin-weil_t15",
      "topic_title": "Research and product collaboration at OpenAI (partial)",
      "text": "If you treat those things separately and the researchers go do amazing things and build models and then they get to some state and then the product and engineering teams go take them and do something with them, we're effectively just an API consumer of our own models.",
      "speaker": "Kevin Weil",
      "timestamp": "00:46:21",
      "youtube_link": "https://www.youtube.com/watch?v=scsW6_2SPC4&t=2781s",
      "context": "Memorable warning against siloed handoffs—without integrated collaboration, even the creator organization loses strategic advantage.",
      "insight_type": "contrarian"
    }
  ]
}