{
  "episode_id": "megan-cook",
  "quotes": [
    {
      "quote_id": "megan-cook_t1_q1",
      "topic_id": "megan-cook_t1",
      "topic_title": "Fight Club: scheduling conflict to resolve issues early",
      "text": "But it's 30 minutes every week, and it's just for myself, my engineering, and my design leader; and we get together, and we know that we're going there to have a conflict.",
      "speaker": "Megan Cook",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=0s",
      "context": "A concrete, repeatable meeting format (cadence, duration, attendees, and intent) for proactively addressing cross-functional conflict.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t1_q2",
      "topic_id": "megan-cook_t1",
      "topic_title": "Fight Club: scheduling conflict to resolve issues early",
      "text": "I think often when there's difficult conversations, or those conflicts come up, you can put them off until they become much bigger.",
      "speaker": "Megan Cook",
      "timestamp": "00:00:18",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=18s",
      "context": "Highlights the compounding cost of delaying hard conversations, motivating earlier intervention.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t1_q3",
      "topic_id": "megan-cook_t1",
      "topic_title": "Fight Club: scheduling conflict to resolve issues early",
      "text": "But by having a specific slot of time in your week for something like that, then you're sort of in that mindset.",
      "speaker": "Megan Cook",
      "timestamp": "00:00:18",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=18s",
      "context": "Suggests scheduling conflict as a tool to create psychological readiness and reduce avoidance.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t1_q4",
      "topic_id": "megan-cook_t1",
      "topic_title": "Fight Club: scheduling conflict to resolve issues early",
      "text": "You know you're going in there to solve a hard problem. You know that there's going to be a disagreement. And it makes it much better.",
      "speaker": "Megan Cook",
      "timestamp": "00:00:18",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=18s",
      "context": "Frames disagreement as expected and productive when the purpose is explicit, improving outcomes.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t1_q5",
      "topic_id": "megan-cook_t1",
      "topic_title": "Fight Club: scheduling conflict to resolve issues early",
      "text": "I think the relationship we all have is so much better because we get on top of these things early.",
      "speaker": "Megan Cook",
      "timestamp": "00:00:18",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=18s",
      "context": "Connects early conflict resolution directly to stronger cross-functional relationships.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t2_q1",
      "topic_id": "megan-cook_t2",
      "topic_title": "Introduction and Background",
      "text": "Megan is head of product for Jira, which is used by 75% of Fortune 500 companies, 125,000 customers globally, and is by far the most popular project management tool in the world.",
      "speaker": "Lenny",
      "timestamp": "00:00:51",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=51s",
      "context": "Strong adoption metrics that establish Jira’s scale and credibility as a market leader.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t2_q2",
      "topic_id": "megan-cook_t2",
      "topic_title": "Introduction and Background",
      "text": "Megan has been at Atlassian for just under 11 years.",
      "speaker": "Lenny",
      "timestamp": "00:01:06",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=66s",
      "context": "Signals deep tenure and long-term product leadership experience within one company.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t2_q3",
      "topic_id": "megan-cook_t2",
      "topic_title": "Introduction and Background",
      "text": "In our conversation, we discuss what Atlassian has done so right in being able to offer 15 different product lines, which many companies dream of, how they continue to stay ahead of the market in spite of the many competitors in the space, why Megan considers play so essential to building great teams and great products, a bunch of tactical advice for getting buy-in for your ideas, tips for being a successful PM in a remote environment.",
      "speaker": "Lenny",
      "timestamp": "00:01:15",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=75s",
      "context": "Highlights several practitioner-relevant themes (multi-product strategy, competition, play, buy-in, remote PM) that frame the episode’s actionable takeaways.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t3_q1",
      "topic_id": "megan-cook_t3",
      "topic_title": "Sponsor Break",
      "text": "I always like to spend this time reflecting on what I accomplished the previous year, what I hope to accomplish the next year, and whether this is the year I look for a new opportunity.",
      "speaker": "Host",
      "timestamp": "00:01:49",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=109s",
      "context": "A simple annual reflection framework for evaluating growth, goals, and whether to pursue a job change.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t3_q2",
      "topic_id": "megan-cook_t3",
      "topic_title": "Sponsor Break",
      "text": "With an AI-powered resume builder, job tracker, cover letter generator, and Chrome extension that integrates with over 40 job boards, Teal is the all-in-one platform you need to run a more streamlined and efficient job search and stand out in this competitive market.",
      "speaker": "Host",
      "timestamp": "00:01:49",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=109s",
      "context": "A concrete, tool-based methodology for operationalizing a job search end-to-end and improving execution efficiency.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t3_q3",
      "topic_id": "megan-cook_t3",
      "topic_title": "Sponsor Break",
      "text": "There's a reason nearly 1 million people have trusted Teal to run their job search.",
      "speaker": "Host",
      "timestamp": "00:01:49",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=109s",
      "context": "A specific adoption data point that signals product traction and social proof.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t3_q4",
      "topic_id": "megan-cook_t3",
      "topic_title": "Sponsor Break",
      "text": "Here's how it works: it all starts with Sprig's precise targeting, which allows you to trigger in-app studies based on users' characteristics and actions taken in product.",
      "speaker": "Host",
      "timestamp": "00:02:39",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=159s",
      "context": "A practical research workflow: target the right users at the right moment based on behavior and attributes.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t3_q5",
      "topic_id": "megan-cook_t3",
      "topic_title": "Sponsor Break",
      "text": "They're the only platform with product level AI, meaning it analyzes data across all of your studies to centralize the most important product opportunities, trends, and correlations, in one realtime feed.",
      "speaker": "Host",
      "timestamp": "00:02:39",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=159s",
      "context": "A mental model for scaling product insights by aggregating learnings across studies into a single decision-making stream.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t4_q1",
      "topic_id": "megan-cook_t4",
      "topic_title": "Why play and psychological safety matter",
      "text": "And it's funny because when I thought about play where my mind went to the opposite of play is work. We often hear work and play as opposites together, but his point was actually that the opposite of play is fear.",
      "speaker": "Megan Cook",
      "timestamp": "00:06:52",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=412s",
      "context": "A counterintuitive reframe that links play directly to reducing fear—useful for diagnosing why teams get cautious and incremental.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t4_q2",
      "topic_id": "megan-cook_t4",
      "topic_title": "Why play and psychological safety matter",
      "text": "Every time things were coming to leadership to give feedback on, it was just sort of painfully polished. And I think once it gets to that level, that's a really bad time to give feedback, because it probably means that a whole ton of work has gone into it, and you might waste a whole bunch of work if you have to correct direction or make significant changes.",
      "speaker": "Megan Cook",
      "timestamp": "00:05:08",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=308s",
      "context": "A practical warning sign and timing principle: if feedback only happens at “polished” stages, you’re likely missing early-course correction and burning time.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t4_q3",
      "topic_id": "megan-cook_t4",
      "topic_title": "Why play and psychological safety matter",
      "text": "And he talked about how to be in that state of flow, where everything is going really well and new ideas are coming and you're making progress, you've got great momentum. And he talked about how to be in that flow state. There needs to be this sense of play and that things are fun. Your mind's open to new ideas, you feel really present. You're not stressing out and thinking about a ton of other different things.",
      "speaker": "Megan Cook",
      "timestamp": "00:05:53",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=353s",
      "context": "A usable mental model connecting “play” to flow conditions (openness, presence, reduced stress) that leaders can intentionally cultivate.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t4_q4",
      "topic_id": "megan-cook_t4",
      "topic_title": "Why play and psychological safety matter",
      "text": "So we divided the team into these smaller groups for peer feedback groups and the idea is that they meet every two weeks or so, somebody brings something that's in a pretty rough draft that they want to get reviewed and then everyone's expected to give feedback.",
      "speaker": "Megan Cook",
      "timestamp": "00:07:40",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=460s",
      "context": "A concrete, repeatable mechanism for psychological safety: small peer groups with frequent review of rough drafts to normalize early feedback.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t4_q5",
      "topic_id": "megan-cook_t4",
      "topic_title": "Why play and psychological safety matter",
      "text": "So took that decision and went, okay, we need to look at psychological safety in that team or we're never going to get to some of these bigger, bolder, more innovative ideas.",
      "speaker": "Megan Cook",
      "timestamp": "00:06:52",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=412s",
      "context": "A clear causal claim leaders can act on: psychological safety is a prerequisite for bold, innovative ideas rather than incrementalism.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t5_q1",
      "topic_id": "megan-cook_t5",
      "topic_title": "Peer feedback groups to normalize early drafts",
      "text": "So we divided the team into these smaller groups for peer feedback groups and the idea is that they meet every two weeks or so, somebody brings something that's in a pretty rough draft that they want to get reviewed and then everyone's expected to give feedback.",
      "speaker": "Megan Cook",
      "timestamp": "00:07:40",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=460s",
      "context": "A concrete, repeatable operating cadence for normalizing early-draft review and making feedback a routine team habit.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t5_q2",
      "topic_id": "megan-cook_t5",
      "topic_title": "Peer feedback groups to normalize early drafts",
      "text": "And because we've got people in there who are different leadership levels, it's a really good opportunity to model the kind of feedback that's helpful and the culture there is one of everyone lifting that person up to make their work stronger.",
      "speaker": "Megan Cook",
      "timestamp": "00:07:40",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=460s",
      "context": "Shows how mixing levels in a small group can teach feedback norms and reinforce a supportive critique culture.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t5_q3",
      "topic_id": "megan-cook_t5",
      "topic_title": "Peer feedback groups to normalize early drafts",
      "text": "So really, it can be anything. It can be here's a new experience, [inaudible 00:09:15] launching, here's a new strategy. I've taken my own strategies in there and gotten excellent feedback, surprising feedback from the team. Can be a new experiment that people think of running and anything to do with the craft.",
      "speaker": "Megan Cook",
      "timestamp": "00:09:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=551s",
      "context": "Expands the method beyond PRDs to any “craft” work, including leaders bringing their own strategies to get unexpected input.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t5_q4",
      "topic_id": "megan-cook_t5",
      "topic_title": "Peer feedback groups to normalize early drafts",
      "text": "You might go through an experience once every quarter or once every six months and that can feel really stressful, but if you're doing it again and again, you get used to it. You get used to what to expect, you get a bit more practice, it can feel much more comfortable.",
      "speaker": "Megan Cook",
      "timestamp": "00:09:46",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=586s",
      "context": "A “build the muscle” mental model: increasing feedback frequency reduces anxiety and improves performance through repetition.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t5_q5",
      "topic_id": "megan-cook_t5",
      "topic_title": "Peer feedback groups to normalize early drafts",
      "text": "And this is just a little informal. It's almost like a little peer group board of directors for your work.",
      "speaker": "Lenny",
      "timestamp": "00:10:04",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=604s",
      "context": "A memorable metaphor that reframes peer feedback groups as an accessible alternative to hard-to-find mentors or coaches.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t6_q1",
      "topic_id": "megan-cook_t6",
      "topic_title": "Twice-yearly onsite: craft, strategy, and failure stories",
      "text": "One of the other things we do is we get everyone together just like every six months. So all of the product managers get together in the same place and the idea is to have a bit of an onsite.",
      "speaker": "Megan Cook",
      "timestamp": "00:10:29",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=629s",
      "context": "A simple operating cadence (twice-yearly onsite) that teams can copy to strengthen alignment and cohesion in remote orgs.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t6_q2",
      "topic_id": "megan-cook_t6",
      "topic_title": "Twice-yearly onsite: craft, strategy, and failure stories",
      "text": "Now we start off with just doing something fun because everybody... As you might know, Atlassian is a remote organization, so everybody works remote all the time. They can work from anywhere. And so people often, they're not used to necessarily being all together in the same place. It can take a little while to warm up.",
      "speaker": "Megan Cook",
      "timestamp": "00:10:29",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=629s",
      "context": "A practical facilitation tactic: deliberately begin with fun to help remote teams acclimate and build rapport before deeper work.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t6_q3",
      "topic_id": "megan-cook_t6",
      "topic_title": "Twice-yearly onsite: craft, strategy, and failure stories",
      "text": "And then after that we talk about strategy. We do workshops on different elements of craft boosting that craft together.",
      "speaker": "Megan Cook",
      "timestamp": "00:10:29",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=629s",
      "context": "A replicable onsite agenda structure: relationship-building first, then strategy alignment, then skill/craft development.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t6_q4",
      "topic_id": "megan-cook_t6",
      "topic_title": "Twice-yearly onsite: craft, strategy, and failure stories",
      "text": "In this last one, I actually had some senior leaders from all over the organization come and share their stories of failure. So just to get everyone used to that idea that it's okay to fail and actually if the learnings are really good, maybe it should even be celebrated and it's not something to be scared of. And taking the big swing isn't a bad thing. It can be a really powerful way to learn as well.",
      "speaker": "Megan Cook",
      "timestamp": "00:11:23",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=683s",
      "context": "A concrete culture mechanism: leaders publicly share failures to normalize learning, reduce fear, and encourage bigger bets.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t6_q5",
      "topic_id": "megan-cook_t6",
      "topic_title": "Twice-yearly onsite: craft, strategy, and failure stories",
      "text": "And I think as a product leader, it's really important to model the behavior you want to see from your teams, whether that's getting out there teaching, presenting, explaining different concepts, explaining the business or just being vulnerable and talking about when things haven't worked out.",
      "speaker": "Megan Cook",
      "timestamp": "00:13:16",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=796s",
      "context": "Leadership guidance: culture and skill-building scale faster when leaders visibly demonstrate the behaviors they expect.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t7_q1",
      "topic_id": "megan-cook_t7",
      "topic_title": "Signals of safety decline and the $10 priorities game",
      "text": "Yeah, absolutely. And I think as a product leader, it's really important to model the behavior you want to see from your teams, whether that's getting out there teaching, presenting, explaining different concepts, explaining the business or just being vulnerable and talking about when things haven't worked out.",
      "speaker": "Megan Cook",
      "timestamp": "00:13:16",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=796s",
      "context": "Actionable leadership advice on how to proactively shape team culture and psychological safety through modeling behaviors.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t7_q2",
      "topic_id": "megan-cook_t7",
      "topic_title": "Signals of safety decline and the $10 priorities game",
      "text": "Probably when we got into really different streams of work that were happening where people didn't have as much of a reason to interact with each other. So I think that was probably around, even around 15 we started to see a little bit of that.",
      "speaker": "Megan Cook",
      "timestamp": "00:14:00",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=840s",
      "context": "A concrete signal and approximate team-size inflection point for when openness can decline as workstreams fragment.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t7_q3",
      "topic_id": "megan-cook_t7",
      "topic_title": "Signals of safety decline and the $10 priorities game",
      "text": "So we've just started trying something new called the $10 game for priorities.",
      "speaker": "Megan Cook",
      "timestamp": "00:14:24",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=864s",
      "context": "Introduces a lightweight prioritization/alignment framework that can be applied in 1:1s to clarify tradeoffs.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t7_q4",
      "topic_id": "megan-cook_t7",
      "topic_title": "Signals of safety decline and the $10 priorities game",
      "text": "So you and your manager might come in and you can list out all of your priorities and then show you through just dividing up $10 where you're spending all of your time.",
      "speaker": "Megan Cook",
      "timestamp": "00:14:24",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=864s",
      "context": "A practical method for making time allocation explicit and comparable against stated priorities.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t7_q5",
      "topic_id": "megan-cook_t7",
      "topic_title": "Signals of safety decline and the $10 priorities game",
      "text": "And I've done this with people and we've sort of gotten down to like, \"I'm putting 10 cents here this week.\" And I'm like, \"Oh, what is that? 20 minutes, 30 minutes spending. I didn't think that's actually moving right.\"",
      "speaker": "Megan Cook",
      "timestamp": "00:14:24",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=864s",
      "context": "A vivid example of how the $10 game surfaces low-leverage work that feels meaningful but isn’t moving outcomes.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t8_q1",
      "topic_id": "megan-cook_t8",
      "topic_title": "Remote work at Atlassian: connection and intentionality",
      "text": "we're really firm believers that you don't need to be in the office to build world-class products.",
      "speaker": "Megan Cook",
      "timestamp": "00:16:04",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=964s",
      "context": "A contrarian principle that reframes remote work as compatible with top-tier product outcomes.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t8_q2",
      "topic_id": "megan-cook_t8",
      "topic_title": "Remote work at Atlassian: connection and intentionality",
      "text": "So we call our product team anywhere, and this means that anyone Atlassian can choose where they want to work every day.",
      "speaker": "Megan Cook",
      "timestamp": "00:16:04",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=964s",
      "context": "A clear, portable policy framework (“Team Anywhere”) that operationalizes flexibility as a default.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t8_q3",
      "topic_id": "megan-cook_t8",
      "topic_title": "Remote work at Atlassian: connection and intentionality",
      "text": "The first one is just making time for connection.",
      "speaker": "Megan Cook",
      "timestamp": "00:17:12",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1032s",
      "context": "Actionable guidance that prioritizes deliberate relationship-building as a core remote-work practice.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t8_q4",
      "topic_id": "megan-cook_t8",
      "topic_title": "Remote work at Atlassian: connection and intentionality",
      "text": "So we found the connection and productivity, they both get boosted by about 30% when you bring people together but intentionally, and it lasts them months.",
      "speaker": "Megan Cook",
      "timestamp": "00:17:12",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1032s",
      "context": "A concrete data point supporting intentional in-person gatherings as a high-leverage intervention.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t8_q5",
      "topic_id": "megan-cook_t8",
      "topic_title": "Remote work at Atlassian: connection and intentionality",
      "text": "So we found that you can do it on average like three times a year.",
      "speaker": "Megan Cook",
      "timestamp": "00:17:12",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1032s",
      "context": "A specific cadence recommendation that challenges the assumption that in-person connection must be frequent to be effective.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t9_q1",
      "topic_id": "megan-cook_t9",
      "topic_title": "Remote execution: deep work blocks and async status",
      "text": "And so as PMs, we need time for creative work. We need that deep work time, and that doesn't happen when you've got all of these meetings with 30 minutes in between each of them. You need three to four hours to get that going, to get into that flow state.",
      "speaker": "Megan Cook",
      "timestamp": "00:19:33",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1173s",
      "context": "Makes a concrete case for protecting multi-hour blocks (not fragmented gaps) to enable true deep work and creativity.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t9_q2",
      "topic_id": "megan-cook_t9",
      "topic_title": "Remote execution: deep work blocks and async status",
      "text": "So my leadership team and I, we actually sync up our calendars, so we end up having these long stretches twice a week all at the same time. And so we all get a chance to do this deep work.",
      "speaker": "Megan Cook",
      "timestamp": "00:19:33",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1173s",
      "context": "Introduces a practical team-level mechanism—synchronized deep-work blocks—to prevent meeting creep and normalize focus time.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t9_q3",
      "topic_id": "megan-cook_t9",
      "topic_title": "Remote execution: deep work blocks and async status",
      "text": "So that meeting time becomes really precious. And what we do there is... I personally hate having status updates as a meeting. So I make it really clear that if we're having a meeting, this is to solve a problem. And if it's just a status update, that's fine, then I can read that asynchronously at a time that works for me.",
      "speaker": "Megan Cook",
      "timestamp": "00:21:52",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1312s",
      "context": "Defines a clear operating rule: meetings are for problem-solving, while status is async—reducing meeting load and improving focus.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t9_q4",
      "topic_id": "megan-cook_t9",
      "topic_title": "Remote execution: deep work blocks and async status",
      "text": "So what's become a big part of how we work is actually audio and video recordings.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "Highlights a scalable async tactic for global teams that avoids timezone pain while preserving nuance and clarity.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t10_q1",
      "topic_id": "megan-cook_t10",
      "topic_title": "Async video as a new collaboration primitive",
      "text": "It's really hard to find a time that works for an Aussie, an American and a European to get together. Someone's waking up at 3:00 AM or something.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "Highlights the concrete coordination cost of synchronous meetings across time zones, motivating async-first collaboration.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t10_q2",
      "topic_id": "megan-cook_t10",
      "topic_title": "Async video as a new collaboration primitive",
      "text": "So what's become a big part of how we work is actually audio and video recordings.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "Actionable shift: use async audio/video as a default collaboration mechanism in distributed teams.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t10_q3",
      "topic_id": "megan-cook_t10",
      "topic_title": "Async video as a new collaboration primitive",
      "text": "I actually had someone reporting to me for a while who was in France and what we would do was record videos back and forth and they're quick.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "Specific example of replacing live 1:1s with fast async video exchanges to maintain momentum across time zones.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t10_q4",
      "topic_id": "megan-cook_t10",
      "topic_title": "Async video as a new collaboration primitive",
      "text": "So that's becoming almost like a completely new document type for us and it's been really important in remote work.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "A memorable mental model: treat async video as a first-class “document type,” not just a meeting substitute.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t10_q5",
      "topic_id": "megan-cook_t10",
      "topic_title": "Async video as a new collaboration primitive",
      "text": "You can put at the top of a document and explain the document, which is really nice. It's a big part of why we bought Loom.",
      "speaker": "Megan Cook",
      "timestamp": "00:23:11",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1391s",
      "context": "Practical tactic (video context atop docs) plus a concrete outcome showing how central this workflow became at Atlassian.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t11_q1",
      "topic_id": "megan-cook_t11",
      "topic_title": "Getting buy-in: treat it as a journey",
      "text": "Most of the time when people come to me and they want to ask how to get by-in, they've got a date in mind, they've got a particular meeting and they have this idea where they're going to crop this perfect proposal, they're going to present it, everyone's going to give them thumbs up and they win. And that's the wrong attitude I think even to start with to getting buy-in. It's more of a journey.",
      "speaker": "Megan Cook",
      "timestamp": "00:25:17",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1517s",
      "context": "Reframes buy-in from a one-shot presentation to an ongoing process, challenging the common “perfect proposal” mindset.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t11_q2",
      "topic_id": "megan-cook_t11",
      "topic_title": "Getting buy-in: treat it as a journey",
      "text": "Jira is also a platform as well as just Jira software the product. There's actually four different products built on top of it. So when you want to go and change something like that, you're actually changing it for all of these different products. It's not just the one.",
      "speaker": "Megan Cook",
      "timestamp": "00:26:12",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1572s",
      "context": "A concrete example showing why stakeholder buy-in is inherently multi-dimensional when you’re operating on a platform with downstream products.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t11_q3",
      "topic_id": "megan-cook_t11",
      "topic_title": "Getting buy-in: treat it as a journey",
      "text": "So every product that this could potentially negatively or positively impact, we went to very early with the idea and the proposal and we got their feedback and then we came to them and again and again as we developed it further.",
      "speaker": "Megan Cook",
      "timestamp": "00:26:12",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1572s",
      "context": "Actionable methodology: identify impacted groups early and run iterative feedback loops throughout development.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t11_q4",
      "topic_id": "megan-cook_t11",
      "topic_title": "Getting buy-in: treat it as a journey",
      "text": "So if you know that you're going to be having a big impact in someone's space and you want to hear from them, it's good to set that meeting up early when you've got some clarity but it's not fully fleshed out and so that you can fold in some of their concerns because they'll have this much broader view.",
      "speaker": "Megan Cook",
      "timestamp": "00:26:54",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1614s",
      "context": "Practical advice for executives and key stakeholders: meet early with partial clarity to incorporate broader concerns before decisions harden.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t11_q5",
      "topic_id": "megan-cook_t11",
      "topic_title": "Getting buy-in: treat it as a journey",
      "text": "And that also creates people who will be an advocate for you once you get into that room, that final meeting.",
      "speaker": "Megan Cook",
      "timestamp": "00:26:54",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1614s",
      "context": "Highlights a leverage point of early alignment: turning stakeholders into advocates for the final decision meeting.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t12_q1",
      "topic_id": "megan-cook_t12",
      "topic_title": "Show hypotheses, not certainty; meeting setup matters",
      "text": "So I think when you come to the meeting going, okay, here's the top-back so we actually know, and here's the hypotheses and here's my plan to prove or disprove them, then you're exposing your idea for people to go, oh, here's more that I know about that hypotheses, or here's some data that you don't have or here's another way to think about it.",
      "speaker": "Megan Cook",
      "timestamp": "00:29:41",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1781s",
      "context": "A practical meeting framework for separating facts vs. hypotheses and explicitly inviting others to strengthen (or challenge) your thinking.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t12_q2",
      "topic_id": "megan-cook_t12",
      "topic_title": "Show hypotheses, not certainty; meeting setup matters",
      "text": "But I usually find that if you come in there open and you're exposed, you're thinking and where you could use some help on perspectives, that actually that builds more credibility because everyone knows that you are not going to have all the answers and you're not going to be able to see the future.",
      "speaker": "Megan Cook",
      "timestamp": "00:29:41",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1781s",
      "context": "Counterintuitive credibility lesson: showing uncertainty and asking for critique can increase trust more than projecting certainty.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t12_q3",
      "topic_id": "megan-cook_t12",
      "topic_title": "Show hypotheses, not certainty; meeting setup matters",
      "text": "And in the end, acquisition or not, that doesn't really matter. It's more about being able to get that value back to our customers. That's what we're solving for.",
      "speaker": "Megan Cook",
      "timestamp": "00:31:45",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1905s",
      "context": "A crisp reframing that prevents solution-lock by anchoring decisions on customer value rather than the chosen path (build vs. buy).",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t12_q4",
      "topic_id": "megan-cook_t12",
      "topic_title": "Show hypotheses, not certainty; meeting setup matters",
      "text": "But actually you want to take a step back and you want to be really clear on what are you looking for from that group. You can ask for the decision, you can ask for feedback, you can ask for... You can expose where you're not quite sure about something and you want them to be thinking about that angle in particular and helping test that hypothesis with what they know.",
      "speaker": "Megan Cook",
      "timestamp": "00:32:16",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1936s",
      "context": "Actionable guidance for exec meetings: set the “ask” up front so the room listens through the right lens (decision vs. feedback vs. hypothesis-testing).",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t12_q5",
      "topic_id": "megan-cook_t12",
      "topic_title": "Show hypotheses, not certainty; meeting setup matters",
      "text": "Then I find it's really useful to have a narrative that just encompasses everything that you're going to talk about. So just really brief, what's the current situation, what has changed and what are the implications that you now want to... We mean we have a problem to solve and an opportunity that we can go after.",
      "speaker": "Megan Cook",
      "timestamp": "00:33:02",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=1982s",
      "context": "A simple narrative structure for proposals that helps executives quickly orient: situation → change → implications/opportunity.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t13_q1",
      "topic_id": "megan-cook_t13",
      "topic_title": "Sponsor Break",
      "text": "Over 5,000 fast-growing companies use Vanta to automate up to 90% of the work involved with SOC 2 and these other frameworks.",
      "speaker": "Lenny",
      "timestamp": "00:36:24",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2184s",
      "context": "Concrete adoption and automation metrics that quantify the potential ROI of compliance automation.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t13_q2",
      "topic_id": "megan-cook_t13",
      "topic_title": "Sponsor Break",
      "text": "get ready for audits in weeks, not months.",
      "speaker": "Lenny",
      "timestamp": "00:35:48",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2148s",
      "context": "A clear time-to-value benchmark practitioners can use to evaluate process improvements in compliance readiness.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t13_q3",
      "topic_id": "megan-cook_t13",
      "topic_title": "Sponsor Break",
      "text": "you're really good at fighting the good fight, which essentially is just doing the things that need to be done that aren't necessarily popular or that people are prioritizing right now.",
      "speaker": "Lenny",
      "timestamp": "00:36:45",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2205s",
      "context": "A memorable framing for prioritizing important, unglamorous work that organizations tend to neglect.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t13_q4",
      "topic_id": "megan-cook_t13",
      "topic_title": "Sponsor Break",
      "text": "I hear that you led to a big investment in CSAT at Atlassian because you just felt like this was the right way of doing it.",
      "speaker": "Lenny",
      "timestamp": "00:36:45",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2205s",
      "context": "A specific example of pushing for customer satisfaction investment based on conviction, useful for influencing priorities.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t14_q1",
      "topic_id": "megan-cook_t14",
      "topic_title": "Fighting the good fight: investing in CSAT improvements",
      "text": "sometimes you can get caught up in let's add value, add value, add value to the product, but if the customer aren't satisfied with what you built, or in our case we found that one of the core reasons was the usability, it wasn't where it needed to be. Then we can't access that value anyway. It doesn't matter.",
      "speaker": "Megan Cook",
      "timestamp": "00:37:24",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2244s",
      "context": "A contrarian reminder that feature value is irrelevant if usability blocks customers from realizing it.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t14_q2",
      "topic_id": "megan-cook_t14",
      "topic_title": "Fighting the good fight: investing in CSAT improvements",
      "text": "Even though this request was coming from the top, that doesn't mean that it gets any sort of funding.",
      "speaker": "Megan Cook",
      "timestamp": "00:39:05",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2345s",
      "context": "Highlights the practical reality that executive support still requires a concrete funding and resourcing plan.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "megan-cook_t14_q3",
      "topic_id": "megan-cook_t14",
      "topic_title": "Fighting the good fight: investing in CSAT improvements",
      "text": "I don't know if you've ever tried to align three or four different roadmaps so that the timing is just right to get some improvement through, but it's basically impossible.",
      "speaker": "Megan Cook",
      "timestamp": "00:40:52",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2452s",
      "context": "A memorable warning about cross-team dependency planning, motivating alternative coordination mechanisms.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t14_q4",
      "topic_id": "megan-cook_t14",
      "topic_title": "Fighting the good fight: investing in CSAT improvements",
      "text": "So each of those teams flipped forward, we call them a shepherd, so that as our developers came in and made changes in the code base that this shepherd would make sure that they weren't causing any issues and we're doing reviews and reviews of designs and things like that.",
      "speaker": "Megan Cook",
      "timestamp": "00:41:39",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2499s",
      "context": "A concrete, low-cost coordination model (“shepherds”) for making dependent platform changes without fully staffing every team.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t14_q5",
      "topic_id": "megan-cook_t14",
      "topic_title": "Fighting the good fight: investing in CSAT improvements",
      "text": "So I think if you have a hypothesis and you can start small, you can get that investment more easily, you can show success, you can always build on that in the future to get more and more.",
      "speaker": "Megan Cook",
      "timestamp": "00:43:04",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2584s",
      "context": "Actionable sequencing advice: de-risk big quality initiatives by proving impact with small initial bets and compounding momentum.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t15_q1",
      "topic_id": "megan-cook_t15",
      "topic_title": "Atlassian’s multi-product success: setup and early history",
      "text": "You know what, it's not like we added the first product and got it just right way off the bat. So yeah, 15, we've had a lot of shots at this, so I might talk about two examples.",
      "speaker": "Megan Cook",
      "timestamp": "00:46:59",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2819s",
      "context": "Highlights a repeatable portfolio mindset: multi-product success comes from many iterations and attempts, not a single perfect launch.",
      "insight_type": "advice"
    },
    {
      "quote_id": "megan-cook_t15_q2",
      "topic_id": "megan-cook_t15",
      "topic_title": "Atlassian’s multi-product success: setup and early history",
      "text": "I think the first one, if I think about Jira software, it started just as a really humble bug tracker. That was it.",
      "speaker": "Megan Cook",
      "timestamp": "00:46:59",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2819s",
      "context": "A reminder that enduring platforms can start as narrow, simple tools before expanding—useful for product scoping and sequencing.",
      "insight_type": "story"
    },
    {
      "quote_id": "megan-cook_t15_q3",
      "topic_id": "megan-cook_t15",
      "topic_title": "Atlassian’s multi-product success: setup and early history",
      "text": "And then it sort of weathered these massive changes in how people build software.",
      "speaker": "Megan Cook",
      "timestamp": "00:46:59",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2819s",
      "context": "Points to resilience as a product strategy: surviving major industry shifts can be as important as initial differentiation.",
      "insight_type": "framework"
    },
    {
      "quote_id": "megan-cook_t15_q4",
      "topic_id": "megan-cook_t15",
      "topic_title": "Atlassian’s multi-product success: setup and early history",
      "text": "So it launched in 2003. And if I remember correctly, just to date this, the mobile phone that was most popular at the time was the Nokia 6100.",
      "speaker": "Megan Cook",
      "timestamp": "00:46:59",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2819s",
      "context": "A concrete historical anchor that underscores how long-lived products must evolve across multiple technology eras.",
      "insight_type": "data"
    },
    {
      "quote_id": "megan-cook_t15_q5",
      "topic_id": "megan-cook_t15",
      "topic_title": "Atlassian’s multi-product success: setup and early history",
      "text": "But actually it's more like 50% or maybe just shy of 50% are developers.",
      "speaker": "Megan Cook",
      "timestamp": "00:47:47",
      "youtube_link": "https://www.youtube.com/watch?v=MQQ1wohqArk&t=2867s",
      "context": "Counterintuitive usage data that challenges the assumption Jira is primarily for developers, implying broader positioning and adoption levers.",
      "insight_type": "contrarian"
    }
  ]
}