{
  "episode_id": "melissa-perri",
  "quotes": [
    {
      "quote_id": "melissa-perri_t1_q1",
      "topic_id": "melissa-perri_t1",
      "topic_title": "Introduction and Background",
      "text": "Scaled Agile Framework came out of the desire to figure out how do we scale Scrum and different processes. I do not recommend using SAFe. Every single person I have talked to who likes SAFe, found success with SAFe, they ended up ripping it up and making it into something else.",
      "speaker": "Melissa Perri",
      "timestamp": "00:00:03",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=3s",
      "context": "A contrarian take that challenges SAFe as a default choice and suggests teams often succeed only after heavily adapting it.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t1_q2",
      "topic_id": "melissa-perri_t1",
      "topic_title": "Introduction and Background",
      "text": "This product owner role did not emerge from product management as we know it today. It was a way to help the developers prioritize what to work on.",
      "speaker": "Melissa Perri",
      "timestamp": "00:00:23",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=23s",
      "context": "Clarifies the origin/purpose of the product owner role, which can help practitioners set expectations and avoid conflating it with modern product management.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t1_q3",
      "topic_id": "melissa-perri_t1",
      "topic_title": "Introduction and Background",
      "text": "A lot of large companies turn to Scrum or to the frameworks, and it's because they traditionally didn't grow up building software.",
      "speaker": "Melissa Perri",
      "timestamp": "00:00:44",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=44s",
      "context": "Explains a common adoption driver in large non-tech companies, useful for diagnosing why frameworks get introduced and what constraints may exist.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t1_q4",
      "topic_id": "melissa-perri_t1",
      "topic_title": "Introduction and Background",
      "text": "When you look at agile methodologies, what we're really saying there is we want to be able to move quickly and deliver great value to customers. If you embrace those principles, you're going to do well.",
      "speaker": "Melissa Perri",
      "timestamp": "00:00:44",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=44s",
      "context": "Actionable guidance to focus on agile principles (speed + customer value) over rigid process adherence.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t1_q5",
      "topic_id": "melissa-perri_t1",
      "topic_title": "Introduction and Background",
      "text": "I was doing a deep dive on the job market in tech, and I saw something that was really surprising to me that the product owner role was the third-fastest growing role in tech, and this was just in the US, the data I was looking at, but I think it's probably true broadly.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:02:21",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=141s",
      "context": "A concrete job-market data point that motivates why understanding product owners and related frameworks matters right now.",
      "insight_type": "data"
    },
    {
      "quote_id": "melissa-perri_t2_q1",
      "topic_id": "melissa-perri_t2",
      "topic_title": "Sponsor Break",
      "text": "Tired of bouncing around multiple tools to uncover what's really happening inside your product? With all the tools you need in one simple to use platform, Pendo makes it easy to answer critical questions about how users are engaging with your product, and then turn those insights into action.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:03:43",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=223s",
      "context": "Highlights an actionable workflow: consolidate tooling to understand user behavior and convert insights into product changes.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t2_q2",
      "topic_id": "melissa-perri_t2",
      "topic_title": "Sponsor Break",
      "text": "We just launched OneSchema FileFeeds, which allows you to build an integration with any system in 15 minutes as long as you can export a CSV to an SFTP folder.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:05:31",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=331s",
      "context": "Provides a concrete methodology and time-bound claim for rapidly integrating via CSV-to-SFTP as a universal interface.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t2_q3",
      "topic_id": "melissa-perri_t2",
      "topic_title": "Sponsor Break",
      "text": "We allow our customers to offer thousands of integrations without involving their engineering team at all.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:05:31",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=331s",
      "context": "A counterintuitive operating model: scaling integrations without engineering involvement, freeing roadmap capacity.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t2_q4",
      "topic_id": "melissa-perri_t2",
      "topic_title": "Sponsor Break",
      "text": "We've heard so many horror stories of multi-day outages from even just a handful of ad records.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:06:05",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=365s",
      "context": "A vivid example underscoring how small data issues can cascade into major reliability incidents.",
      "insight_type": "story"
    },
    {
      "quote_id": "melissa-perri_t2_q5",
      "topic_id": "melissa-perri_t2",
      "topic_title": "Sponsor Break",
      "text": "We have a built-in validation layer that stops any bad data from entering your system, and OneSchema will notify your team immediately of any data that looks incorrect.",
      "speaker": "Christina Gilbert",
      "timestamp": "00:06:05",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=365s",
      "context": "Actionable reliability practice: prevent bad data at the boundary and alert quickly to reduce downstream damage.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t3_q1",
      "topic_id": "melissa-perri_t3",
      "topic_title": "Melissa’s experience with agile transformations",
      "text": "At the time, the person who was teaching me about agile was very like, \"Hey, this is flexible. We're just going to break things into sprints. We're going to sit there and actually talk about the work. This is made for us to actually get better at our jobs.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:06:46",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=406s",
      "context": "Highlights an agile-first mental model: treat Scrum as a tool for learning and improving work, not a rigid process.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t3_q2",
      "topic_id": "melissa-perri_t3",
      "topic_title": "Melissa’s experience with agile transformations",
      "text": "What I found was that there was a really big misconception about what those people should be doing compared to what they teach in agile and Scrum versus what we all consider great product management.",
      "speaker": "Melissa Perri",
      "timestamp": "00:09:20",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=560s",
      "context": "Calls out the core gap practitioners must address: Scrum “product ownership” often diverges from end-to-end product management responsibilities.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t3_q3",
      "topic_id": "melissa-perri_t3",
      "topic_title": "Melissa’s experience with agile transformations",
      "text": "Then I would go to their leaders and at the beginning of these agile transformations, I'd be like, \"You can't just do Scrum. That's not going to make you amazing at delivering products. There's so much more to this.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:09:20",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=560s",
      "context": "Actionable advice for transformation leaders: process adoption alone won’t improve product outcomes without broader product management capability.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t3_q4",
      "topic_id": "melissa-perri_t3",
      "topic_title": "Melissa’s experience with agile transformations",
      "text": "Capital One is a great example that took their agile transformation and started adding product management on it, and they've really turned that around in the card business.",
      "speaker": "Melissa Perri",
      "timestamp": "00:09:51",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=591s",
      "context": "Provides a concrete example of what works: pairing agile transformation with product management to drive business results.",
      "insight_type": "data"
    },
    {
      "quote_id": "melissa-perri_t4_q1",
      "topic_id": "melissa-perri_t4",
      "topic_title": "Origins of product owner role in Scrum",
      "text": "Where that role came from is Scrum. If we go back and talk about the history of agile, agile was a movement that got started by software developers.",
      "speaker": "Melissa Perri",
      "timestamp": "00:11:31",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=691s",
      "context": "Reframes the product owner role as a developer-led construct, which helps practitioners avoid assuming it equals modern product management.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t4_q2",
      "topic_id": "melissa-perri_t4",
      "topic_title": "Origins of product owner role in Scrum",
      "text": "The premise to remember this is, and I keep saying it, but they're all software developers. Nobody was a product manager who went to that meeting. Nobody who wrote the Agile Manifesto was actually a product manager.",
      "speaker": "Melissa Perri",
      "timestamp": "00:12:51",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=771s",
      "context": "A key historical constraint that explains why agile role definitions often under-specify discovery, strategy, and market/customer research.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t4_q3",
      "topic_id": "melissa-perri_t4",
      "topic_title": "Origins of product owner role in Scrum",
      "text": "They're trying to break it down into small chunks and build things instead of what they had been doing in a lot of companies, which was building stuff for three years and then releasing it in a big bang.",
      "speaker": "Melissa Perri",
      "timestamp": "00:14:48",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=888s",
      "context": "A concrete example practitioners can use to justify shorter cycles and incremental delivery to reduce risk and increase learning.",
      "insight_type": "story"
    },
    {
      "quote_id": "melissa-perri_t4_q4",
      "topic_id": "melissa-perri_t4",
      "topic_title": "Origins of product owner role in Scrum",
      "text": "it says that the product owner is responsible for maximizing the value of work done, the team does the work. Interesting, because now the product owner is not quite part of the team.",
      "speaker": "Melissa Perri",
      "timestamp": "00:15:57",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=957s",
      "context": "Highlights an inherent role ambiguity that can cause misalignment unless teams explicitly define decision rights and collaboration boundaries.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t4_q5",
      "topic_id": "melissa-perri_t4",
      "topic_title": "Origins of product owner role in Scrum",
      "text": "It's like, \"Oh, by the way, the product owner in Scrum doesn't need to be a product manager, it could be the customer, it could be a developer.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:17:01",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1021s",
      "context": "Challenges the common assumption that PO training should mirror product management, suggesting organizations must intentionally add missing PM capabilities.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t5_q1",
      "topic_id": "melissa-perri_t5",
      "topic_title": "When frameworks help vs hinder startups",
      "text": "Some of them do it fine, they understand that it's just more about trying to get things out the door every two weeks to test it with customers.",
      "speaker": "Melissa Perri",
      "timestamp": "00:22:36",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1356s",
      "context": "Reframes Scrum as a lightweight mechanism for rapid customer feedback rather than ceremony compliance.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t5_q2",
      "topic_id": "melissa-perri_t5",
      "topic_title": "When frameworks help vs hinder startups",
      "text": "When we were doing Scrum, when I did it with my team back in OpenSky, we got to this point where we were like, \"Two weeks is too long. We're just going to ship things every week.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:22:36",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1356s",
      "context": "Concrete example of adapting cadence to increase shipping frequency instead of sticking to a default sprint length.",
      "insight_type": "story"
    },
    {
      "quote_id": "melissa-perri_t5_q3",
      "topic_id": "melissa-perri_t5",
      "topic_title": "When frameworks help vs hinder startups",
      "text": "If you're not doing that, that's where I think things like a framework help, but if you already are doing that, you don't need a framework, you don't need Scrum, you don't need to be prescribed to this two-week sprint or anything like that.",
      "speaker": "Melissa Perri",
      "timestamp": "00:23:12",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1392s",
      "context": "Decision rule: frameworks are scaffolding for missing collaboration/clarity, not a requirement for high-functioning teams.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t5_q4",
      "topic_id": "melissa-perri_t5",
      "topic_title": "When frameworks help vs hinder startups",
      "text": "As long as you have a way of working that gets things out to customers, well, who cares? Who actually cares?",
      "speaker": "Melissa Perri",
      "timestamp": "00:23:52",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1432s",
      "context": "Prioritizes outcomes (shipping to customers) over adherence to named methodologies.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t5_q5",
      "topic_id": "melissa-perri_t5",
      "topic_title": "When frameworks help vs hinder startups",
      "text": "Agree, but a lot of people aren't doing it and that's the piece where you go and you say, \"Is this serving us? If not, let's get rid of it. Let's not do those types of things.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:24:28",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1468s",
      "context": "Applies the inspect-and-adapt principle to cut process overhead that isn’t delivering value.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t6_q1",
      "topic_id": "melissa-perri_t6",
      "topic_title": "What SAFe is and why it spread",
      "text": "There's a lot, there's actually a lot out there, but SAFe was one that was marketed the best.",
      "speaker": "Melissa Perri",
      "timestamp": "00:26:37",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1597s",
      "context": "Highlights that adoption of frameworks in enterprises can be driven more by packaging and marketing than technical superiority—useful when evaluating or pitching process change.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t6_q2",
      "topic_id": "melissa-perri_t6",
      "topic_title": "What SAFe is and why it spread",
      "text": "The executives at really large enterprises, we're talking tens of thousands of people, they love SAFe because it prescribes a lot of an operating model of what to do when it comes to development, but it also gets billed as like, \"Hey, this is the whole model for you to go do software.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:27:22",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1642s",
      "context": "Explains why SAFe spreads: executives value prescriptive operating models and end-to-end “whole model” narratives, which can shape how you position change initiatives.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t6_q3",
      "topic_id": "melissa-perri_t6",
      "topic_title": "What SAFe is and why it spread",
      "text": "If you look at it, it's a big map that everybody kind of makes fun of a little bit, and it describes all different things on it if you look at the map.",
      "speaker": "Melissa Perri",
      "timestamp": "00:27:22",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1642s",
      "context": "A memorable mental model for SAFe’s appeal: a comprehensive “map” that promises clarity and completeness, even if it’s overly complex.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t6_q4",
      "topic_id": "melissa-perri_t6",
      "topic_title": "What SAFe is and why it spread",
      "text": "I came in to train their product managers, I'm doing my training, we're setting them up on how to go talk to customers, talk about hypotheses, MVP, and somebody came up to me and they said, \"Hey, Melissa, all of this is great, but I don't have time to go talk to customers because I'm a product owner.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:28:10",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1690s",
      "context": "Concrete example of how the “product owner” role can become execution-focused, crowding out discovery work like customer conversations and hypothesis testing.",
      "insight_type": "story"
    },
    {
      "quote_id": "melissa-perri_t6_q5",
      "topic_id": "melissa-perri_t6",
      "topic_title": "What SAFe is and why it spread",
      "text": "\"I got to write my user stories.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:28:10",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1690s",
      "context": "Captures the day-to-day trap that can redefine product work as backlog production rather than customer learning—useful for diagnosing role and process dysfunction.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t7_q1",
      "topic_id": "melissa-perri_t7",
      "topic_title": "SAFe in practice: PO/PM split and planning",
      "text": "I do know a lot of people who worked on SAFe, so I know a lot of trainers and I've worked with companies. The first time I was introduced to SAFe was when I was working with a bank back in 2015. I came in to train their product managers, I'm doing my training, we're setting them up on how to go talk to customers, talk about hypotheses, MVP, and somebody came up to me and they said, \"Hey, Melissa, all of this is great, but I don't have time to go talk to customers because I'm a product owner.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:28:10",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1690s",
      "context": "A concrete example of how SAFe implementations can push POs away from customer discovery and into purely tactical work.",
      "insight_type": "story"
    },
    {
      "quote_id": "melissa-perri_t7_q2",
      "topic_id": "melissa-perri_t7",
      "topic_title": "SAFe in practice: PO/PM split and planning",
      "text": "I was reorganized into a team where I became the product owner. I have a product manager who goes and talks to customers, but then she comes and she tells me what to build, and then I write the user stories around it and I put it into the backlog for the teams.",
      "speaker": "Melissa Perri",
      "timestamp": "00:28:53",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1733s",
      "context": "Captures the PO/PM split as an “order-taker” dynamic that can degrade product thinking and autonomy.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t7_q3",
      "topic_id": "melissa-perri_t7",
      "topic_title": "SAFe in practice: PO/PM split and planning",
      "text": "They ask me, \"When am I supposed to do discovery?\" I'm like, \"Well before that ideally you should have a vision. You should be breaking it down, you should be putting discovery into that vision, talking to customers, feeding that in there.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:31:47",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1907s",
      "context": "Actionable guidance: discovery should be explicitly planned as part of the vision before quarterly commitments and sprint execution.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t7_q4",
      "topic_id": "melissa-perri_t7",
      "topic_title": "SAFe in practice: PO/PM split and planning",
      "text": "I guarantee you there's a ton of tech debt they could be working on. You don't have to scope that out. Let them choose what's the most important thing. They should be working together as developers and architects to figure out how to tackle some of that tech debt, how to get into it while you're figuring out is this the right thing to be building.",
      "speaker": "Melissa Perri",
      "timestamp": "00:32:32",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=1952s",
      "context": "A practical alternative to “keep developers busy with features”: use slack for tech debt and empower engineers to prioritize it.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t7_q5",
      "topic_id": "melissa-perri_t7",
      "topic_title": "SAFe in practice: PO/PM split and planning",
      "text": "What I've seen that doesn't work here is that you're basically making these product owners order-takers. They are extremely tactical, and then when it's time to actually be more strategic, let's say you want to be promoted to a product manager, some organizations, that's not even the same business line, not even the same career path.",
      "speaker": "Melissa Perri",
      "timestamp": "00:33:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2038s",
      "context": "Highlights an organizational anti-pattern where the SAFe role split can trap POs in tactical execution and block strategic growth.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t8_q1",
      "topic_id": "melissa-perri_t8",
      "topic_title": "Why SAFe can create order-takers and dependency",
      "text": "How all of that cycle works together where you're balancing discovery and delivery and feeding it in is really confusing in organizations.",
      "speaker": "Melissa Perri",
      "timestamp": "00:33:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2038s",
      "context": "Highlights a core operational gap: teams need an explicit, integrated loop between discovery and delivery rather than disconnected artifacts.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t8_q2",
      "topic_id": "melissa-perri_t8",
      "topic_title": "Why SAFe can create order-takers and dependency",
      "text": "What I've seen that doesn't work here is that you're basically making these product owners order-takers.",
      "speaker": "Melissa Perri",
      "timestamp": "00:33:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2038s",
      "context": "A contrarian warning that certain SAFe implementations can structurally reduce POs to tactical execution instead of empowered product leadership.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t8_q3",
      "topic_id": "melissa-perri_t8",
      "topic_title": "Why SAFe can create order-takers and dependency",
      "text": "They are extremely tactical, and then when it's time to actually be more strategic, let's say you want to be promoted to a product manager, some organizations, that's not even the same business line, not even the same career path.",
      "speaker": "Melissa Perri",
      "timestamp": "00:33:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2038s",
      "context": "Points to a career-path anti-pattern where role design blocks strategic skill development and mobility from PO to PM.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t8_q4",
      "topic_id": "melissa-perri_t8",
      "topic_title": "Why SAFe can create order-takers and dependency",
      "text": "If you ever want to move from product owner to product manager, a lot of times you don't get experience with the strategy, figuring out what customers want, breaking it down, looking at the market research, determining is this valuable, is this what we should be working on.",
      "speaker": "Melissa Perri",
      "timestamp": "00:34:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2098s",
      "context": "Actionable diagnostic for leaders: ensure POs get exposure to customer/market/value work if you expect them to grow into PM roles.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t8_q5",
      "topic_id": "melissa-perri_t8",
      "topic_title": "Why SAFe can create order-takers and dependency",
      "text": "They're not even getting exposure or a chance to do that because SAFe is like, \"No, that's the product manager's job. Your job is to go really deep and work with the developers.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:34:58",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2098s",
      "context": "Captures the mechanism behind the problem—role boundaries that prevent POs from participating in discovery and strategy.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t9_q1",
      "topic_id": "melissa-perri_t9",
      "topic_title": "Why executives buy SAFe and what happens next",
      "text": "I know a ton of companies that adopted SAFe about eight years ago and have gotten rid of it. Capital One just came out and said they got rid of all their agile roles, all their Scrum roles. They were early adopter of SAFe, they don't do it anymore. They wrote about that in the newspaper.",
      "speaker": "Melissa Perri",
      "timestamp": "00:35:59",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2159s",
      "context": "Concrete example that even prominent early adopters may later remove SAFe and related roles entirely.",
      "insight_type": "data"
    },
    {
      "quote_id": "melissa-perri_t9_q2",
      "topic_id": "melissa-perri_t9",
      "topic_title": "Why executives buy SAFe and what happens next",
      "text": "It's for what you said, executives buy SAFe because it's the only framework out there that basically draws them a map and says, \"Plug and play, do this.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:36:50",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2210s",
      "context": "Explains the core adoption driver: SAFe sells certainty and a prescriptive “map” to leaders who feel lost.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t9_q3",
      "topic_id": "melissa-perri_t9",
      "topic_title": "Why executives buy SAFe and what happens next",
      "text": "The problem is it's only solving a little bit of the puzzle, which is bringing those teams together.",
      "speaker": "Melissa Perri",
      "timestamp": "00:37:33",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2253s",
      "context": "A useful diagnostic: SAFe may coordinate teams but won’t solve broader leadership/strategy gaps.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t9_q4",
      "topic_id": "melissa-perri_t9",
      "topic_title": "Why executives buy SAFe and what happens next",
      "text": "SAFe doesn't even have that in there, that's not even a role.",
      "speaker": "Melissa Perri",
      "timestamp": "00:38:23",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2303s",
      "context": "Highlights a key structural omission: SAFe under-specifies senior product leadership responsibilities.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t9_q5",
      "topic_id": "melissa-perri_t9",
      "topic_title": "Why executives buy SAFe and what happens next",
      "text": "A lot of organizations who adopt SAFe don't realize that you need a head of product, you need somebody to actually be feeding that vision all the way down and make sure it's breaking up around the teams and controlling that portfolio vision and doing all of these things into it.",
      "speaker": "Melissa Perri",
      "timestamp": "00:39:12",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2352s",
      "context": "Actionable org-design takeaway: without a clear product leader owning vision/portfolio, process frameworks won’t fill the gap.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t10_q1",
      "topic_id": "melissa-perri_t10",
      "topic_title": "How to approach digital transformation more effectively",
      "text": "When I've worked with companies on digital transformations, you want a development operating model. That's where a lot of these agile methodologies came out of. You have to understand that's just the development operating model, that's not actually going to help you with go-to-market, with launching your products and with product management.",
      "speaker": "Melissa Perri",
      "timestamp": "00:41:33",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2493s",
      "context": "Reframes agile as only one slice of transformation, pushing leaders to address go-to-market and product management explicitly.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t10_q2",
      "topic_id": "melissa-perri_t10",
      "topic_title": "How to approach digital transformation more effectively",
      "text": "What I advise for companies to do is first sit down and say, \"Hey, how do we think about building our operating model?\" When I think of product operating models and what I do with companies is we break out how do you determine product strategy? Do you have a good product strategy? You look at your organizational design. How are we actually organized around our products? Do we have good coverage of product managers and do we have skilled product managers up and down the organization?",
      "speaker": "Melissa Perri",
      "timestamp": "00:41:33",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2493s",
      "context": "Provides a concrete operating-model checklist: product strategy, org design, and PM coverage/skill as transformation building blocks.",
      "insight_type": "framework"
    },
    {
      "quote_id": "melissa-perri_t10_q3",
      "topic_id": "melissa-perri_t10",
      "topic_title": "How to approach digital transformation more effectively",
      "text": "Then we want to look at product operations. Do we have the infrastructure in there to help support these teams? Can they get the data to make decisions? Can they actually be in touch with customers?",
      "speaker": "Melissa Perri",
      "timestamp": "00:42:20",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2540s",
      "context": "Turns “do discovery” into an actionable enablement question about access to data and customers via product ops infrastructure.",
      "insight_type": "advice"
    },
    {
      "quote_id": "melissa-perri_t10_q4",
      "topic_id": "melissa-perri_t10",
      "topic_title": "How to approach digital transformation more effectively",
      "text": "I don't think processes are the enemy here. For example, if I hear somebody really worried about getting a roadmapping tool in there or something like that, I'm like, \"Yes, you need that because you have no idea what your 4,000 teams are doing.\"",
      "speaker": "Melissa Perri",
      "timestamp": "00:43:50",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2630s",
      "context": "Counterintuitively argues that at scale, process/tooling can be essential to transparency and coordination (e.g., “4,000 teams”).",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "melissa-perri_t10_q5",
      "topic_id": "melissa-perri_t10",
      "topic_title": "How to approach digital transformation more effectively",
      "text": "You have to have the transparency to actually see those things.",
      "speaker": "Melissa Perri",
      "timestamp": "00:43:50",
      "youtube_link": "https://www.youtube.com/watch?v=wbi9chsAHp4&t=2630s",
      "context": "Distills a core transformation requirement: visibility into work and its linkage to business goals.",
      "insight_type": "advice"
    }
  ]
}