{
  "episode_id": "nickey-skarstad",
  "quotes": [
    {
      "quote_id": "nickey-skarstad_t1_q1",
      "topic_id": "nickey-skarstad_t1",
      "topic_title": "Introduction and Background",
      "text": "In our conversation, we cover how to set vision, translate that into goals, and then how to execute on it, making your strategy actionable, and keeping your teams aligned and focused, designing your product review sessions, how to maintain product quality, and what skills have most contributed to her success in her career.",
      "speaker": "Lenny",
      "timestamp": "00:00:31",
      "youtube_link": "",
      "context": "A concise, practitioner-oriented checklist of the execution topics the episode will break down (vision→goals→execution, alignment, reviews, quality).",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t1_q2",
      "topic_id": "nickey-skarstad_t1",
      "topic_title": "Introduction and Background",
      "text": "And relying on gut feeling is a really expensive way to find out if you're heading in the right direction, especially when you're raising money.",
      "speaker": "Lenny",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "A counterpoint to intuition-led product building, emphasizing the cost of not validating direction with data.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t1_q3",
      "topic_id": "nickey-skarstad_t1",
      "topic_title": "Introduction and Background",
      "text": "Because VCs don't want to pay the price for these kinds of mistakes.",
      "speaker": "Lenny",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "A practical fundraising lens on why evidence-based decision-making matters: investor tolerance for avoidable uncertainty is low.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t1_q4",
      "topic_id": "nickey-skarstad_t1",
      "topic_title": "Introduction and Background",
      "text": "That's why Mixpanel will give you $50,000 in credits when you join their startup program.",
      "speaker": "Lenny",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "A concrete data point that could be immediately useful for startups looking to fund analytics infrastructure.",
      "insight_type": "data"
    },
    {
      "quote_id": "nickey-skarstad_t2_q1",
      "topic_id": "nickey-skarstad_t2",
      "topic_title": "Sponsor Break",
      "text": "And relying on gut feeling is a really expensive way to find out if you're heading in the right direction, especially when you're raising money.",
      "speaker": "Sponsor (Mixpanel read)",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "Highlights the practical risk of intuition-led product decisions and the need for analytics to validate direction.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t2_q2",
      "topic_id": "nickey-skarstad_t2",
      "topic_title": "Sponsor Break",
      "text": "Because VCs don't want to pay the price for these kinds of mistakes.",
      "speaker": "Sponsor (Mixpanel read)",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "A pointed reminder that fundraising raises the bar for evidence-based decision-making.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t2_q3",
      "topic_id": "nickey-skarstad_t2",
      "topic_title": "Sponsor Break",
      "text": "That's why Mixpanel will give you $50,000 in credits when you join their startup program.",
      "speaker": "Sponsor (Mixpanel read)",
      "timestamp": "00:01:02",
      "youtube_link": "",
      "context": "A concrete data point practitioners can act on if they need analytics tooling early on.",
      "insight_type": "data"
    },
    {
      "quote_id": "nickey-skarstad_t2_q4",
      "topic_id": "nickey-skarstad_t2",
      "topic_title": "Sponsor Break",
      "text": "So many product managers are basically treated like project managers.",
      "speaker": "Sponsor (Dovetail read)",
      "timestamp": "00:02:02",
      "youtube_link": "",
      "context": "Calls out a common org anti-pattern that can help PMs diagnose why they’re not doing strategic product work.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t2_q5",
      "topic_id": "nickey-skarstad_t2",
      "topic_title": "Sponsor Break",
      "text": "Because Dovetail gets that the true heart of product management is understanding what customers want, why they want it, and how to give it to them.",
      "speaker": "Sponsor (Dovetail read)",
      "timestamp": "00:02:02",
      "youtube_link": "",
      "context": "A crisp mental model for PM work that emphasizes customer understanding as the core job.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t3_q1",
      "topic_id": "nickey-skarstad_t3",
      "topic_title": "How Nickey got into product at Etsy",
      "text": "And I actually joined them on their community team. So I worked as a forums moderator, and then as a seller education specialist.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:03:48",
      "youtube_link": "",
      "context": "Shows a non-traditional entry path into product via customer-facing community roles that build deep user empathy.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t3_q2",
      "topic_id": "nickey-skarstad_t3",
      "topic_title": "How Nickey got into product at Etsy",
      "text": "And then through that process became sort of one of the internal voices that had a really good understanding of how their customer, one of their core customers, their sellers, were actually using their product.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:04:38",
      "youtube_link": "",
      "context": "Highlights a practical way to become influential in product: be the internal expert on real customer behavior and needs.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t3_q3",
      "topic_id": "nickey-skarstad_t3",
      "topic_title": "How Nickey got into product at Etsy",
      "text": "Was like, \"Hey, Nickey, you're in all these product meetings. Have you thought about being a product manager?\"",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:04:38",
      "youtube_link": "",
      "context": "Illustrates that proximity to product work (being in the meetings) can be a stepping-stone into a PM role.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t3_q4",
      "topic_id": "nickey-skarstad_t3",
      "topic_title": "How Nickey got into product at Etsy",
      "text": "And at the time I was like, \"Oh God, no. Never.\" I was like, \"No. Technology what? Engineering? I'd have to work with engineers? I know nothing about engineering.\" And so I was very imposter syndrome-y about it.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:04:38",
      "youtube_link": "",
      "context": "A counterintuitive reminder that you can start in product without an engineering background, despite imposter syndrome.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t3_q5",
      "topic_id": "nickey-skarstad_t3",
      "topic_title": "How Nickey got into product at Etsy",
      "text": "And so I tried it. And I started as an APM.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:04:59",
      "youtube_link": "",
      "context": "Offers an actionable entry tactic: use an APM role as a low-risk on-ramp to product management.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t4_q1",
      "topic_id": "nickey-skarstad_t4",
      "topic_title": "Airbnb Experiences: marketplace complexity and PMF",
      "text": "You have this constant balancing of both buyer and seller sides or both sides of the marketplace.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:05:29",
      "youtube_link": "",
      "context": "Highlights the core operating challenge (and skill) of marketplace PM work: continuously managing two-sided tradeoffs.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t4_q2",
      "topic_id": "nickey-skarstad_t4",
      "topic_title": "Airbnb Experiences: marketplace complexity and PMF",
      "text": "So I was the first boots on the ground product manager, and really helped that team figure out how do we get product market fit? And then how do we start to think about how to scale it,",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:06:18",
      "youtube_link": "",
      "context": "A concrete example of the PM’s role post-launch: drive PMF first, then shift to scaling considerations.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t4_q3",
      "topic_id": "nickey-skarstad_t4",
      "topic_title": "Airbnb Experiences: marketplace complexity and PMF",
      "text": "part of it is building the digital experience that someone will interact with when they're booking an Airbnb experience. And the other part is actually influencing the live event experience that you will experience when you actually join an event or an experience.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:06:18",
      "youtube_link": "",
      "context": "A useful mental model for “online-to-offline” products: you must design both the booking flow and the real-world delivery.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t4_q4",
      "topic_id": "nickey-skarstad_t4",
      "topic_title": "Airbnb Experiences: marketplace complexity and PMF",
      "text": "it's not just influencing the digital product, but it's actually the consumer experience when their boots around the ground. And that is another layer of complexity.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:06:52",
      "youtube_link": "",
      "context": "Counterintuitive reminder that product quality can depend on real-world execution beyond the app, adding complexity to PM scope.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t5_q1",
      "topic_id": "nickey-skarstad_t5",
      "topic_title": "Operationalizing product quality with metrics and dogfooding",
      "text": "And Airbnb does not ship product if it is not good. And even if they're trying new things, they are obsessed with the end consumer experience.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:07:39",
      "youtube_link": "",
      "context": "Sets a clear quality bar as a shipping gate, emphasizing customer experience over speed.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t5_q2",
      "topic_id": "nickey-skarstad_t5",
      "topic_title": "Operationalizing product quality with metrics and dogfooding",
      "text": "One of the things Airbnb did for experiences is we had this balancing metric, which was basically using the review rate as sort our end all, be all top line goal.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:08:40",
      "youtube_link": "",
      "context": "Introduces a concrete “balancing metric” approach to keep growth from overpowering quality.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t5_q3",
      "topic_id": "nickey-skarstad_t5",
      "topic_title": "Operationalizing product quality with metrics and dogfooding",
      "text": "And so especially if you are building early product, really thinking about how can you pick some good quality metrics that might actually balance or conflate with growth metrics, and use that as sort of your north star because it really helped the whole team to understand what they were actually trying to do at the end of the day.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:09:08",
      "youtube_link": "",
      "context": "Actionable guidance for early teams: choose quality metrics that counterbalance growth and align everyone.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t5_q4",
      "topic_id": "nickey-skarstad_t5",
      "topic_title": "Operationalizing product quality with metrics and dogfooding",
      "text": "So a big part of that was actually operational, which was just making sure that hosts who weren't meeting those specific rigorous standards. There was a lot of coaching and education that was happening. Some of that was in the product and some of it wasn't.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:09:53",
      "youtube_link": "",
      "context": "Highlights that product quality often depends on operational levers (standards, coaching), not just product changes.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t5_q5",
      "topic_id": "nickey-skarstad_t5",
      "topic_title": "Operationalizing product quality with metrics and dogfooding",
      "text": "Another thing we did a lot on the experiences team is we just dogfooded all the time.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:10:33",
      "youtube_link": "",
      "context": "A practical methodology for surfacing real customer experience issues quickly through firsthand usage.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t6_q1",
      "topic_id": "nickey-skarstad_t6",
      "topic_title": "Quality metrics beyond growth: Etsy onboarding example",
      "text": "So we started and we went down that path. And then we realized we actually tanked a couple of downstream metrics that we didn't really understand at first. And those metrics were basically getting sellers to a first sale. So we opened up a lot of shops, but they actually weren't successful when they were on the platform, and they weren't successful in a certain amount of time.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:12:03",
      "youtube_link": "",
      "context": "Highlights the common trap of optimizing an upstream growth metric (shop creation) that harms the downstream success metric that actually matters (first sale).",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t6_q2",
      "topic_id": "nickey-skarstad_t6",
      "topic_title": "Quality metrics beyond growth: Etsy onboarding example",
      "text": "When Etsy sellers are opening their shop, it's really important that you get them a sale right away because it's a huge motivator, right? If you make a sale in your first day, you're like, \"Oh wow. Okay, this is a thing. I could make money doing this. This is exciting. I get to ship something to my buyer.\" If it takes you seven days, you start to be like, \"Oh no. I'm not good enough. I'm terrible at this.\" 10 days, into 30 days, it really impacts people.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:12:37",
      "youtube_link": "",
      "context": "Gives a concrete behavioral rationale for why “time-to-first-success” is a powerful quality metric tied to motivation and retention.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t6_q3",
      "topic_id": "nickey-skarstad_t6",
      "topic_title": "Quality metrics beyond growth: Etsy onboarding example",
      "text": "And so we actually put more friction in the onboarding flow to help to start to solve for that. So we actually slowed you down. We made you be more thoughtful about what you were listing. And by doing that, we actually helped you get to a first sale faster.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:13:06",
      "youtube_link": "",
      "context": "Counterintuitive tactic: adding onboarding friction can improve outcomes by increasing readiness/quality, accelerating real success.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t6_q4",
      "topic_id": "nickey-skarstad_t6",
      "topic_title": "Quality metrics beyond growth: Etsy onboarding example",
      "text": "But it mattered because, again, it's sort of like you think about these things a bit as a seesaw, right? We basically were balancing our growth with making sure people were successful. And the more equilibrium you had there, the better it was for their overarching marketplace.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:13:45",
      "youtube_link": "",
      "context": "Provides a memorable “seesaw/equilibrium” mental model for balancing growth metrics with quality/success metrics in a marketplace.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t6_q5",
      "topic_id": "nickey-skarstad_t6",
      "topic_title": "Quality metrics beyond growth: Etsy onboarding example",
      "text": "We only counted listings that had one booking as new supply. Everything else didn't really count. Because we knew that if it got booked at least once, at least it's got some level of quality and people want that place, and it's valuable to the marketplace.",
      "speaker": "Lenny",
      "timestamp": "00:14:14",
      "youtube_link": "",
      "context": "A specific example of redefining a growth metric to bake in quality (count only supply that proves demand via a first booking).",
      "insight_type": "data"
    },
    {
      "quote_id": "nickey-skarstad_t7_q1",
      "topic_id": "nickey-skarstad_t7",
      "topic_title": "Post-Airbnb roles: startup lessons, Shopify mismatch, Duolingo",
      "text": "So I actually spent a year hiring a team and then had to lay them off, which was a great lesson in leadership. I'm not going to lie. I learned a lot about how to lead in that experience.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:15:49",
      "youtube_link": "",
      "context": "A concrete example of leadership learning under extreme conditions (building then dismantling a team) that many leaders may face during downturns.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t7_q2",
      "topic_id": "nickey-skarstad_t7",
      "topic_title": "Post-Airbnb roles: startup lessons, Shopify mismatch, Duolingo",
      "text": "And I realized that, honestly, pretty quickly after I took the role, I was like, oh, good to know. I didn't really understand what this job was and now I know what it is, but it does not give me energy.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:16:20",
      "youtube_link": "",
      "context": "Highlights an actionable self-diagnostic: quickly assess whether the day-to-day work of a role energizes you once you truly understand it.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t7_q3",
      "topic_id": "nickey-skarstad_t7",
      "topic_title": "Post-Airbnb roles: startup lessons, Shopify mismatch, Duolingo",
      "text": "And so I felt like I had a lot of red energy every day. And so I made a call pretty quickly to bounce, which was actually another good learning experience.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:16:20",
      "youtube_link": "",
      "context": "A memorable heuristic (“red energy”) for recognizing sustained misfit and acting decisively rather than waiting it out.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t7_q4",
      "topic_id": "nickey-skarstad_t7",
      "topic_title": "Post-Airbnb roles: startup lessons, Shopify mismatch, Duolingo",
      "text": "I think I've gotten a lot. As I've advanced through my career, have learned a lot about what gives me Nickey Skarstad energy and have been really prioritizing that, especially in a post-COVID world.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:16:20",
      "youtube_link": "",
      "context": "Encourages a counterintuitive career strategy: optimize for personal energy drivers (fit) as a primary decision criterion, not just prestige or scope.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t7_q5",
      "topic_id": "nickey-skarstad_t7",
      "topic_title": "Post-Airbnb roles: startup lessons, Shopify mismatch, Duolingo",
      "text": "And in the process of helping them kind of think through a zero to one product challenge, something that's newer. Can't really talk about it unfortunately, but has been another sort of product market fit thinking exercise.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:16:46",
      "youtube_link": "",
      "context": "Frames “zero to one” work as repeated product-market-fit exercises—useful for practitioners choosing roles that build PMF muscles.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t8_q1",
      "topic_id": "nickey-skarstad_t8",
      "topic_title": "How to know a role isn’t a fit",
      "text": "One of the things I did when I was like, I don't know if I love this is I actually went through my calendar and I changed the colors of all of the meetings on my calendar to red, yellow, and green after I had the meeting.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:17:37",
      "youtube_link": "",
      "context": "A concrete, repeatable diagnostic technique for assessing role fit using your actual day-to-day energy signals.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t8_q2",
      "topic_id": "nickey-skarstad_t8",
      "topic_title": "How to know a role isn’t a fit",
      "text": "And basically if it was yellow, I was like, okay. It was a fine meeting. My energy was baseline. If it was red, I was either bored or I was stressed, or I was not having a good time. And if it was green, it gave me energy and I felt excited and I wanted to keep working on that.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:17:37",
      "youtube_link": "",
      "context": "Defines a simple energy-based rubric practitioners can apply immediately to categorize work and spot patterns.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t8_q3",
      "topic_id": "nickey-skarstad_t8",
      "topic_title": "How to know a role isn’t a fit",
      "text": "And when I looked back at the last few weeks, it was almost all red and yellow. And I was like, okay, this is really from an energy standpoint, I don't think I love this.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:18:17",
      "youtube_link": "",
      "context": "Shows how the method yields a clear signal over time, turning vague dissatisfaction into evidence.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t8_q4",
      "topic_id": "nickey-skarstad_t8",
      "topic_title": "How to know a role isn’t a fit",
      "text": "Get really good at figuring out what are the things that you love most about being a product person, and how can you optimize your next role for those things that you love?",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:18:17",
      "youtube_link": "",
      "context": "Actionable career advice: explicitly identify your highest-energy PM activities and choose roles to maximize them.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t8_q5",
      "topic_id": "nickey-skarstad_t8",
      "topic_title": "How to know a role isn’t a fit",
      "text": "And the day to day of your job as a product manager, depending on where you go in the product that you're building, is very different.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:18:39",
      "youtube_link": "",
      "context": "A reminder that “PM” varies widely by org/product area, so fit depends on the actual daily work, not the title.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t9_q1",
      "topic_id": "nickey-skarstad_t9",
      "topic_title": "Product org structures: functional vs GM models",
      "text": "So I think there's kind of two overarching popular organizational modes for product org specifically. There's either the functional organization where everyone in the product team will report up through either a VP product, or a chief product officer, or something along those lines.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:22:07",
      "youtube_link": "",
      "context": "Introduces a clear two-model framework (functional vs GM) for thinking about product org structure.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t9_q2",
      "topic_id": "nickey-skarstad_t9",
      "topic_title": "Product org structures: functional vs GM models",
      "text": "I think in bigger organizations that really works well, especially when you have orgs that need a lot of development in the function. So you'll have a lot of either APMs or product managers who are newer in their career and need a lot of support in development.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:22:07",
      "youtube_link": "",
      "context": "Actionable guidance on when functional orgs are especially effective: scaling craft and developing junior PM talent.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t9_q3",
      "topic_id": "nickey-skarstad_t9",
      "topic_title": "Product org structures: functional vs GM models",
      "text": "And I actually think that really worked for team like experiences at a company like Airbnb because what it did is it gave the leader of that business a ton of autonomy to really figure out what does this business need to be successful?",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:23:00",
      "youtube_link": "",
      "context": "Explains the core benefit of a GM model for new bets: concentrated autonomy to tailor resources and execution.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t9_q4",
      "topic_id": "nickey-skarstad_t9",
      "topic_title": "Product org structures: functional vs GM models",
      "text": "And I actually think that had they launched experiences inside of the Etsy style of organizational structure, it never would've succeeded because it had such a unique business need, and it needed its own process and ways of building product, et cetera.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:23:44",
      "youtube_link": "",
      "context": "A counterintuitive claim that the “wrong” org structure can doom a new initiative even inside a strong company.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t9_q5",
      "topic_id": "nickey-skarstad_t9",
      "topic_title": "Product org structures: functional vs GM models",
      "text": "So I honestly don't think there's a right way. I know that's a non-answer. I think it really depends on what you're trying to build and the stage at which you're at.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:24:14",
      "youtube_link": "",
      "context": "Reinforces a context-dependent decision rule rather than a one-size-fits-all org-structure prescription.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t10_q1",
      "topic_id": "nickey-skarstad_t10",
      "topic_title": "Sponsor Break",
      "text": "Something I learned at Airbnb and from many other companies at this point is there's never going to be the one right way to structure, and companies bounce back and forth between them.",
      "speaker": "Lenny",
      "timestamp": "00:26:54",
      "youtube_link": "",
      "context": "A contrarian org-design takeaway: treat structure as iterative rather than searching for a single “correct” model.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t10_q2",
      "topic_id": "nickey-skarstad_t10",
      "topic_title": "Sponsor Break",
      "text": "Like Airbnb, for example, has moved from GM model to functional reporting lines back to GM.",
      "speaker": "Lenny",
      "timestamp": "00:26:54",
      "youtube_link": "",
      "context": "A concrete example of a company deliberately cycling between org models as needs change.",
      "insight_type": "story"
    },
    {
      "quote_id": "nickey-skarstad_t10_q3",
      "topic_id": "nickey-skarstad_t10",
      "topic_title": "Sponsor Break",
      "text": "And so things change and you try some, see how it goes, adjust, optimize for the biggest opportunity. And then you'll probably change it six months later.",
      "speaker": "Lenny",
      "timestamp": "00:26:54",
      "youtube_link": "",
      "context": "An actionable operating approach for leaders: run org structure as an experiment loop and re-optimize frequently.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t10_q4",
      "topic_id": "nickey-skarstad_t10",
      "topic_title": "Sponsor Break",
      "text": "Embedding banking into your product, not only adds differentiation, but also helps you acquire, retain and monetize your customers.",
      "speaker": "Lenny",
      "timestamp": "00:25:52",
      "youtube_link": "",
      "context": "A product strategy claim linking embedded fintech to core growth levers (acquisition, retention, monetization).",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t11_q1",
      "topic_id": "nickey-skarstad_t11",
      "topic_title": "Setting vision and translating it into goals",
      "text": "I've seen a lot of director level people through my career who will try to work on strategy in a vacuum alone. They'll write a document and they'll be like, \"Okay, team. Here's what we're doing. Here's our strategy.\" And it never goes well.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:27:51",
      "youtube_link": "",
      "context": "Warns against solo strategy creation and highlights why buy-in fails without team involvement.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t11_q2",
      "topic_id": "nickey-skarstad_t11",
      "topic_title": "Setting vision and translating it into goals",
      "text": "And I think there are ways to do that where you're not voting on strategy. You should not be voting. I think good product work is often not democratic, right? You need a clear leader who understands a lot of the signals and understands the larger competitive marketplace that can make decisions.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:28:40",
      "youtube_link": "",
      "context": "A contrarian stance on collaboration: involve people for input, but keep clear decision ownership.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t11_q3",
      "topic_id": "nickey-skarstad_t11",
      "topic_title": "Setting vision and translating it into goals",
      "text": "And then kind of zooming down into the weeds, I really like the vision mission strategy pyramid.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:29:51",
      "youtube_link": "",
      "context": "Introduces a simple framework for translating long-term direction into near-term goals.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t11_q4",
      "topic_id": "nickey-skarstad_t11",
      "topic_title": "Setting vision and translating it into goals",
      "text": "Good brainstorm are often cross-functional. So go outside of your own team. Can you pull in somebody from marketing? Can somebody from the larger policy team sit in?",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:32:05",
      "youtube_link": "",
      "context": "Practical guidance for making vision-setting sessions stronger by widening perspectives beyond product/engineering.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t11_q5",
      "topic_id": "nickey-skarstad_t11",
      "topic_title": "Setting vision and translating it into goals",
      "text": "So I would pre-fill out the Miro beforehand. So figure out what are the things you want to discuss with your team, create them as headers in the Miro document. So when everyone lands in there, you have a very clear here's what we're talking about today.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:32:44",
      "youtube_link": "",
      "context": "Concrete tactic for running effective remote strategy workshops with structure and prompts prepared in advance.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t12_q1",
      "topic_id": "nickey-skarstad_t12",
      "topic_title": "Decision-making, alignment, and one-way vs two-way doors",
      "text": "OKR frameworks might not be the best for every single team, but having some sort of goal framework that is shared across functions is useful no matter the size or the scale of your business.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:37:23",
      "youtube_link": "",
      "context": "A pragmatic reminder to prioritize cross-functional alignment via a shared goal-setting process, even if you don’t use “pure” OKRs.",
      "insight_type": "advice"
    },
    {
      "quote_id": "nickey-skarstad_t12_q2",
      "topic_id": "nickey-skarstad_t12",
      "topic_title": "Decision-making, alignment, and one-way vs two-way doors",
      "text": "But you should have some sort of framework that's shared from a process standpoint across your team that everyone can use and work on together.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:37:23",
      "youtube_link": "",
      "context": "Emphasizes that the real value is a common operating system for planning, not the specific OKR mechanics.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t12_q3",
      "topic_id": "nickey-skarstad_t12",
      "topic_title": "Decision-making, alignment, and one-way vs two-way doors",
      "text": "And a lot of it, I think, especially because he's an FBI person, I thought it was going to be very much, \"You're going to do this.\" And it's all basically his whole approach is empathy, and it's repeating things back to you, making people feel heard, making sure that you're hearing why they maybe don't like your strategy, or why they think that's a bad OKR.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:38:43",
      "youtube_link": "",
      "context": "A counterintuitive influence tactic: negotiation and alignment come from empathy and active listening, not forcefulness.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "nickey-skarstad_t12_q4",
      "topic_id": "nickey-skarstad_t12",
      "topic_title": "Decision-making, alignment, and one-way vs two-way doors",
      "text": "And the other thing is I love the concept of one way versus two way door decision making, right?",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:39:28",
      "youtube_link": "",
      "context": "Introduces a simple decision taxonomy teams can use to calibrate rigor, speed, and autonomy.",
      "insight_type": "framework"
    },
    {
      "quote_id": "nickey-skarstad_t12_q5",
      "topic_id": "nickey-skarstad_t12",
      "topic_title": "Decision-making, alignment, and one-way vs two-way doors",
      "text": "If it is a two-way door decision, it's not going to make a huge impact, you can change it later if you need to, let your team cruise on those things.",
      "speaker": "Nickey Skarstad",
      "timestamp": "00:39:28",
      "youtube_link": "",
      "context": "Actionable guidance for moving faster by delegating reversible decisions and reserving debate for irreversible ones.",
      "insight_type": "advice"
    }
  ]
}