{
  "episode_id": "pete-kazanjy",
  "quotes": [
    {
      "quote_id": "pete-kazanjy_t1_q1",
      "topic_id": "pete-kazanjy_t1",
      "topic_title": "Introduction and Background",
      "text": "The thing that I just like to encourage founders and product managers and what have you is just don't be afraid of sales.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=0s",
      "context": "A direct mindset shift for builders who avoid sales, framing it as a learnable part of the job rather than something to fear.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t1_q2",
      "topic_id": "pete-kazanjy_t1",
      "topic_title": "Introduction and Background",
      "text": "There's a lot of people out there who would love to tell you a story that it's magical or like, \"Oh, you've got to be a born seller,\" things like that and it's really not.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=0s",
      "context": "Challenges the common belief that sales is innate, implying founders can build sales skill through practice.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t1_q3",
      "topic_id": "pete-kazanjy_t1",
      "topic_title": "Introduction and Background",
      "text": "Those people are just talking their book, if you will, and so just getting good at those behaviors, it's going to benefit you in a myriad of ways.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=0s",
      "context": "Reframes sales as a set of behaviors founders can deliberately improve, with broad downstream benefits beyond closing deals.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t1_q4",
      "topic_id": "pete-kazanjy_t1",
      "topic_title": "Introduction and Background",
      "text": "In our conversation, we focus on three things. One, why founders should be doing sales themselves for a long time before hiring your first salesperson and also when it's time to hire that first salesperson, we get into how to hire for your first salesperson, what to look for in their profile and the most common mistakes people make, and finally, we cover a bunch of tactical tips for getting better at sales.",
      "speaker": "Lenny",
      "timestamp": "00:00:26",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=26s",
      "context": "A practical roadmap of the episode’s key levers: founder-led selling, timing and criteria for the first hire, and concrete tactics to improve.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t1_q5",
      "topic_id": "pete-kazanjy_t1",
      "topic_title": "Introduction and Background",
      "text": "Pete didn't come from a sales background and he learned everything by just doing it, learning, researching, and repeating.",
      "speaker": "Lenny",
      "timestamp": "00:00:26",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=26s",
      "context": "A repeatable learning methodology for founders: iterate through action, study, and repetition to build sales competence from scratch.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t2_q1",
      "topic_id": "pete-kazanjy_t2",
      "topic_title": "Sponsor Break",
      "text": "SOC 2 can either open the door for bigger and better deals or it can put your business on hold. If you don't have a SOC 2, there's a good chance you won't even get a seat at the table.",
      "speaker": "Lenny",
      "timestamp": "00:01:28",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=88s",
      "context": "Highlights SOC 2 as a gating factor for enterprise sales and deal progression, not just a compliance checkbox.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t2_q2",
      "topic_id": "pete-kazanjy_t2",
      "topic_title": "Sponsor Break",
      "text": "Over 3,000 fast growing companies use Vanta to automate up to 90% of the work involved with SOC 2.",
      "speaker": "Lenny",
      "timestamp": "00:02:14",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=134s",
      "context": "Provides a concrete adoption and efficiency data point that quantifies the potential leverage of automation for compliance work.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t2_q3",
      "topic_id": "pete-kazanjy_t2",
      "topic_title": "Sponsor Break",
      "text": "Well, based on our data, about a third of people will consider switching to another company after just one bad experience during onboarding.",
      "speaker": "Ashley Mulligan",
      "timestamp": "00:02:58",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=178s",
      "context": "Quantifies how sensitive retention is to onboarding quality, making onboarding reliability a high-ROI investment area.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t2_q4",
      "topic_id": "pete-kazanjy_t2",
      "topic_title": "Sponsor Break",
      "text": "I've consistently seen that improving onboarding as one of the highest leverage opportunities for both signup conversion and increasing long-term retention. Getting people to their aha moment more quickly and reliably is so incredibly important.",
      "speaker": "Lenny",
      "timestamp": "00:03:17",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=197s",
      "context": "Frames onboarding as a leverage point and introduces the practical goal of accelerating the user's “aha moment.”",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t2_q5",
      "topic_id": "pete-kazanjy_t2",
      "topic_title": "Sponsor Break",
      "text": "It's because flawless data onboarding acts like a catalyst to get them and their customers where they need to go faster.",
      "speaker": "Ashley Mulligan",
      "timestamp": "00:03:32",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=212s",
      "context": "Offers a memorable mental model—treat data onboarding as a catalyst that speeds time-to-value for customers.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t3_q1",
      "topic_id": "pete-kazanjy_t3",
      "topic_title": "Pete and Lenny origin story",
      "text": "The quick story was Lenny had shipped his different genres of marketplaces and how to start the liquidity and growth and whatever and I was obsessed with it, and then somehow, I ran into you at Brianne Kimmel's SaaS School.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:04:20",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=260s",
      "context": "Highlights a concrete example of how publishing specific, high-signal content can create serendipitous connections and opportunities in the real world.",
      "insight_type": "story"
    },
    {
      "quote_id": "pete-kazanjy_t3_q2",
      "topic_id": "pete-kazanjy_t3",
      "topic_title": "Pete and Lenny origin story",
      "text": "I gave a presentation on Founder-led Selling and there was a scrum of people around me and I was talking about amazing writers and amazing content online and I referenced the series, and then you raised your hand and you were like, \"That was me,\" and I was like, \"What? You're amazing.\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:04:20",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=260s",
      "context": "Shows a repeatable tactic: use talks and public references to great work as a networking catalyst that can surface the creators behind it.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t3_q3",
      "topic_id": "pete-kazanjy_t3",
      "topic_title": "Pete and Lenny origin story",
      "text": "And then you encouraged me to make a book out of that post, which I have not yet done, maybe one day.",
      "speaker": "Lenny",
      "timestamp": "00:04:53",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=293s",
      "context": "Suggests an actionable content strategy: expand a strong post into a book to compound its impact and reach.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t4_q1",
      "topic_id": "pete-kazanjy_t4",
      "topic_title": "Pete’s background and learning sales",
      "text": "We quickly realized that, \"Man, this B2B software stuff doesn't sell itself, irrespective of maybe what people say on the internet,\" at least back then.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:05:14",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=314s",
      "context": "A contrarian reminder for founders that product-led narratives don’t eliminate the need for deliberate selling in B2B.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t4_q2",
      "topic_id": "pete-kazanjy_t4",
      "topic_title": "Pete’s background and learning sales",
      "text": "So, I had to be our first seller, our sales manager, our first sales leader, and that's where I learned how to do sales.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:05:14",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=314s",
      "context": "Highlights the actionable path of founder-led sales as the fastest way to build early sales capability and learn the motion firsthand.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t4_q3",
      "topic_id": "pete-kazanjy_t4",
      "topic_title": "Pete’s background and learning sales",
      "text": "Also, I just realized, \"Man, this isn't rocket surgery, anyone can learn this. If I can learn this, other people can learn this, even though there's not documentation on it.\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:06:02",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=362s",
      "context": "A simple mental model that demystifies sales and encourages founders to treat it as a learnable craft rather than innate talent.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t4_q4",
      "topic_id": "pete-kazanjy_t4",
      "topic_title": "Pete’s background and learning sales",
      "text": "Mainly, it was the book that I wish I had, rather than having to learn by a narrative from the first round capital portfolio and what have you.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:06:02",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=362s",
      "context": "Points to the practical need for documented, repeatable sales learning instead of relying on ad-hoc advice and secondhand stories.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t4_q5",
      "topic_id": "pete-kazanjy_t4",
      "topic_title": "Pete’s background and learning sales",
      "text": "And then subsequent to that, I started what became the nation's largest sales operations and leadership community, it's called Modern Sales Pros. It's 30,000 sales operations, sales leaders, et cetera.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:06:02",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=362s",
      "context": "A concrete data point illustrating the scale of the modern sales ops/leadership ecosystem and the value of community-driven learning.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t5_q1",
      "topic_id": "pete-kazanjy_t5",
      "topic_title": "Modern sales versus old-school sales",
      "text": "whereas the way to think about what sellers are is they're the microeconomic agents in the market that bring supply to demand rather than waiting for demand to find supply.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:07:25",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=445s",
      "context": "Reframes sales as a market-making function (matching supply to demand) rather than persuasion, giving practitioners a clearer mental model for what “good sales” is.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t5_q2",
      "topic_id": "pete-kazanjy_t5",
      "topic_title": "Modern sales versus old-school sales",
      "text": "They have supply in their back pocket and they run around trying to find people who ought to have the demand, maybe they have the demand right now, maybe they don't realize that they have the demand, and then they elucidate to them why they ought to have the demand.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:07:25",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=445s",
      "context": "Actionable description of prospecting and value articulation: find latent demand and make it explicit.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t5_q3",
      "topic_id": "pete-kazanjy_t5",
      "topic_title": "Modern sales versus old-school sales",
      "text": "it's very measurable, especially in a modern environment with modern CRMs and also all the digital activity that we do, email, calendar, phone, Zoom, et cetera, all this information is now being recorded such that you can then measure, manage, and improve behavior.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:08:08",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=488s",
      "context": "Highlights the modern-sales advantage: instrument the sales process via “digital exhaust” to systematically improve performance.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t5_q4",
      "topic_id": "pete-kazanjy_t5",
      "topic_title": "Modern sales versus old-school sales",
      "text": "So, modern sales is a more thoughtful, operational, rigorous, analytical bent, it's been around for a while. It's one of those things, the future is here, it just wasn't widely distributed, but now it's being much more distributed and much more embraced.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:08:08",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=488s",
      "context": "Counterintuitive point that “modern sales” isn’t new—what’s changing is adoption and distribution of rigorous methods.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t5_q5",
      "topic_id": "pete-kazanjy_t5",
      "topic_title": "Modern sales versus old-school sales",
      "text": "Like the pre-Moneyball moment in sports and baseball to the post-Moneyball moment, we're now just flipping over there, so that's the delta.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:08:08",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=488s",
      "context": "Memorable analogy that frames the shift as moving from intuition-driven selling to analytics-driven operations.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t6_q1",
      "topic_id": "pete-kazanjy_t6",
      "topic_title": "Why founders must lead early sales",
      "text": "It's a loop, where the minimum viable version of your product is probably going to suck and then in order to get to the minimum valuable step, you've got to be interfacing with a lot of customers and that's a sales behavior, getting in front of people and being like, \"Hey, I think you probably have this problem if you look like these other folks right here.\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:10:26",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=626s",
      "context": "Frames early go-to-market as an iterative loop from MVP to “minimum valuable” that requires direct customer-facing selling to learn and refine.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t6_q2",
      "topic_id": "pete-kazanjy_t6",
      "topic_title": "Why founders must lead early sales",
      "text": "The point is is that you can't outsource that behavior, the founder's got to do that stuff.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:11:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=671s",
      "context": "A blunt rule-of-thumb: founders must personally do early selling to preserve learning and momentum.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t6_q3",
      "topic_id": "pete-kazanjy_t6",
      "topic_title": "Why founders must lead early sales",
      "text": "Startups versus incumbents is a race between can innovation get to distribution before distribution can get to innovation?",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:11:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=671s",
      "context": "A memorable mental model for why distribution (sales) is existentially urgent, not something to “add later.”",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t6_q4",
      "topic_id": "pete-kazanjy_t6",
      "topic_title": "Why founders must lead early sales",
      "text": "It's going to be easier for you to do that than it is for some third party to become as expert at the subject matter that you're tackling that you are.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:11:58",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=718s",
      "context": "Counterintuitive argument: it’s often faster for founders to learn “minimally viable selling” than to train a salesperson up to founder-level domain expertise.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t6_q5",
      "topic_id": "pete-kazanjy_t6",
      "topic_title": "Why founders must lead early sales",
      "text": "You lose that feedback loop, you lose the learnings of whether or not your message fits the market, all that sort of stuff. You're playing a game of telephone with that with a third party seller versus even you just want to keep that in one brain to start, then package it, and then when you have a repeatable while loop, a selling while loop, then package it and hand it to someone else.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:12:46",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=766s",
      "context": "Explains the mechanism of failure when outsourcing sales too early and gives a concrete sequencing: keep it in one brain → make it repeatable → package and delegate.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t7_q1",
      "topic_id": "pete-kazanjy_t7",
      "topic_title": "When to hire the first salesperson",
      "text": "So, generally speaking, it is to contingent on your sales motion, but it's going to be that you can reliably, at a pretty okay win rate, so maybe 15% or 20% or 25%, turn first meetings into eventual customers and do that in a reliable fashion.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:15:10",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=910s",
      "context": "Gives a concrete win-rate threshold as a heuristic for when founder-led sales is repeatable enough to hire the first salesperson.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t7_q2",
      "topic_id": "pete-kazanjy_t7",
      "topic_title": "When to hire the first salesperson",
      "text": "Take 50 at-bats, take 100 at-bats, and now that you know that you reliably, for every cohort of ten first meetings, what's known in sales land as opportunities, for every cohort of 10 that you engage, are you closing 1, are you closing 1.5, are you closing 2, or are you closing 2.5, if you're in there?",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:16:08",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=968s",
      "context": "Introduces a “statistical significance” bar (50–100 at-bats) and a cohort-based way to measure repeatability before scaling sales hiring.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t7_q3",
      "topic_id": "pete-kazanjy_t7",
      "topic_title": "When to hire the first salesperson",
      "text": "What we're going to do is we're going to take the information out of Lenny's brain and we're going to put it into slides and we're going to put it into scripts and we're going to put it into email templates and all that sort of stuff, and then we're going to shove that into the brain of two more reps and see if now we can get it to run in the cloud, in the sales cloud here.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:16:54",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1014s",
      "context": "A memorable “package the motion” methodology: codify founder knowledge into enablement assets and test whether it transfers to new reps.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t7_q4",
      "topic_id": "pete-kazanjy_t7",
      "topic_title": "When to hire the first salesperson",
      "text": "Essentially, there's a bunch of stages in the B2B maturity journey and you have to go through them in order to get to the next one, if you jump stages, you're hosed.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:17:39",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1059s",
      "context": "A contrarian warning that scaling sales is stage-gated; skipping steps (like hiring too early) can break the go-to-market motion.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t7_q5",
      "topic_id": "pete-kazanjy_t7",
      "topic_title": "When to hire the first salesperson",
      "text": "Then, the next thing to do is get at least a couple people reliably selling, as well as you, not 10, because you're never going to get 2 successful if you're trying to onboard 10 concurrently. And then if you get those 2 successful, now you've earned the right to go to 4, 8, et cetera.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:17:39",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1059s",
      "context": "Actionable scaling rule: prove onboarding with 2 reps before expanding headcount (2→4→8) to avoid dilution and failure.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t8_q1",
      "topic_id": "pete-kazanjy_t8",
      "topic_title": "Iterating the sales motion like software",
      "text": "you want to bring on cohorts of users and then see what's going on, then learn, and then bring on new co cohorts of users.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:18:39",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1119s",
      "context": "A practical methodology for running sales like product experiments—batch learning cycles instead of one big push.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t8_q2",
      "topic_id": "pete-kazanjy_t8",
      "topic_title": "Iterating the sales motion like software",
      "text": "So, going and doing 100 at-bats and then being like, \"Did it work or did it not?\" Versus, \"Hey, let's have 10 for prospect and try to get 10 first meetings,\" have all those interactions, see how your conversations land, see how the discovery questions are evoking the right response or not the right response, see how your slides land, see how your demo lands, all that sort of stuff.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:18:39",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1119s",
      "context": "Concrete guidance to iterate in smaller cohorts and evaluate each part of the funnel (discovery, slides, demo) before scaling outreach.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t8_q3",
      "topic_id": "pete-kazanjy_t8",
      "topic_title": "Iterating the sales motion like software",
      "text": "One helpful way to think about it is kind of like software and what you want to be doing is constantly updating it.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:19:15",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1155s",
      "context": "A memorable mental model: treat your sales motion as an updatable system rather than a fixed script.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t8_q4",
      "topic_id": "pete-kazanjy_t8",
      "topic_title": "Iterating the sales motion like software",
      "text": "So, I'm going to do that and then I'm going to update the source code. Now, my sales motion has been updated.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:20:04",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1204s",
      "context": "Actionable iteration loop: convert objections into collateral/talk track updates like committing code changes.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t8_q5",
      "topic_id": "pete-kazanjy_t8",
      "topic_title": "Iterating the sales motion like software",
      "text": "You're just going to do that dozens and dozens and dozens and dozens and dozens of time before you have a repeatable sales motion.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:20:04",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1204s",
      "context": "Sets expectations that repeatability comes from many iteration cycles, not a one-and-done playbook.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t9_q1",
      "topic_id": "pete-kazanjy_t9",
      "topic_title": "Leading indicators: stage conversions and second dates",
      "text": "So, what are the leading indicators of success? Because if you're only looking at lagging indicators, again, it's probably a it's a funnel on a new feature, so the opportunity is an at-bat or a potential transaction, and so usually what you do is you model out the stages in your opportunity.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:21:13",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1273s",
      "context": "Frames sales improvement as tracking leading indicators by explicitly modeling opportunity stages rather than waiting for wins.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t9_q2",
      "topic_id": "pete-kazanjy_t9",
      "topic_title": "Leading indicators: stage conversions and second dates",
      "text": "So, the more sophisticated version of this is looking at stage conversions, what have you, the less sophisticated version of it, which early on, I think is an appropriate way of doing it, is like, \"Hey, man, are we getting second dates?\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:22:08",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1328s",
      "context": "Offers a simple early-stage heuristic (“second dates”) as a practical proxy for stage-to-stage conversion health.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t9_q3",
      "topic_id": "pete-kazanjy_t9",
      "topic_title": "Leading indicators: stage conversions and second dates",
      "text": "So, what we want to do is we want to say, \"Great, of all of our ten first meetings, how many gets to second meetings?\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:22:51",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1371s",
      "context": "Gives a concrete leading-indicator metric practitioners can track immediately: first-to-second meeting conversion.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t9_q4",
      "topic_id": "pete-kazanjy_t9",
      "topic_title": "Leading indicators: stage conversions and second dates",
      "text": "It would be great, the lagging indicator is 2 wins out of 10 or what have you, but I'm going to come into these conversations and out of my ten first meetings, I want seven of them to get to the second meeting.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:22:51",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1371s",
      "context": "Demonstrates setting explicit conversion targets upstream of wins to diagnose and improve the funnel earlier.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t9_q5",
      "topic_id": "pete-kazanjy_t9",
      "topic_title": "Leading indicators: stage conversions and second dates",
      "text": "Your message is not landing, you're targeting the wrong people, what's going on here? You need to think about it.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:22:51",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1371s",
      "context": "Connects poor stage progression to actionable root-cause areas (messaging and targeting) for rapid iteration.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t10_q1",
      "topic_id": "pete-kazanjy_t10",
      "topic_title": "Do PLG companies still need sales?",
      "text": "I would say you don't have to get good at it, you just have to get non-zero at it.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:24:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1451s",
      "context": "A practical bar for founders: you don’t need to be a sales expert, but you must develop baseline sales competence.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t10_q2",
      "topic_id": "pete-kazanjy_t10",
      "topic_title": "Do PLG companies still need sales?",
      "text": "So, the way that I try to succinctly describe that is never mistake your lead gen for your business.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:25:48",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1548s",
      "context": "A memorable mental model warning PLG teams not to confuse top-of-funnel adoption with scalable revenue mechanics.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t10_q3",
      "topic_id": "pete-kazanjy_t10",
      "topic_title": "Do PLG companies still need sales?",
      "text": "Because it turns out that people paying 19 bucks a month or 29 bucks a month or what have you is really great, but getting to a $50,000 or a $100,000 or a $250,000 contract, that's where big ARR numbers start racking up, and organizations want to talk to a human in order to navigate that.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:26:34",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1594s",
      "context": "A concrete expansion rationale: enterprise-sized contracts require human-led sales even if initial adoption is self-serve.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t10_q4",
      "topic_id": "pete-kazanjy_t10",
      "topic_title": "Do PLG companies still need sales?",
      "text": "What you're doing is you're solving the problem that the user has, but the problem is the user doesn't necessarily have large budgetary authority, so you can get them stoked up, but then you've got to talk to the person who's got the purse strings, and so that's going to require sales.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:26:34",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1594s",
      "context": "A clear buyer/user distinction framework explaining why bottoms-up adoption still needs sales to reach budget owners.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t10_q5",
      "topic_id": "pete-kazanjy_t10",
      "topic_title": "Do PLG companies still need sales?",
      "text": "I would say that's the case. It's more of a question of when versus if, so even the really famous ones like Atlassian.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:27:20",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1640s",
      "context": "A contrarian generalization: nearly all B2B companies eventually need sales—timing is the real strategic choice.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t11_q1",
      "topic_id": "pete-kazanjy_t11",
      "topic_title": "How to get better at sales: mindset and practice",
      "text": "You're in the starting blocks on the track. You're in the starting blocks and you have 90 seconds or a couple minutes to form rapport, to make somebody feel like they should trust you and they want to be honest with you.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:29:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1751s",
      "context": "Highlights the time-boxed reality of early sales interactions and the need to deliberately practice fast trust-building.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t11_q2",
      "topic_id": "pete-kazanjy_t11",
      "topic_title": "How to get better at sales: mindset and practice",
      "text": "Salespeople have manager schedules, interestingly enough, where what you're doing is you're constantly contact switching, an ideal salesperson's calendar or a founder who's doing sales is 2, 3, 4, maybe 5 customer-facing meetings a day with different humans.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:29:52",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1792s",
      "context": "Provides a concrete operating model for founder-led sales and reframes sales as high-frequency context switching rather than deep work.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t11_q3",
      "topic_id": "pete-kazanjy_t11",
      "topic_title": "How to get better at sales: mindset and practice",
      "text": "So, one, just recognizing it's going to be a pretty big mindset change, and then the second thing you can do is then once you know that there's going to be a mindset change, is you can focus in on making those behaviors be better.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:30:43",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1843s",
      "context": "Gives a simple two-step improvement approach: accept the mindset shift, then intentionally train the specific behaviors sales requires.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t11_q4",
      "topic_id": "pete-kazanjy_t11",
      "topic_title": "How to get better at sales: mindset and practice",
      "text": "So, as an example, one of the things I challenge my staff to do is I call it turbo rapport, it needs a better name.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:30:43",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1843s",
      "context": "Introduces a named practice (“turbo rapport”) that can be trained as a repeatable skill for prospect conversations.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t11_q5",
      "topic_id": "pete-kazanjy_t11",
      "topic_title": "How to get better at sales: mindset and practice",
      "text": "My friend, Brett Burson, had this great tweet one at one point where he said, \"Think about the things that you do in your day-to-day that are like a pianist, like a piano player, playing scales like, 'Da, da, da, da, da, da.' What is the version of that for selling?\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:31:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1891s",
      "context": "Offers a memorable mental model for sales mastery: identify and rehearse “scales” (core micro-skills) until they become automatic.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t12_q1",
      "topic_id": "pete-kazanjy_t12",
      "topic_title": "Sponsor Break",
      "text": "Merge's Unified API can remove this blocker from your roadmap.",
      "speaker": "Lenny",
      "timestamp": "00:32:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1951s",
      "context": "A crisp mental model for treating integrations as a roadmap blocker you can eliminate with a platform approach.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t12_q2",
      "topic_id": "pete-kazanjy_t12",
      "topic_title": "Sponsor Break",
      "text": "With one API, your team can add over 150 HR, ATS, accounting, ticketing, and CRM integrations right into your product.",
      "speaker": "Lenny",
      "timestamp": "00:32:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1951s",
      "context": "A concrete scope/data point that quantifies the leverage of a unified integrations layer.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t12_q3",
      "topic_id": "pete-kazanjy_t12",
      "topic_title": "Sponsor Break",
      "text": "You can get your first integration into production in a matter of days and save countless weeks building custom integrations, letting you get back to building your core product.",
      "speaker": "Lenny",
      "timestamp": "00:32:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1951s",
      "context": "Actionable value proposition framed in time-to-production and opportunity cost (core product focus).",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t12_q4",
      "topic_id": "pete-kazanjy_t12",
      "topic_title": "Sponsor Break",
      "text": "Save your engineers countless hours and expedite your sales cycle by making integration offerings your competitive advantage with Merge.",
      "speaker": "Lenny",
      "timestamp": "00:32:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=1951s",
      "context": "A go-to-market insight: integrations aren’t just engineering work—they can directly accelerate sales and differentiation.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t12_q5",
      "topic_id": "pete-kazanjy_t12",
      "topic_title": "Sponsor Break",
      "text": "One of the things in your book that most shifted my mindset on sales was this shift from you're trying to convince someone to buy this thing to you're trying to help them and maybe this will make their life easier.",
      "speaker": "Lenny",
      "timestamp": "00:33:31",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2011s",
      "context": "A memorable reframing of sales from persuasion to customer help, pointing to a practical mindset shift.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t13_q1",
      "topic_id": "pete-kazanjy_t13",
      "topic_title": "Reframing sales as helping, not persuading",
      "text": "So, as a seller, the way that I like to frame it to people is that you're a consultant that has a particular predilection for a given solution, your solution.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:33:50",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2030s",
      "context": "Reframes selling from persuasion to consultative problem-solving anchored in your product as the preferred solution.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t13_q2",
      "topic_id": "pete-kazanjy_t13",
      "topic_title": "Reframing sales as helping, not persuading",
      "text": "Atrium's minimum ICP is probably SDRs plus AEs in an organization should probably be at 10 all the way up to 300.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:33:50",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2030s",
      "context": "Gives a concrete ICP boundary that practitioners can emulate by defining clear minimum/maximum fit criteria.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t13_q3",
      "topic_id": "pete-kazanjy_t13",
      "topic_title": "Reframing sales as helping, not persuading",
      "text": "I'll be like, \"Man, I'm not going to sell you Atrium. You're just going to be unhappy, it's going to be dumb, it's going to be a waste of our customer success resources, you're going to churn,\" all those sort of things.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:33:50",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2030s",
      "context": "Models the counterintuitive practice of disqualifying bad-fit prospects to reduce churn and protect CS capacity.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t13_q4",
      "topic_id": "pete-kazanjy_t13",
      "topic_title": "Reframing sales as helping, not persuading",
      "text": "But if instead what you're doing is you're saying, \"Hey, I'm going to go out in the market and I'm going to find the people that have a high proclivity that our technology solves and then I'm going to talk with them about how they're solving that problem right now, and ideally, through a series of questions, I'm going to reveal that to them that they're doing it probably not great.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:34:56",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2096s",
      "context": "Lays out a practical methodology: target high-fit buyers, understand current workflow, and use questions to surface gaps.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t13_q5",
      "topic_id": "pete-kazanjy_t13",
      "topic_title": "Reframing sales as helping, not persuading",
      "text": "And then once I've revealed to them the fact, through this directed questioning, what's known as discovery, that they have this high magnitude problem, that it is causing them lots of money, that it is a pain in their ass, and then I reveal to them that there is a better way of approaching it and magically enough, I happen to be a representative of that solution,\" well, now that's an ideal transaction and everybody wins.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:34:56",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2096s",
      "context": "Summarizes the discovery-led sales flow: quantify pain, make the problem undeniable, then position your solution as the better approach.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t14_q1",
      "topic_id": "pete-kazanjy_t14",
      "topic_title": "Practical next steps: rapport and ICP focus",
      "text": "The non-complicated version would just be just walking down the street, make eye contact with everybody, and then every person that you stop next to at Starbucks or the crosswalk or whatever, just strike up a conversation with them, figure out a mechanism by which you can start a conversation with them. Compliment their shirt or their shoes or remark on something. Don't use the weather, because that's lazy, but figure that out, so that's the first version.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:36:12",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2172s",
      "context": "A concrete, repeatable practice to build rapport and conversation-starting skills outside of sales contexts.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t14_q2",
      "topic_id": "pete-kazanjy_t14",
      "topic_title": "Practical next steps: rapport and ICP focus",
      "text": "Probably the more sophisticated version is just be very, very tight on your ICP, just be very, very, very crisp around who has your problem and why. Being more crisp around that and then having that understood is a great way of making sure that you're not wasting time on people who don't have your problem and that you're doing more of those loops with people who are right in the white-hot center.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:36:12",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2172s",
      "context": "A focus framework for improving sales efficiency by narrowing learning cycles to best-fit prospects.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t14_q3",
      "topic_id": "pete-kazanjy_t14",
      "topic_title": "Practical next steps: rapport and ICP focus",
      "text": "Actually, it's important to think about there's two things in a B2B sales motion, there's the characteristics of the account, which is the company that's going to buy, and then there's the characteristics of the human and the personas that you're going to be interacting with.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:37:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2231s",
      "context": "A simple mental model separating account-level fit from persona-level dynamics in B2B selling.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t14_q4",
      "topic_id": "pete-kazanjy_t14",
      "topic_title": "Practical next steps: rapport and ICP focus",
      "text": "Let's use Amplitude as an example. Amplitude's ICP would probably be organizations that make software products, that probably have at least a couple of product managers, because if there's a single product manager, it might be too much, they might be at the point where they don't need a full-blown enterprise analytics suite, and that's probably it.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:37:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2231s",
      "context": "A specific example showing how to define ICP with concrete thresholds that prevent wasted outreach.",
      "insight_type": "story"
    },
    {
      "quote_id": "pete-kazanjy_t14_q5",
      "topic_id": "pete-kazanjy_t14",
      "topic_title": "Practical next steps: rapport and ICP focus",
      "text": "Ideal customer profile is understanding what those parameters look like for looking at an organization in order to say, \"Man, that's an awesome op, let's go get in front of them,\" versus, \"Eh, I don't know if that's a very good opportunity, maybe let's pass on that,\" and then the personas are, \"Great, that's an awesome op right there. I know that I'm going to have my first conversation with Lenny, but with an intention that I'm eventually going to get to the VP of product at Airbnb, and that's Suzy over here. And then once we get validation from her, then I know that the VPE over here is Frank,\" and knowing who the personas are.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:38:18",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2298s",
      "context": "A practical methodology for qualifying opportunities and mapping the path through stakeholders to the budget owner.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t15_q1",
      "topic_id": "pete-kazanjy_t15",
      "topic_title": "Hiring early sales: avoid VP first, hire pioneers",
      "text": "Generally, what you want to do is you probably don't want to start with a VP of sales to start, a sales leader, and there's a couple of reasons why there.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:40:33",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2433s",
      "context": "Contrarian guidance on sequencing early sales hires: avoid hiring a VP of Sales first.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "pete-kazanjy_t15_q2",
      "topic_id": "pete-kazanjy_t15",
      "topic_title": "Hiring early sales: avoid VP first, hire pioneers",
      "text": "Unfortunately, there is no GitHub for sales motions, and so it's in your brain, it's in your documents, et cetera, and so now, you're going to teach these other folks.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:40:33",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2433s",
      "context": "Memorable mental model for why founders must transfer the sales motion themselves before scaling.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t15_q3",
      "topic_id": "pete-kazanjy_t15",
      "topic_title": "Hiring early sales: avoid VP first, hire pioneers",
      "text": "So, what you want to do is you want to hire a couple early-stage pioneer sellers to take that sales motion.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:40:33",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2433s",
      "context": "Actionable hiring strategy: start with 2–3 gritty AEs who can run the motion before adding leadership.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t15_q4",
      "topic_id": "pete-kazanjy_t15",
      "topic_title": "Hiring early sales: avoid VP first, hire pioneers",
      "text": "But early-stage selling takes early-stage sellers or people who have been there, because you're not going to have all the collateral, slides and scripts and whatever aren't going to be all buttoned up and with a bow around them, and so looking for those early-stage, grimier, grittier sellers is a more effective way of going about that.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:42:59",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2579s",
      "context": "Clear rationale for the profile to hire: reps who can operate without polished enablement and process.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t15_q5",
      "topic_id": "pete-kazanjy_t15",
      "topic_title": "Hiring early sales: avoid VP first, hire pioneers",
      "text": "Well, in addition to having a 25% win rate with me, I have these two sellers right here and they both have 20% win rates and you can see that they're both closing $50,000 of bookings a month, all I need you to do is scale it up.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:44:24",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2664s",
      "context": "Concrete “proof to hire a leader” benchmark: show repeatable rep success (win rates + bookings) before recruiting a head of sales.",
      "insight_type": "data"
    },
    {
      "quote_id": "pete-kazanjy_t16_q1",
      "topic_id": "pete-kazanjy_t16",
      "topic_title": "Evaluating early sales hires and ramp time",
      "text": "So, if you have done that and the person, their win rates are poor or their activity levels are poor, things like that, those are usually indicators that it's not work out, that they're not getting those second dates, they're not getting those third dates, but importantly, they have to have the materials in question.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:46:17",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2777s",
      "context": "Gives concrete early warning signals (win rate, activity, progression) while emphasizing the prerequisite of proper enablement.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t16_q2",
      "topic_id": "pete-kazanjy_t16",
      "topic_title": "Evaluating early sales hires and ramp time",
      "text": "Did you create the slide deck? Did you take people through and did you give it to them? Did you take all the discovery questions that were in your brain and write them down into a Google Doc or a Notion page or what have you? Do you have a demo script for them?",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:47:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2831s",
      "context": "A practical enablement checklist founders should complete before judging an early sales hire’s performance.",
      "insight_type": "advice"
    },
    {
      "quote_id": "pete-kazanjy_t16_q3",
      "topic_id": "pete-kazanjy_t16",
      "topic_title": "Evaluating early sales hires and ramp time",
      "text": "But if you have all those precursors and it's not sticking for someone, that's probably a good leading indicator that they're not going to work out",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:47:11",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2831s",
      "context": "Frames “with enablement in place, still not working” as an early, decision-driving leading indicator.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t16_q4",
      "topic_id": "pete-kazanjy_t16",
      "topic_title": "Evaluating early sales hires and ramp time",
      "text": "This is why it's so, so, so important to look at leading indicators.",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:47:42",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2862s",
      "context": "Highlights a core methodology for evaluating ramp: manage to leading indicators rather than waiting for closed-won outcomes.",
      "insight_type": "framework"
    },
    {
      "quote_id": "pete-kazanjy_t16_q5",
      "topic_id": "pete-kazanjy_t16",
      "topic_title": "Evaluating early sales hires and ramp time",
      "text": "So, looking at those leading indicators like, \"Are they having first meetings? Are they having second meetings? What does their email volume look like? Are they progressing things through, are they getting things to proposal, and then eventually, are things closing?\"",
      "speaker": "Pete Kazanjy",
      "timestamp": "00:47:42",
      "youtube_link": "https://www.youtube.com/watch?v=cZd5234Eem0&t=2862s",
      "context": "Provides a concrete set of measurable leading indicators to assess early sales ramp and performance.",
      "insight_type": "advice"
    }
  ]
}