{
  "episode_id": "scott-wu",
  "quotes": [
    {
      "quote_id": "scott-wu_t1_q1",
      "topic_id": "scott-wu_t1",
      "topic_title": "Introduction and Background",
      "text": "Most folks on the team are definitely working with up to five Devins at once, and so Devin merges like several hundred pull requests into production in the Devin code bases every month.",
      "speaker": "Scott Wu",
      "timestamp": "00:00:00",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=0s",
      "context": "Concrete example of how a small team operationalizes multiple AI agents per engineer to drive high PR throughput.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t1_q2",
      "topic_id": "scott-wu_t1",
      "topic_title": "Introduction and Background",
      "text": "It's in the neighborhood of a quarter or so.",
      "speaker": "Scott Wu",
      "timestamp": "00:00:16",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=16s",
      "context": "Baseline metric for current AI contribution to production code via PRs, useful for benchmarking adoption.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t1_q3",
      "topic_id": "scott-wu_t1",
      "topic_title": "Introduction and Background",
      "text": "Honestly, we expect it to be a decent bit more than half.",
      "speaker": "Scott Wu",
      "timestamp": "00:00:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=21s",
      "context": "Forward-looking target that implies a practical roadmap toward majority AI-generated PRs within a year.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t1_q4",
      "topic_id": "scott-wu_t1",
      "topic_title": "Introduction and Background",
      "text": "One of the things which is already I'd say different in AI, is just how explosive the technology can be. There's no weight on hardware distribution. It means that the space is just growing so exponentially.",
      "speaker": "Scott Wu",
      "timestamp": "00:00:28",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=28s",
      "context": "Mental model for why AI adoption can outpace prior tech shifts: software distribution without hardware bottlenecks.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t1_q5",
      "topic_id": "scott-wu_t1",
      "topic_title": "Introduction and Background",
      "text": "I think there's going to be way more programmers and way more engineers a few years from now. Pretty quickly.",
      "speaker": "Scott Wu",
      "timestamp": "00:01:05",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=65s",
      "context": "Contrarian prediction that AI tools may increase, not decrease, demand for engineers as programming becomes more accessible and important.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t2_q1",
      "topic_id": "scott-wu_t2",
      "topic_title": "Sponsor Break: Enterpret and Paragon",
      "text": "What makes Enterpret special is its ability to build and update customer specific AI models that provide the most granular and accurate insights into your business.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:03:19",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=199s",
      "context": "Highlights a practical approach for improving insight quality: using continuously updated, customer-specific models rather than generic analysis.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t2_q2",
      "topic_id": "scott-wu_t2",
      "topic_title": "Sponsor Break: Enterpret and Paragon",
      "text": "Connect customer insights to revenue and operational data in your CRM or data warehouse to map the business impact of each customer need and prioritize confidently and empower your entire team to easily take action on use cases like win-loss analysis, critical bug detection, and identifying drivers of churn with Enterpret's AI assistant Wisdom.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:03:19",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=199s",
      "context": "Provides an actionable prioritization method: tie feedback to business metrics to quantify impact and drive decisions across teams.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t2_q3",
      "topic_id": "scott-wu_t2",
      "topic_title": "Sponsor Break: Enterpret and Paragon",
      "text": "Integrations are mission-critical for AI for two reasons. First, AI products need contacts from their customer's business data such as Google Drive files, Slack messages or CRM records. Second, for AI products to automate work on behalf of users, AI agents need to be able to take action across these different third-party tools.",
      "speaker": "Brandon Foo",
      "timestamp": "00:04:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=261s",
      "context": "Offers a clear two-part framework for AI product integrations: data access (context) plus the ability to execute actions across tools.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t2_q4",
      "topic_id": "scott-wu_t2",
      "topic_title": "Sponsor Break: Enterpret and Paragon",
      "text": "We believe product teams should focus engineering efforts and competitive advantages, not integrations.",
      "speaker": "Brandon Foo",
      "timestamp": "00:05:01",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=301s",
      "context": "A counterintuitive prioritization principle: treat integrations as non-differentiating work and concentrate engineering on core advantage.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t3_q1",
      "topic_id": "scott-wu_t3",
      "topic_title": "What Devin is and how it works",
      "text": "Devin is a fully autonomous software engineer that is going to work on tasks end to end, and so there are a lot of great tools for all parts of the stack of the AI code workflow.",
      "speaker": "Scott Wu",
      "timestamp": "00:06:10",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=370s",
      "context": "Defines Devin’s core positioning as an end-to-end agent (not just a point tool) within the AI coding workflow.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t3_q2",
      "topic_id": "scott-wu_t3",
      "topic_title": "What Devin is and how it works",
      "text": "What Devin does is it is a full asynchronous workflow, and so you can tag Devin on an issue in Slack, you're talking about an issue and you tag Devin, you can tag Devin in Linear, you can have Devin and Devin will make pull requests in your GitHub, and so it's very much built to work with engineering teams as your junior engineer.",
      "speaker": "Scott Wu",
      "timestamp": "00:06:10",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=370s",
      "context": "Actionable model for adoption: integrate the agent into existing team tools (Slack/Linear/GitHub) and treat it like a junior remote engineer producing PRs.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t4_q1",
      "topic_id": "scott-wu_t4",
      "topic_title": "Devin’s evolution: capabilities and product interface",
      "text": "Sometimes we kind of say, well, when we got started it was kind of like a high school CS student and then as time went on, it became more of a college intern and now it's like a junior engineer.",
      "speaker": "Scott Wu",
      "timestamp": "00:07:02",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=422s",
      "context": "A practical “seniority ladder” mental model for setting expectations about an AI agent’s evolving capability level over time.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t4_q2",
      "topic_id": "scott-wu_t4",
      "topic_title": "Devin’s evolution: capabilities and product interface",
      "text": "But I would say though that those are more rough guidelines because I really like the phrase jagged intelligence for example, because obviously there are certain things that it is much better at than a human. There are certain things that it's much worse at than a human.",
      "speaker": "Scott Wu",
      "timestamp": "00:07:02",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=422s",
      "context": "A memorable framework (“jagged intelligence”) that encourages practitioners to design workflows around uneven strengths rather than assuming uniform competence.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t4_q3",
      "topic_id": "scott-wu_t4",
      "topic_title": "Devin’s evolution: capabilities and product interface",
      "text": "And so a lot of the things that we built, I mean, there was no Slack, there was no GitHub integration, there was no Linear, there was no interactive planning phase working back and forth. There was no way to touch up Devin's code.",
      "speaker": "Scott Wu",
      "timestamp": "00:07:52",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=472s",
      "context": "Concrete examples of workflow/product features (integrations, planning, code touch-ups) that materially improve agent usefulness beyond raw model gains.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t4_q4",
      "topic_id": "scott-wu_t4",
      "topic_title": "Devin’s evolution: capabilities and product interface",
      "text": "I think it's a 50/50 of both.",
      "speaker": "Scott Wu",
      "timestamp": "00:08:37",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=517s",
      "context": "A counterweight to “just improve the model” thinking: progress comes equally from capability improvements and interface/tooling/workflow design.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t4_q5",
      "topic_id": "scott-wu_t4",
      "topic_title": "Devin’s evolution: capabilities and product interface",
      "text": "And so it's really exciting to see a lot of others starting to build and do a lot more in the agent space as well. But I think this is the kind of thing that we're all really figuring out together as a space.",
      "speaker": "Scott Wu",
      "timestamp": "00:08:37",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=517s",
      "context": "A useful expectation-setter that agent workflows are still emergent, implying teams should iterate and learn rather than assume best practices are settled.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t5_q1",
      "topic_id": "scott-wu_t5",
      "topic_title": "Adoption and use cases across company sizes",
      "text": "So we work with companies of all stages and sizes.",
      "speaker": "Scott Wu",
      "timestamp": "00:09:24",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=564s",
      "context": "Sets the baseline that Devin is designed to be adopted across very different org contexts, not just a narrow startup tool.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t5_q2",
      "topic_id": "scott-wu_t5",
      "topic_title": "Adoption and use cases across company sizes",
      "text": "On the smallest end, it goes to startups of just one or two people who are using Devin to build out a lot of their kind of initial prototype or initial product all the way up to big public companies, Fortune 100 companies or public banks or things like that who are using Devin across their engineering teams.",
      "speaker": "Scott Wu",
      "timestamp": "00:09:24",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=564s",
      "context": "Concrete adoption range and use-case examples practitioners can map to their own company size and rollout scope.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t5_q3",
      "topic_id": "scott-wu_t5",
      "topic_title": "Adoption and use cases across company sizes",
      "text": "But throughout it's all been basically yeah, being that junior buddy of yours that makes you go faster and really multiplies you, I would say.",
      "speaker": "Scott Wu",
      "timestamp": "00:09:55",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=595s",
      "context": "A memorable mental model for positioning Devin internally: treat it like a speed-boosting junior teammate.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t5_q4",
      "topic_id": "scott-wu_t5",
      "topic_title": "Adoption and use cases across company sizes",
      "text": "I think it can multiply you as an engineer obviously by just letting you work with your own team of Devins instead of having to be kind of fully synchronous on a single task.",
      "speaker": "Scott Wu",
      "timestamp": "00:09:55",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=595s",
      "context": "Actionable workflow shift: parallelize work by delegating multiple tasks to multiple Devin instances rather than staying single-threaded.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t5_q5",
      "topic_id": "scott-wu_t5",
      "topic_title": "Adoption and use cases across company sizes",
      "text": "And then it's also kind of multiplying your team and multiplying your team's knowledge base because Devin really accumulates a lot of the knowledge from working with every member of your team and is able to bring that into each new session.",
      "speaker": "Scott Wu",
      "timestamp": "00:09:55",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=595s",
      "context": "Highlights a compounding advantage: using Devin as an institutional-memory layer that carries learnings across sessions and teammates.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t6_q1",
      "topic_id": "scott-wu_t6",
      "topic_title": "Origin story: team background and early thesis",
      "text": "when we got started, I mean I think there were a couple of things that we felt really strongly about and one was that reinforcement learning was really working and was going to be the next big paradigm shift in capabilities.",
      "speaker": "Scott Wu",
      "timestamp": "00:11:22",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=682s",
      "context": "A clear thesis-setting statement that frames RL as the next capabilities leap, useful for guiding bets in AI product/research strategy.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t6_q2",
      "topic_id": "scott-wu_t6",
      "topic_title": "Origin story: team background and early thesis",
      "text": "Back then it was the initial ChatGPT launch in 2022, and those models were, to first order were what we would call imitation learning in AI, right, which is basically you have the model read all the texts that you can find on the internet and then train it to talk like somebody on the internet would talk.",
      "speaker": "Scott Wu",
      "timestamp": "00:11:22",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=682s",
      "context": "A memorable mental model for distinguishing imitation learning from later RL-driven approaches when evaluating model/product capabilities.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t6_q3",
      "topic_id": "scott-wu_t6",
      "topic_title": "Origin story: team background and early thesis",
      "text": "I think this new paradigm which we've gotten into over this last year or year and a half is really high compute RL, which is a very different paradigm, right, which is basically the ability to go and do work on task and put something together and then be evaluated on whether that was correct or incorrect and use that knowledge to decide what to do and to learn from that.",
      "speaker": "Scott Wu",
      "timestamp": "00:12:16",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=736s",
      "context": "A practical methodology for capability gains: create tasks with evaluators (correct/incorrect) and use that feedback loop to improve behavior.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t6_q4",
      "topic_id": "scott-wu_t6",
      "topic_title": "Origin story: team background and early thesis",
      "text": "I think for us, code was the natural thing to work on for a couple reasons. One, because we're all programmer nerds ourselves, and so teaching AI to code is about as cool as it gets for us, but also because code has this whole automated feedback loop, right, where you can run the code and that is the kind of automated feedback that really feeds into the RL, which makes these models so great at coding.",
      "speaker": "Scott Wu",
      "timestamp": "00:12:16",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=736s",
      "context": "Actionable product selection criterion: pick domains with tight, automatable feedback loops to make RL and iteration dramatically more effective.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t6_q5",
      "topic_id": "scott-wu_t6",
      "topic_title": "Origin story: team background and early thesis",
      "text": "the big shift that we really felt we would see is moving from kind of this text to text model to an actual autonomous system that can make decisions, that can interact with the real world, that can take in feedback, that can iterate and take multiple steps to solve problems.",
      "speaker": "Scott Wu",
      "timestamp": "00:13:34",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=814s",
      "context": "A concise framework for “agents” as multi-step, feedback-driven autonomy—useful for designing product requirements beyond text completion.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t7_q1",
      "topic_id": "scott-wu_t7",
      "topic_title": "Hacker-house pivots and finding the agent workflow",
      "text": "We got a bunch, we booked an Airbnb basically for a couple of weeks.",
      "speaker": "Scott Wu",
      "timestamp": "00:14:34",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=874s",
      "context": "A concrete, repeatable “hacker house” method for compressing iteration cycles and building momentum early.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t7_q2",
      "topic_id": "scott-wu_t7",
      "topic_title": "Hacker-house pivots and finding the agent workflow",
      "text": "the first thing that we were building for actually was more solving these more contest programming problems and using an agentic loop to really do better on that.",
      "speaker": "Scott Wu",
      "timestamp": "00:14:34",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=874s",
      "context": "Shows a practical starting point for agent development: pick domains with tight feedback loops and measurable evaluation.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t7_q3",
      "topic_id": "scott-wu_t7",
      "topic_title": "Hacker-house pivots and finding the agent workflow",
      "text": "So after that we had another hacker house and that's where kind of some of the initial ideas for Devin came and really building a software engineering agent and not just a coding agent and having to interact with a lot of these tools,",
      "speaker": "Scott Wu",
      "timestamp": "00:15:26",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=926s",
      "context": "A useful product framing: differentiate “software engineering agent” vs “coding agent” by tool use and end-to-end workflow ownership.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t7_q4",
      "topic_id": "scott-wu_t7",
      "topic_title": "Hacker-house pivots and finding the agent workflow",
      "text": "Initially, it was just like you hand off a task and then it works and then it shows you this whole finished code. Right. And now obviously it's like you can jump in at any time, you can get feedback on the plan, you guys can scope out the task together when you're working with Devin.",
      "speaker": "Scott Wu",
      "timestamp": "00:15:26",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=926s",
      "context": "Captures a key workflow shift practitioners can apply: move from “handoff-and-return” to interactive planning and mid-course correction.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t7_q5",
      "topic_id": "scott-wu_t7",
      "topic_title": "Hacker-house pivots and finding the agent workflow",
      "text": "the grounding question for us really, which is one that we think about all the time, is really just what is the future of software engineering and how should we be working with AI to write code?",
      "speaker": "Scott Wu",
      "timestamp": "00:16:11",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=971s",
      "context": "A guiding product/strategy question teams can adopt to align day-to-day decisions with a coherent long-term model of human+AI development.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t8_q1",
      "topic_id": "scott-wu_t8",
      "topic_title": "Why personify Devin: name, onboarding, and trust",
      "text": "I think a lot of kind of explaining the Devin experience to folks is really just explain it as, yeah, this is your junior buddy.",
      "speaker": "Scott Wu",
      "timestamp": "00:17:44",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1064s",
      "context": "A simple mental model that sets user expectations for how to delegate, supervise, and collaborate with the agent.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t8_q2",
      "topic_id": "scott-wu_t8",
      "topic_title": "Why personify Devin: name, onboarding, and trust",
      "text": "And basically what we've learned over time is to basically get folks to think more like whoa, whoa, whoa, let's work on getting the repository set up first.",
      "speaker": "Scott Wu",
      "timestamp": "00:18:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1101s",
      "context": "Actionable onboarding guidance: start with environment/repo readiness before attempting big architectural changes.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t8_q3",
      "topic_id": "scott-wu_t8",
      "topic_title": "Why personify Devin: name, onboarding, and trust",
      "text": "Let's make sure we hand Devin a couple one pointer tasks so it can get familiar with the code base.",
      "speaker": "Scott Wu",
      "timestamp": "00:18:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1101s",
      "context": "A practical methodology for ramping an agent: begin with small tasks to build context and reliability.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t8_q4",
      "topic_id": "scott-wu_t8",
      "topic_title": "Why personify Devin: name, onboarding, and trust",
      "text": "Obviously we want to make sure Devin's got its own virtual machine set up to be able to do that.",
      "speaker": "Scott Wu",
      "timestamp": "00:18:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1101s",
      "context": "Concrete operational requirement: give the agent an execution environment so it can run tests/linters/CI effectively.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t8_q5",
      "topic_id": "scott-wu_t8",
      "topic_title": "Why personify Devin: name, onboarding, and trust",
      "text": "but we found that the best workflow really as a team building a lot of stuff was to work with multiple Devins and to run them asynchronously and to kick them off and to only jump in basically as you needed to provide feedback or steer the plan or anything like that.",
      "speaker": "Scott Wu",
      "timestamp": "00:18:45",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1125s",
      "context": "Counterintuitive workflow shift: treat agents as parallel, async collaborators rather than something you watch step-by-step.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t9_q1",
      "topic_id": "scott-wu_t9",
      "topic_title": "How engineering work changes with Devin today",
      "text": "And so in that lens, I really think that programming is, if anything, is only going to become more and more important as AI gets more powerful.",
      "speaker": "Scott Wu",
      "timestamp": "00:20:20",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1220s",
      "context": "A contrarian reframing that as AI improves, the human skill of precisely instructing computers becomes more—not less—valuable.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t9_q2",
      "topic_id": "scott-wu_t9",
      "topic_title": "How engineering work changes with Devin today",
      "text": "And so you ask what things look like today, and I would say, yeah, it really is like having a junior buddy or really a team of junior buddies that you can work with. Right.",
      "speaker": "Scott Wu",
      "timestamp": "00:20:20",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1220s",
      "context": "A practical mental model for integrating AI into engineering workflows: treat it like scalable junior teammates.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t9_q3",
      "topic_id": "scott-wu_t9",
      "topic_title": "How engineering work changes with Devin today",
      "text": "Devin merges several hundred pull requests into production in the Devin code bases every month, which is, I mean, our whole team is only 15 engineers, and so it's a pretty sizable fraction of all the code that we write.",
      "speaker": "Scott Wu",
      "timestamp": "00:21:12",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1272s",
      "context": "A concrete internal benchmark showing how AI can materially increase throughput even in a small engineering team.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t9_q4",
      "topic_id": "scott-wu_t9",
      "topic_title": "How engineering work changes with Devin today",
      "text": "Sometimes you want to be able to jump in for the 10 or 20% that really needs your help.",
      "speaker": "Scott Wu",
      "timestamp": "00:21:47",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1307s",
      "context": "An actionable division-of-labor heuristic: let AI execute the bulk while humans focus on the critical edge cases and judgment calls.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t9_q5",
      "topic_id": "scott-wu_t9",
      "topic_title": "How engineering work changes with Devin today",
      "text": "Yeah, I'd have to look, but it's in the neighborhood of a quarter or so of all of our-",
      "speaker": "Scott Wu",
      "timestamp": "00:22:25",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1345s",
      "context": "A specific adoption metric practitioners can use as a reference point for what “meaningful” AI contribution can look like today.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t10_q1",
      "topic_id": "scott-wu_t10",
      "topic_title": "From bricklayer to architect: future skill shifts",
      "text": "I think by the end of this year, we expect it to be more than half.",
      "speaker": "Scott Wu",
      "timestamp": "00:23:31",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1411s",
      "context": "A concrete adoption forecast practitioners can use to calibrate how quickly AI-generated code may become the majority of output in real teams.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t10_q2",
      "topic_id": "scott-wu_t10",
      "topic_title": "From bricklayer to architect: future skill shifts",
      "text": "I think the soul of programming, the soul of software engineering has really been about through all the areas, not just now, but even when it was assembly, right, and even when it was Pascal and even when it was punch cards or whatever, I think the soul of it has really been basically just about defining the problem that you're facing and really thinking through exactly...",
      "speaker": "Scott Wu",
      "timestamp": "00:23:31",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1411s",
      "context": "A durable mental model: the highest-leverage engineering work is problem definition and solution design, independent of tooling or era.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t10_q3",
      "topic_id": "scott-wu_t10",
      "topic_title": "From bricklayer to architect: future skill shifts",
      "text": "I think, at the same time, that's probably in the neighborhood of 10% of the average software engineer's time, right? Because 90% of the time is you've got this Kubernetes error, then you've got to debug, and you have to see what went wrong and the system crash, or you left some port open and this is messing up, or there's a bug report that you have to take care of, or you've got to migrate your code, or you got it upgraded to a new version or things like that.",
      "speaker": "Scott Wu",
      "timestamp": "00:24:21",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1461s",
      "context": "A counterintuitive breakdown that highlights where AI assistance can reclaim time: reducing operational/debugging toil rather than replacing core design thinking.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t10_q4",
      "topic_id": "scott-wu_t10",
      "topic_title": "From bricklayer to architect: future skill shifts",
      "text": "One of the ways that we've kind of thought about Devin in building Devin is really allowing engineers to go from bricklayer to architect, so to speak.",
      "speaker": "Scott Wu",
      "timestamp": "00:24:48",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1488s",
      "context": "A memorable framework for the skill shift: moving from manual implementation to higher-level direction, specification, and architecture.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t10_q5",
      "topic_id": "scott-wu_t10",
      "topic_title": "From bricklayer to architect: future skill shifts",
      "text": "Jevons Paradox just says that as the price of something goes down, it can still be the case that the total spend on it actually goes up.",
      "speaker": "Scott Wu",
      "timestamp": "00:29:26",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1766s",
      "context": "A useful economic lens for planning: cheaper/faster coding can increase total software built (and demand for builders) rather than reduce it.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t11_q1",
      "topic_id": "scott-wu_t11",
      "topic_title": "Jevons Paradox and why engineers may increase",
      "text": "most folks on the team are often working with up to five Devins at once, I would say.",
      "speaker": "Scott Wu",
      "timestamp": "00:30:33",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1833s",
      "context": "Concrete data point on the practical “AI agent concurrency” level per engineer in their day-to-day workflow.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t11_q2",
      "topic_id": "scott-wu_t11",
      "topic_title": "Jevons Paradox and why engineers may increase",
      "text": "It's a nice flow where you think through, \"All right, what are the five things that we want to get done today?\"",
      "speaker": "Scott Wu",
      "timestamp": "00:30:33",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1833s",
      "context": "A simple planning framework: explicitly enumerate a handful of tasks to parallelize across agents.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t11_q3",
      "topic_id": "scott-wu_t11",
      "topic_title": "Jevons Paradox and why engineers may increase",
      "text": "You have Devin one do number one, you have Devin two do number two, Devin three...",
      "speaker": "Scott Wu",
      "timestamp": "00:30:33",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1833s",
      "context": "Actionable methodology for delegating work by assigning each agent a distinct task stream.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t11_q4",
      "topic_id": "scott-wu_t11",
      "topic_title": "Jevons Paradox and why engineers may increase",
      "text": "I think it's definitely a different experience where you're handing off most things asynchronously.",
      "speaker": "Scott Wu",
      "timestamp": "00:30:33",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1833s",
      "context": "Highlights the key workflow shift practitioners should expect: managing work via asynchronous handoffs rather than synchronous pairing.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t12_q1",
      "topic_id": "scott-wu_t12",
      "topic_title": "Managing a fleet: five Devins per engineer",
      "text": "It's a nice flow where you think through, \"All right, what are the five things that we want to get done today?\" You have Devin one do number one, you have Devin two do number two, Devin three...",
      "speaker": "Scott Wu",
      "timestamp": "00:30:33",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1833s",
      "context": "A concrete daily workflow for managing multiple AI agents in parallel to maximize throughput.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t12_q2",
      "topic_id": "scott-wu_t12",
      "topic_title": "Managing a fleet: five Devins per engineer",
      "text": "The goal for each of your tasks is to be there for the parts that really need your expertise, either you really, really need to define exactly what it is that you're solving for and what you're building or maybe some of the more complex parts where you want to steer Devin towards, particularly what kinds of changes you want to make.",
      "speaker": "Scott Wu",
      "timestamp": "00:31:14",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1874s",
      "context": "Defines the human role in an agentic workflow: problem definition and high-leverage steering, not bulk implementation.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t12_q3",
      "topic_id": "scott-wu_t12",
      "topic_title": "Managing a fleet: five Devins per engineer",
      "text": "But basically having Devin do the bulk of the work asynchronously with you.",
      "speaker": "Scott Wu",
      "timestamp": "00:31:14",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1874s",
      "context": "Captures the core mental model shift from synchronous pairing to asynchronous delegation.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t12_q4",
      "topic_id": "scott-wu_t12",
      "topic_title": "Managing a fleet: five Devins per engineer",
      "text": "our engineering team today is about 15 people.",
      "speaker": "Scott Wu",
      "timestamp": "00:31:46",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=1906s",
      "context": "A specific data point grounding the scale of the team running this multi-agent approach.",
      "insight_type": "data"
    },
    {
      "quote_id": "scott-wu_t12_q5",
      "topic_id": "scott-wu_t12",
      "topic_title": "Managing a fleet: five Devins per engineer",
      "text": "I think we're going to shift more and more towards this agentic workflow, because that's in some ways the way to really get to that 200%, 500%, 1000% gains that we'll be getting to with software engineering over the next few years.",
      "speaker": "Scott Wu",
      "timestamp": "00:33:44",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2024s",
      "context": "A contrarian claim that the biggest productivity gains come from agentic workflows, not just faster code completion.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t13_q1",
      "topic_id": "scott-wu_t13",
      "topic_title": "Live demo: Devin adds a website feature",
      "text": "The key thing that I would just emphasize here is a lot of it obviously is really just about thinking about as a software engineer or as engineers ourselves or engineering teams, PMs, and so on. What are the things that we would want to build that we would want to hand off?",
      "speaker": "Scott Wu",
      "timestamp": "00:35:13",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2113s",
      "context": "A practical framing for adopting AI agents: focus on identifying work that can be delegated rather than starting from tools or features.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t13_q2",
      "topic_id": "scott-wu_t13",
      "topic_title": "Live demo: Devin adds a website feature",
      "text": "Again, you can work with this asynchronously, you can work with it synchronously as well.",
      "speaker": "Scott Wu",
      "timestamp": "00:36:06",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2166s",
      "context": "Highlights a key collaboration model: AI agents can be used both as background workers and in real-time pairing modes.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t13_q3",
      "topic_id": "scott-wu_t13",
      "topic_title": "Live demo: Devin adds a website feature",
      "text": "Same story here where you can let Devin make its own decisions and hand off, or you can go ahead and give some more thoughts.",
      "speaker": "Scott Wu",
      "timestamp": "00:36:06",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2166s",
      "context": "Actionable guidance on steering: choose between autonomous execution vs. injecting constraints/decisions when needed.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t13_q4",
      "topic_id": "scott-wu_t13",
      "topic_title": "Live demo: Devin adds a website feature",
      "text": "You answer these at any point, you can hand off, hand back off.",
      "speaker": "Scott Wu",
      "timestamp": "00:37:06",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2226s",
      "context": "A workflow insight: practitioners can provide mid-task guidance without blocking progress or needing perfect upfront specs.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t13_q5",
      "topic_id": "scott-wu_t13",
      "topic_title": "Live demo: Devin adds a website feature",
      "text": "One of the big pieces with Devin is Devin will always be enthusiastic, will always be ready to put in the hours.",
      "speaker": "Scott Wu",
      "timestamp": "00:37:11",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2231s",
      "context": "A memorable, counterintuitive contrast with human teams that underscores the value of persistent, tireless agent execution.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t14_q1",
      "topic_id": "scott-wu_t14",
      "topic_title": "Demo: Devin researches and builds a quiz app",
      "text": "I asked Devin, \"Hey, Devin. I'm to be on the podcast. Could you please research everything you can about him and make a nice website quiz for me so that I can make sure I know my facts?\"",
      "speaker": "Scott Wu",
      "timestamp": "00:37:24",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2244s",
      "context": "A concrete, reusable prompt pattern: agentic research + synthesis into an interactive artifact (a quiz) for interview prep.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t14_q2",
      "topic_id": "scott-wu_t14",
      "topic_title": "Demo: Devin researches and builds a quiz app",
      "text": "This is a playback of what Devin did. This is part of Devin you could just watch what it did.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:38:24",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2304s",
      "context": "Highlights an operational model for agentic tools: record-and-replay to make autonomous work inspectable and reviewable.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t14_q3",
      "topic_id": "scott-wu_t14",
      "topic_title": "Demo: Devin researches and builds a quiz app",
      "text": "Especially when you're building engineering products or something like that, you can see each of the steps that Devin was doing, or if Devin tested the code locally, obviously you want to be able to go and look and see what Devin was cooking around with and testing or things like that.",
      "speaker": "Scott Wu",
      "timestamp": "00:38:29",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2309s",
      "context": "Actionable guidance for practitioners: require step-by-step visibility and local test traces to safely integrate AI agents into engineering workflows.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t14_q4",
      "topic_id": "scott-wu_t14",
      "topic_title": "Demo: Devin researches and builds a quiz app",
      "text": "One is Devin sets up its whole wiki with all of its internal understanding.",
      "speaker": "Scott Wu",
      "timestamp": "00:39:53",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2393s",
      "context": "A memorable methodology: auto-generating an internal “wiki” as a living knowledge base of the system/codebase for both agent and humans.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t14_q5",
      "topic_id": "scott-wu_t14",
      "topic_title": "Demo: Devin researches and builds a quiz app",
      "text": "Funnily enough, we found that naturally humans really are interested to understand this code base representation as well.",
      "speaker": "Scott Wu",
      "timestamp": "00:39:53",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2393s",
      "context": "Counterintuitive observation: the agent’s internal model of the codebase becomes a valuable artifact for human comprehension, not just automation.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t15_q1",
      "topic_id": "scott-wu_t15",
      "topic_title": "Demo: Devin Wiki for codebase understanding",
      "text": "One is Devin sets up its whole wiki with all of its internal understanding.",
      "speaker": "Scott Wu",
      "timestamp": "00:39:53",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2393s",
      "context": "Highlights a practical artifact (an auto-generated wiki) teams can use to externalize an AI agent’s codebase understanding.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t15_q2",
      "topic_id": "scott-wu_t15",
      "topic_title": "Demo: Devin Wiki for codebase understanding",
      "text": "When Devin indexes the code base, obviously, building a representation of the code base and learning it and improving it over time is one of the big things that Devin does.",
      "speaker": "Scott Wu",
      "timestamp": "00:39:53",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2393s",
      "context": "Frames codebase representation as a continuously improving asset, not a one-time analysis step.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t15_q3",
      "topic_id": "scott-wu_t15",
      "topic_title": "Demo: Devin Wiki for codebase understanding",
      "text": "Funnily enough, we found that naturally humans really are interested to understand this code base representation as well.",
      "speaker": "Scott Wu",
      "timestamp": "00:39:53",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2393s",
      "context": "Counterintuitive observation that the AI’s internal model becomes valuable documentation for humans too.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t15_q4",
      "topic_id": "scott-wu_t15",
      "topic_title": "Demo: Devin Wiki for codebase understanding",
      "text": "It'll go through and it's able to search through the entire code base and give you an informed answer based off of that.",
      "speaker": "Scott Wu",
      "timestamp": "00:40:38",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2438s",
      "context": "Concrete example of using Q&A over a repo to get grounded answers directly from the codebase.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t15_q5",
      "topic_id": "scott-wu_t15",
      "topic_title": "Demo: Devin Wiki for codebase understanding",
      "text": "We use this a lot. It helps when you're scoping out a task for Devin and doing an initial prompt.",
      "speaker": "Scott Wu",
      "timestamp": "00:41:10",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2470s",
      "context": "Actionable workflow tip: use the wiki/index during task scoping and prompt drafting to reduce ambiguity.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t16_q1",
      "topic_id": "scott-wu_t16",
      "topic_title": "Sponsor Break: Attio",
      "text": "Connect your email and calendar and Attio instantly builds a CRM that matches your business model, with all of your company's Contacts and interactions enriched with actionable insights.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:41:20",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2480s",
      "context": "Highlights an auto-generated CRM approach that starts from existing communication data to produce immediately usable insights.",
      "insight_type": "framework"
    },
    {
      "quote_id": "scott-wu_t16_q2",
      "topic_id": "scott-wu_t16",
      "topic_title": "Sponsor Break: Attio",
      "text": "Sync in your product's usage, billing info, or any other data sources and Attio's flexible data model will handle it all without any rigid templates or workarounds.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:41:20",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2480s",
      "context": "Actionable guidance on unifying operational data into a CRM without forcing it into predefined schemas.",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t16_q3",
      "topic_id": "scott-wu_t16",
      "topic_title": "Sponsor Break: Attio",
      "text": "With Attio, AI isn't just a feature. It's the foundation.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:41:49",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2509s",
      "context": "A memorable positioning statement that reframes AI as core infrastructure rather than an add-on capability.",
      "insight_type": "contrarian"
    },
    {
      "quote_id": "scott-wu_t16_q4",
      "topic_id": "scott-wu_t16",
      "topic_title": "Sponsor Break: Attio",
      "text": "You can do things like instantly prospect and route leads with research agents, get real-time insights from AI using customer conversations, and build powerful AI automations for your most complex workflows.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:41:49",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2509s",
      "context": "Provides concrete examples of AI-driven CRM workflows practitioners can implement (prospecting, routing, insights, automations).",
      "insight_type": "advice"
    },
    {
      "quote_id": "scott-wu_t16_q5",
      "topic_id": "scott-wu_t16",
      "topic_title": "Sponsor Break: Attio",
      "text": "Industry leaders like Flatfile, Replicate, and Modal are already experiencing what's next for CRM.",
      "speaker": "Lenny Rachitsky",
      "timestamp": "00:41:49",
      "youtube_link": "https://www.youtube.com/watch?v=gI0ZNhA0rvE&t=2509s",
      "context": "Offers specific company examples as social proof and a reference set for teams evaluating modern CRM approaches.",
      "insight_type": "data"
    }
  ]
}